--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/TerminatedPreg_regressions.log
  log type:  text
 opened on:   3 Nov 2012, 15:43:26

. use $DATA/maternalDHS

. 
. drop if fert==0
(514567 observations deleted)

. gen poor=wealth==1

. replace height=height/1000
height was int now float
(953438 real changes made)

. ********************************************************************************
. *** (1) Globals for regression
. ********************************************************************************
. global depvars1 i.education poor rural height agefirst /*
> */ very_underweight underweight overweight moderateobese severeobese age agesq /*
> */ i._cou1 i.year_birth

. global depvars2 education educsq poor rural height agefirst /*
> */ very_underweight underweight overweight moderateobese severeobese age agesq /*
> */ i._cou1 i.year_birth

. global outreg $BASE/Results/AbortPredict

. ********************************************************************************
. *** (2) Regressions
. ********************************************************************************
. 
. 
. **ALL COUNTRIES, 1 NO FERT, 2 FERT
. reg terminated_preg $depvars2 [pw=v005], cluster(_cou)
(sum of wgt is   7.0968e+11)
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  709648
                                                       F( 53,    53) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0577
                                                       Root MSE      =  .39565

                                      (Std. Err. adjusted for 54 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       education |   .0032871   .0009161     3.59   0.001     .0014497    .0051245
          educsq |  -.0001998   .0000843    -2.37   0.021    -.0003689   -.0000308
            poor |  -.0051539   .0038539    -1.34   0.187    -.0128839    .0025761
           rural |  -.0150046   .0042178    -3.56   0.001    -.0234645   -.0065447
          height |  -.0599677   .0333773    -1.80   0.078    -.1269141    .0069787
   agefirstbirth |   -.003042   .0008906    -3.42   0.001    -.0048282   -.0012557
very_underweight |  -.0051743    .006747    -0.77   0.447     -.018707    .0083584
     underweight |  -.0005466   .0020737    -0.26   0.793     -.004706    .0036127
      overweight |   .0142304   .0033803     4.21   0.000     .0074504    .0210104
   moderateobese |   .0263959    .007321     3.61   0.001     .0117119      .04108
     severeobese |   .0360439   .0060927     5.92   0.000     .0238235    .0482643
             age |   .0302158   .0028205    10.71   0.000     .0245586    .0358731
           agesq |  -.0003892   .0000472    -8.24   0.000     -.000484   -.0002945
                 |
           _cou1 |
              3  |   .4589549    .002865   160.20   0.000     .4532085    .4647013
              4  |   .0843905   .0104635     8.07   0.000     .0634034    .1053775
              5  |   .0384828   .0076111     5.06   0.000     .0232169    .0537488
              6  |   .0477522   .0056736     8.42   0.000     .0363725    .0591319
              7  |    .042814   .0147708     2.90   0.005     .0131875    .0724404
              8  |   .0276902    .012138     2.28   0.027     .0033445    .0520359
              9  |    .058675   .0064951     9.03   0.000     .0456473    .0717026
             10  |   .1085001   .0167361     6.48   0.000     .0749317    .1420684
             11  |    .090428   .0112117     8.07   0.000     .0679402    .1129159
             12  |   .1076849   .0087376    12.32   0.000     .0901595    .1252103
             13  |   -.000308   .0082622    -0.04   0.970    -.0168799    .0162639
             14  |   .0594258   .0040945    14.51   0.000     .0512133    .0676384
             16  |   .1769582   .0057816    30.61   0.000     .1653617    .1885547
             18  |   .0821613   .0156038     5.27   0.000      .050864    .1134585
             19  |   .0459254   .0075307     6.10   0.000     .0308207    .0610301
             20  |  -.0480055   .0151986    -3.16   0.003      -.07849   -.0175211
             21  |   .1820292   .0097901    18.59   0.000     .1623926    .2016657
             22  |   .0316077   .0071248     4.44   0.000     .0173171    .0458983
             23  |  -.0277327   .0177833    -1.56   0.125    -.0634015    .0079362
             24  |   .0010907   .0077481     0.14   0.889    -.0144501    .0166315
             25  |   .1252667   .0024429    51.28   0.000     .1203667    .1301666
             26  |  -.0074122   .0114036    -0.65   0.519     -.030285    .0154606
             27  |   .0091182   .0062853     1.45   0.153    -.0034885    .0217249
             28  |   .0137955   .0072283     1.91   0.062    -.0007026    .0282936
             30  |   .1650296   .0064776    25.48   0.000     .1520372    .1780219
             31  |   .4141053   .0154682    26.77   0.000     .3830799    .4451306
             32  |  -.0517298   .0068051    -7.60   0.000    -.0653792   -.0380805
             33  |   .3419062   .0131282    26.04   0.000     .3155744    .3682381
             34  |  -.0792028   .0050751   -15.61   0.000    -.0893821   -.0690235
             35  |   .0584148    .005969     9.79   0.000     .0464425    .0703872
             36  |  -.0228202   .0093535    -2.44   0.018     -.041581   -.0040595
             37  |  -.0216294   .0089838    -2.41   0.020    -.0396486   -.0036101
             38  |   .0455061   .0050385     9.03   0.000     .0354002     .055612
             39  |   .0451831   .0098901     4.57   0.000      .025346    .0650201
             41  |   .0309305   .0110838     2.79   0.007     .0086992    .0531618
             42  |  -.0014473   .0093557    -0.15   0.878    -.0202124    .0173178
             43  |  -.0766875   .0038989   -19.67   0.000    -.0845076   -.0688673
             44  |   .1086661   .0282414     3.85   0.000     .0520209    .1653112
             45  |   -.001275    .011407    -0.11   0.911    -.0241546    .0216046
             46  |   .0237341   .0072672     3.27   0.002     .0091578    .0383103
             47  |  -.0080134   .0051716    -1.55   0.127    -.0183864    .0023595
             50  |  -.0099788   .0133115    -0.75   0.457    -.0366782    .0167207
             52  |   .0166873   .0090207     1.85   0.070    -.0014059    .0347805
             53  |  -.0060701   .0043927    -1.38   0.173    -.0148808    .0027407
             54  |   .0856915   .0051752    16.56   0.000     .0753114    .0960716
             55  |  -.0301856    .005855    -5.16   0.000    -.0419293   -.0184419
             58  |  -.0662744   .0040759   -16.26   0.000    -.0744496   -.0580992
             59  |    .044933   .0062045     7.24   0.000     .0324885    .0573776
             61  |   .1690688   .0123635    13.67   0.000     .1442707    .1938668
             62  |   .0844551   .0099704     8.47   0.000     .0644571    .1044531
             64  |    .097845   .0140951     6.94   0.000     .0695738    .1261162
             67  |   .0177629   .0075528     2.35   0.022      .002614    .0329119
             68  |  -.0475383   .0065126    -7.30   0.000    -.0606011   -.0344756
                 |
      year_birth |
           1904  |   .1754817   .0034122    51.43   0.000     .1686377    .1823257
           1905  |  -.2007864   .0076409   -26.28   0.000    -.2161121   -.1854606
           1906  |  -.0009576   .0067014    -0.14   0.887    -.0143988    .0124837
           1907  |   .0912558   .0072822    12.53   0.000     .0766495    .1058621
           1908  |   .2154276   .0083877    25.68   0.000      .198604    .2322512
           1909  |   .1342146   .0107701    12.46   0.000     .1126126    .1558166
           1910  |   .0936721   .0122437     7.65   0.000     .0691144    .1182298
           1911  |  -.0415265   .0136112    -3.05   0.004    -.0688271   -.0142259
           1912  |   .0182374   .0151948     1.20   0.235    -.0122395    .0487142
           1913  |   .0182183   .0165513     1.10   0.276    -.0149793     .051416
           1914  |   .0703614   .0183066     3.84   0.000     .0336431    .1070798
           1915  |  -.0237412   .0193146    -1.23   0.224    -.0624813     .014999
           1916  |   .0004817   .0202694     0.02   0.981    -.0401735    .0411369
           1917  |   -.024111   .0217662    -1.11   0.273    -.0677686    .0195466
           1918  |  -.0176909   .0226624    -0.78   0.438    -.0631459    .0277641
           1919  |   .0075769   .0231961     0.33   0.745    -.0389487    .0541025
           1920  |  -.0104179   .0241618    -0.43   0.668    -.0588803    .0380446
           1921  |  -.0241832   .0253033    -0.96   0.344    -.0749353    .0265688
           1922  |  -.0346263   .0260552    -1.33   0.190    -.0868863    .0176337
           1923  |  -.0630473   .0266571    -2.37   0.022    -.1165147   -.0095798
           1924  |  -.0402242   .0274123    -1.47   0.148    -.0952064     .014758
           1925  |  -.0401309   .0278916    -1.44   0.156    -.0960744    .0158126
           1926  |  -.0459433   .0286259    -1.60   0.114    -.1033595    .0114729
           1927  |  -.0302116   .0291433    -1.04   0.305    -.0886656    .0282424
           1928  |  -.0406594   .0293508    -1.39   0.172    -.0995295    .0182108
           1929  |  -.0496267   .0300763    -1.65   0.105    -.1099521    .0106988
           1930  |  -.0274311   .0304681    -0.90   0.372    -.0885424    .0336801
           1931  |  -.0422408   .0308114    -1.37   0.176    -.1040405     .019559
           1932  |   .0131425   .0312018     0.42   0.675    -.0494403    .0757253
           1933  |  -.0716776   .0315938    -2.27   0.027    -.1350468   -.0083084
           1934  |  -.0226498   .0318988    -0.71   0.481    -.0866308    .0413312
           1935  |  -.0559168   .0321273    -1.74   0.088     -.120356    .0085223
           1936  |  -.0537758   .0328828    -1.64   0.108    -.1197302    .0121787
           1937  |  -.0529747   .0327493    -1.62   0.112    -.1186614     .012712
           1941  |   .8252469   .0405937    20.33   0.000     .7438262    .9066676
           1942  |   .2430249   .0651007     3.73   0.000     .1124494    .3736004
           1943  |   .1855372     .04606     4.03   0.000     .0931525    .2779219
           1944  |   .2566783   .0459651     5.58   0.000      .164484    .3488725
           1945  |    .224507    .051611     4.35   0.000     .1209884    .3280256
           1946  |   .2186508   .0558684     3.91   0.000     .1065929    .3307087
           1947  |   .2250857   .0506134     4.45   0.000      .123568    .3266034
           1948  |   .2011232   .0480352     4.19   0.000     .1047768    .2974696
           1949  |   .1969954    .045867     4.29   0.000     .1049979     .288993
           1950  |   .1784485   .0419033     4.26   0.000     .0944012    .2624959
           1951  |   .1676925   .0441993     3.79   0.000       .07904     .256345
           1952  |   .1588248    .040909     3.88   0.000     .0767718    .2408777
           1953  |   .1592518   .0386575     4.12   0.000     .0817146     .236789
           1954  |   .1489719   .0355459     4.19   0.000     .0776759    .2202678
           1955  |   .1395569   .0378176     3.69   0.001     .0637044    .2154093
           1956  |   .1308002   .0372073     3.52   0.001     .0561718    .2054286
           1957  |   .1106525   .0343579     3.22   0.002     .0417392    .1795658
           1958  |   .1079241   .0352422     3.06   0.003     .0372373    .1786109
           1959  |   .1048481   .0322636     3.25   0.002     .0401355    .1695608
           1960  |   .0912849    .033226     2.75   0.008      .024642    .1579279
           1961  |   .0856032   .0334706     2.56   0.013     .0184697    .1527367
           1962  |   .0842732   .0304352     2.77   0.008      .023228    .1453184
           1963  |    .073678   .0284218     2.59   0.012     .0166711     .130685
           1964  |   .0699061    .028282     2.47   0.017     .0131795    .1266326
           1965  |   .0608507   .0293665     2.07   0.043      .001949    .1197523
           1966  |   .0697182    .027239     2.56   0.013     .0150836    .1243528
           1967  |   .0640534   .0257361     2.49   0.016     .0124334    .1156734
           1968  |   .0612137   .0244043     2.51   0.015      .012265    .1101625
           1969  |   .0618847   .0238337     2.60   0.012     .0140802    .1096891
           1970  |   .0537938   .0242726     2.22   0.031     .0051092    .1024785
           1971  |   .0551362   .0221444     2.49   0.016     .0107201    .0995523
           1972  |   .0589519   .0211329     2.79   0.007     .0165645    .1013392
           1973  |   .0473334   .0207124     2.29   0.026     .0057895    .0888772
           1974  |   .0507777   .0188614     2.69   0.009     .0129465    .0886088
           1975  |   .0458136   .0192758     2.38   0.021     .0071512     .084476
           1976  |    .041925   .0181722     2.31   0.025     .0054761    .0783738
           1977  |   .0505497   .0176977     2.86   0.006     .0150525    .0860469
           1978  |   .0398923   .0172196     2.32   0.024     .0053542    .0744305
           1979  |   .0442545   .0153548     2.88   0.006     .0134567    .0750524
           1980  |   .0474797    .015424     3.08   0.003      .016543    .0784164
           1981  |   .0451065   .0142277     3.17   0.003     .0165694    .0736437
           1982  |   .0390832   .0141026     2.77   0.008     .0107969    .0673695
           1983  |   .0459151   .0123433     3.72   0.000     .0211576    .0706727
           1984  |   .0530148   .0119358     4.44   0.000     .0290746    .0769549
           1985  |   .0492811   .0113649     4.34   0.000     .0264861    .0720762
           1986  |   .0493015   .0102391     4.82   0.000     .0287646    .0698385
           1987  |   .0434871   .0123664     3.52   0.001     .0186833     .068291
           1988  |   .0487166   .0100103     4.87   0.000     .0286385    .0687948
           1989  |   .0439052   .0097994     4.48   0.000     .0242502    .0635602
           1990  |   .0446774   .0147375     3.03   0.004     .0151178     .074237
           1991  |   .0437367   .0177476     2.46   0.017     .0081396    .0793339
           1992  |   .0369061   .0148136     2.49   0.016     .0071938    .0666185
           1993  |   .0354881   .0216062     1.64   0.106    -.0078483    .0788246
           1994  |   .0285301   .0218177     1.31   0.197    -.0152305    .0722908
           1995  |   .0378478   .0216733     1.75   0.087    -.0056235     .081319
           1996  |          0  (omitted)
                 |
           _cons |  -.2645542   .0540666    -4.89   0.000    -.3729981   -.1561104
----------------------------------------------------------------------------------

. outreg2 using $outreg/terminated_preg.xls, excel replace
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout

. reg terminated_preg fertility $depvars2 [pw=v005], cluster(_cou)
(sum of wgt is   7.0968e+11)
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  709648
                                                       F( 53,    53) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0577
                                                       Root MSE      =  .39565

                                      (Std. Err. adjusted for 54 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       fertility |    .001193   .0027296     0.44   0.664    -.0042819    .0066678
       education |   .0033883   .0010035     3.38   0.001     .0013756     .005401
          educsq |  -.0002021   .0000861    -2.35   0.023    -.0003748   -.0000295
            poor |  -.0054953   .0040079    -1.37   0.176    -.0135342    .0025436
           rural |  -.0155081   .0041088    -3.77   0.000    -.0237492   -.0072669
          height |  -.0599154   .0332318    -1.80   0.077      -.12657    .0067392
   agefirstbirth |  -.0027642   .0013814    -2.00   0.051     -.005535    6.67e-06
very_underweight |   -.005107   .0066535    -0.77   0.446    -.0184521    .0082382
     underweight |  -.0006035   .0021304    -0.28   0.778    -.0048765    .0036696
      overweight |   .0143994   .0033239     4.33   0.000     .0077325    .0210662
   moderateobese |   .0267028   .0071498     3.73   0.000     .0123622    .0410435
     severeobese |   .0364384   .0062261     5.85   0.000     .0239505    .0489264
             age |   .0295333   .0026221    11.26   0.000      .024274    .0347927
           agesq |  -.0003813   .0000418    -9.12   0.000    -.0004652   -.0002975
                 |
           _cou1 |
              3  |   .4587362   .0029908   153.38   0.000     .4527373     .464735
              4  |   .0843144   .0105279     8.01   0.000     .0631982    .1054307
              5  |   .0372463   .0089537     4.16   0.000     .0192874    .0552053
              6  |   .0465816   .0070453     6.61   0.000     .0324504    .0607127
              7  |   .0420165    .015291     2.75   0.008     .0113466    .0726864
              8  |    .026739   .0126785     2.11   0.040     .0013092    .0521689
              9  |   .0569293   .0095452     5.96   0.000      .037784    .0760745
             10  |   .1073435   .0173252     6.20   0.000     .0725935    .1420935
             11  |   .0898138   .0116597     7.70   0.000     .0664274    .1132001
             12  |   .1062657   .0100393    10.58   0.000     .0861295     .126402
             13  |  -.0020991   .0104445    -0.20   0.841    -.0230481      .01885
             14  |    .059276   .0042217    14.04   0.000     .0508083    .0677437
             16  |   .1761333   .0067065    26.26   0.000     .1626818    .1895848
             18  |   .0819124   .0157256     5.21   0.000     .0503708     .113454
             19  |   .0450094   .0082203     5.48   0.000     .0285215    .0614973
             20  |  -.0485596   .0154804    -3.14   0.003    -.0796094   -.0175098
             21  |   .1802364   .0115109    15.66   0.000     .1571484    .2033244
             22  |   .0307715   .0078816     3.90   0.000     .0149631    .0465799
             23  |  -.0290319   .0185915    -1.56   0.124    -.0663217    .0082579
             24  |   .0000572   .0084717     0.01   0.995    -.0169349    .0170493
             25  |   .1250059   .0027777    45.00   0.000     .1194346    .1305773
             26  |   -.008343   .0120614    -0.69   0.492     -.032535    .0158491
             27  |   .0082581   .0072563     1.14   0.260    -.0062963    .0228124
             28  |   .0138277   .0072236     1.91   0.061    -.0006609    .0283163
             30  |   .1624949   .0094602    17.18   0.000     .1435202    .1814695
             31  |    .414901   .0153081    27.10   0.000     .3841968    .4456051
             32  |  -.0530221   .0083751    -6.33   0.000    -.0698204   -.0362237
             33  |   .3415813   .0132801    25.72   0.000     .3149448    .3682177
             34  |  -.0796398   .0056507   -14.09   0.000    -.0909737    -.068306
             35  |   .0574539   .0070155     8.19   0.000     .0433826    .0715252
             36  |  -.0239585   .0105004    -2.28   0.027    -.0450197   -.0028974
             37  |  -.0227554    .010183    -2.23   0.030      -.04318   -.0023309
             38  |   .0450496   .0057249     7.87   0.000      .033567    .0565322
             39  |   .0435808   .0110937     3.93   0.000     .0213296    .0658319
             41  |   .0303229   .0114217     2.65   0.010     .0074138    .0532321
             42  |  -.0022929   .0100535    -0.23   0.820    -.0224578    .0178719
             43  |  -.0772782   .0047292   -16.34   0.000    -.0867638   -.0677926
             44  |   .1021573   .0320137     3.19   0.002     .0379458    .1663687
             45  |  -.0019143   .0117316    -0.16   0.871    -.0254448    .0216162
             46  |   .0219024   .0093277     2.35   0.023     .0031934    .0406114
             47  |  -.0097908   .0077933    -1.26   0.215    -.0254221    .0058405
             50  |  -.0105503   .0136234    -0.77   0.442    -.0378754    .0167748
             52  |    .015259   .0107111     1.42   0.160    -.0062248    .0367428
             53  |  -.0072055   .0061061    -1.18   0.243    -.0194528    .0050418
             54  |   .0843616   .0068315    12.35   0.000     .0706593     .098064
             55  |   -.031068   .0070788    -4.39   0.000    -.0452664   -.0168697
             58  |  -.0670664   .0051102   -13.12   0.000    -.0773161   -.0568166
             59  |   .0437095   .0079354     5.51   0.000     .0277931    .0596259
             61  |   .1680845   .0132361    12.70   0.000     .1415362    .1946328
             62  |      .0828   .0114756     7.22   0.000     .0597829    .1058171
             64  |   .0974687   .0142678     6.83   0.000     .0688511    .1260864
             67  |   .0163183   .0092037     1.77   0.082     -.002142    .0347787
             68  |  -.0482227   .0072676    -6.64   0.000    -.0627997   -.0336458
                 |
      year_birth |
           1904  |   .1779483   .0046241    38.48   0.000     .1686734    .1872231
           1905  |  -.1966365   .0076999   -25.54   0.000    -.2120806   -.1811925
           1906  |   .0008684   .0058618     0.15   0.883    -.0108888    .0126256
           1907  |   .0939126   .0080083    11.73   0.000       .07785    .1099752
           1908  |   .2176896   .0090136    24.15   0.000     .1996105    .2357687
           1909  |   .1375513   .0109565    12.55   0.000     .1155753    .1595273
           1910  |   .0969554   .0121103     8.01   0.000     .0726651    .1212456
           1911  |  -.0373171   .0138887    -2.69   0.010    -.0651743   -.0094599
           1912  |   .0218084   .0143622     1.52   0.135    -.0069985    .0506153
           1913  |   .0220779   .0157761     1.40   0.168     -.009565    .0537207
           1914  |   .0751322   .0174281     4.31   0.000     .0401759    .1100885
           1915  |  -.0187347   .0183717    -1.02   0.312    -.0555838    .0181143
           1916  |   .0058392   .0195311     0.30   0.766    -.0333353    .0450138
           1917  |  -.0186663    .020617    -0.91   0.369    -.0600187    .0226862
           1918  |  -.0122809   .0215109    -0.57   0.570    -.0554262    .0308645
           1919  |   .0136406   .0226606     0.60   0.550    -.0318109     .059092
           1920  |  -.0042149   .0234277    -0.18   0.858     -.051205    .0427751
           1921  |  -.0178949   .0242351    -0.74   0.464    -.0665044    .0307146
           1922  |   -.028013   .0252416    -1.11   0.272    -.0786412    .0226153
           1923  |  -.0564735   .0259913    -2.17   0.034    -.1086054   -.0043416
           1924  |  -.0336012   .0266198    -1.26   0.212    -.0869937    .0197913
           1925  |  -.0332088   .0273491    -1.21   0.230     -.088064    .0216465
           1926  |   -.038869    .028157    -1.38   0.173    -.0953449    .0176069
           1927  |   -.023076   .0288257    -0.80   0.427    -.0808929     .034741
           1928  |   -.033466   .0292197    -1.15   0.257    -.0920733    .0251412
           1929  |  -.0423148   .0299959    -1.41   0.164     -.102479    .0178493
           1930  |  -.0201213   .0306266    -0.66   0.514    -.0815506    .0413079
           1931  |  -.0348663   .0312886    -1.11   0.270    -.0976232    .0278906
           1932  |   .0205156   .0318735     0.64   0.523    -.0434145    .0844457
           1933  |    -.06432   .0326167    -1.97   0.054    -.1297407    .0011008
           1934  |  -.0152962   .0331466    -0.46   0.646    -.0817798    .0511874
           1935  |  -.0486758   .0337315    -1.44   0.155    -.1163327     .018981
           1936  |  -.0469041    .034328    -1.37   0.178    -.1157574    .0219491
           1937  |  -.0460202   .0349825    -1.32   0.194    -.1161862    .0241458
           1941  |   .8203658   .0424653    19.32   0.000     .7351912    .9055404
           1942  |   .2395048   .0662088     3.62   0.001     .1067067    .3723028
           1943  |   .1828322   .0462989     3.95   0.000     .0899684     .275696
           1944  |   .2542547   .0456689     5.57   0.000     .1626545    .3458549
           1945  |    .221564    .052522     4.22   0.000     .1162183    .3269098
           1946  |   .2164703   .0560983     3.86   0.000     .1039513    .3289892
           1947  |   .2230449   .0506277     4.41   0.000     .1214987    .3245912
           1948  |   .1992526   .0479583     4.15   0.000     .1030605    .2954447
           1949  |   .1952483   .0458347     4.26   0.000     .1033156     .287181
           1950  |   .1767477   .0423207     4.18   0.000     .0918633    .2616322
           1951  |   .1662824   .0442495     3.76   0.000     .0775291    .2550357
           1952  |   .1575521   .0410984     3.83   0.000     .0751191     .239985
           1953  |   .1580007   .0388541     4.07   0.000     .0800693    .2359322
           1954  |   .1478743   .0357672     4.13   0.000     .0761345    .2196142
           1955  |   .1386812   .0379048     3.66   0.001     .0626538    .2147086
           1956  |   .1302147   .0373602     3.49   0.001     .0552797    .2051497
           1957  |   .1102524   .0346342     3.18   0.002     .0407851    .1797198
           1958  |   .1076891   .0354742     3.04   0.004      .036537    .1788413
           1959  |   .1047505   .0324841     3.22   0.002     .0395957    .1699053
           1960  |   .0913098   .0333658     2.74   0.008     .0243865    .1582332
           1961  |   .0858001   .0335187     2.56   0.013     .0185701    .1530301
           1962  |   .0845711   .0304699     2.78   0.008     .0234562    .1456859
           1963  |   .0740965   .0283716     2.61   0.012     .0171902    .1310028
           1964  |   .0704912   .0281998     2.50   0.016     .0139294    .1270529
           1965  |   .0615855   .0289464     2.13   0.038     .0035263    .1196446
           1966  |    .070462   .0271216     2.60   0.012      .016063    .1248611
           1967  |    .064946   .0254758     2.55   0.014     .0138481    .1160439
           1968  |    .062121   .0241933     2.57   0.013     .0135953    .1106467
           1969  |   .0629443   .0236162     2.67   0.010     .0155763    .1103124
           1970  |   .0549429    .023721     2.32   0.024     .0073647    .1025211
           1971  |   .0563581    .021851     2.58   0.013     .0125306    .1001857
           1972  |    .060221    .021012     2.87   0.006     .0180763    .1023656
           1973  |   .0486123   .0207156     2.35   0.023      .007062    .0901625
           1974  |   .0521352   .0189508     2.75   0.008     .0141247    .0901457
           1975  |   .0472458   .0189399     2.49   0.016     .0092571    .0852345
           1976  |    .043361   .0181663     2.39   0.021      .006924    .0797979
           1977  |   .0520221   .0176012     2.96   0.005     .0167185    .0873257
           1978  |    .041413   .0176108     2.35   0.022     .0060902    .0767358
           1979  |   .0457513   .0155134     2.95   0.005     .0146353    .0768672
           1980  |   .0490199   .0158539     3.09   0.003     .0172209    .0808189
           1981  |   .0466389   .0148067     3.15   0.003     .0169404    .0763373
           1982  |   .0406194   .0146513     2.77   0.008     .0112326    .0700063
           1983  |   .0474684   .0127025     3.74   0.000     .0219903    .0729464
           1984  |   .0545586   .0127254     4.29   0.000     .0290347    .0800825
           1985  |   .0507611   .0116413     4.36   0.000     .0274117    .0741105
           1986  |   .0508854   .0113266     4.49   0.000      .028167    .0736037
           1987  |   .0449505   .0133003     3.38   0.001     .0182734    .0716276
           1988  |   .0503181   .0103589     4.86   0.000     .0295408    .0710954
           1989  |   .0453849   .0101673     4.46   0.000     .0249919    .0657779
           1990  |   .0462045   .0143267     3.23   0.002     .0174689    .0749402
           1991  |   .0450405   .0172988     2.60   0.012     .0103434    .0797376
           1992  |   .0381255   .0145685     2.62   0.012     .0089048    .0673462
           1993  |   .0364093   .0214473     1.70   0.095    -.0066085    .0794271
           1994  |   .0293841   .0217059     1.35   0.182    -.0141524    .0729205
           1995  |   .0382385   .0217821     1.76   0.085    -.0054508    .0819278
           1996  |          0  (omitted)
                 |
           _cons |  -.2609278   .0540405    -4.83   0.000    -.3693193   -.1525363
----------------------------------------------------------------------------------

. outreg2 using $outreg/terminated_preg.xls, excel append
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout

. **ALL COUNTRIES EDUC QUADRATIC, 1 NO FERT, 2 FERT
. reg terminated_preg $depvars1 [pw=v005], cluster(_cou)
(sum of wgt is   7.0968e+11)
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  709648
                                                       F( 53,    53) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0579
                                                       Root MSE      =  .39561

                                      (Std. Err. adjusted for 54 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       education |
              1  |   .0233047   .0071161     3.27   0.002     .0090316    .0375778
              2  |   .0194142   .0043928     4.42   0.000     .0106033    .0282251
              3  |   .0146076   .0051993     2.81   0.007     .0041792    .0250361
              4  |   .0141709   .0038523     3.68   0.001     .0064442    .0218976
              5  |   .0131599   .0048416     2.72   0.009     .0034489    .0228709
              6  |   .0134597   .0037844     3.56   0.001     .0058693    .0210502
              7  |   .0161387   .0040372     4.00   0.000     .0080411    .0242364
              8  |   .0163809   .0045385     3.61   0.001     .0072778    .0254841
              9  |   .0208164   .0067645     3.08   0.003     .0072485    .0343843
             10  |   .0149438   .0082026     1.82   0.074    -.0015084    .0313961
             11  |   .0061658   .0056885     1.08   0.283     -.005244    .0175755
             12  |   .0095414   .0092616     1.03   0.308    -.0090349    .0281178
             13  |   .0128483   .0110726     1.16   0.251    -.0093606    .0350573
             14  |   .0124073   .0066946     1.85   0.069    -.0010203    .0258349
             15  |   .0195238    .012839     1.52   0.134     -.006228    .0452756
             16  |   -.007027   .0126538    -0.56   0.581    -.0324073    .0183534
             17  |   .0217101   .0113761     1.91   0.062    -.0011074    .0445276
             18  |  -.0150121   .0362147    -0.41   0.680    -.0876497    .0576254
             19  |   .0838488   .0423329     1.98   0.053    -.0010601    .1687578
             20  |   .0234264   .0387774     0.60   0.548    -.0543511     .101204
             21  |   .1951666    .080778     2.42   0.019     .0331464    .3571867
             22  |   .1072178   .0439419     2.44   0.018     .0190816    .1953541
             23  |  -.1275376   .0225481    -5.66   0.000    -.1727634   -.0823118
             24  |   .2860249   .3252184     0.88   0.383    -.3662807    .9383304
                 |
            poor |  -.0051512   .0037963    -1.36   0.181    -.0127656    .0024633
           rural |  -.0151816   .0041936    -3.62   0.001    -.0235929   -.0067702
          height |  -.0587662   .0335688    -1.75   0.086    -.1260967    .0085642
   agefirstbirth |  -.0030339   .0008863    -3.42   0.001    -.0048115   -.0012562
very_underweight |  -.0046437   .0066477    -0.70   0.488    -.0179774      .00869
     underweight |  -.0002529    .002041    -0.12   0.902    -.0043467    .0038409
      overweight |   .0139974   .0033292     4.20   0.000     .0073199    .0206749
   moderateobese |    .026082   .0072784     3.58   0.001     .0114834    .0406806
     severeobese |   .0356688   .0060851     5.86   0.000     .0234636     .047874
             age |   .0303133   .0028256    10.73   0.000     .0246459    .0359807
           agesq |  -.0003901    .000047    -8.30   0.000    -.0004844   -.0002958
                 |
           _cou1 |
              3  |   .4576578   .0042073   108.78   0.000      .449219    .4660967
              4  |   .0830335   .0117167     7.09   0.000     .0595329    .1065342
              5  |      .0382   .0084883     4.50   0.000     .0211746    .0552254
              6  |   .0449556     .00725     6.20   0.000     .0304139    .0594972
              7  |   .0407935    .015954     2.56   0.013     .0087939    .0727931
              8  |   .0285714   .0129635     2.20   0.032     .0025699    .0545729
              9  |   .0579442   .0076429     7.58   0.000     .0426145    .0732739
             10  |   .1073749   .0178664     6.01   0.000     .0715394    .1432103
             11  |    .087025   .0126479     6.88   0.000     .0616566    .1123933
             12  |   .1067014   .0098081    10.88   0.000     .0870289    .1263739
             13  |  -.0008593   .0090584    -0.09   0.925    -.0190282    .0173096
             14  |   .0590906   .0055822    10.59   0.000     .0478941    .0702872
             16  |   .1747005   .0070219    24.88   0.000     .1606165    .1887846
             18  |   .0802529   .0165109     4.86   0.000     .0471362    .1133697
             19  |   .0466506   .0082471     5.66   0.000     .0301091    .0631922
             20  |  -.0482005   .0161703    -2.98   0.004     -.080634    -.015767
             21  |   .1803689    .010923    16.51   0.000     .1584601    .2022777
             22  |   .0296814   .0082515     3.60   0.001     .0131311    .0462318
             23  |  -.0296784   .0190554    -1.56   0.125    -.0678986    .0085418
             24  |   .0016568   .0084259     0.20   0.845    -.0152434    .0185569
             25  |   .1247753   .0038718    32.23   0.000     .1170094    .1325412
             26  |  -.0099388   .0127293    -0.78   0.438    -.0354705     .015593
             27  |    .006629   .0076454     0.87   0.390    -.0087058    .0219638
             28  |   .0127578   .0083126     1.53   0.131    -.0039152    .0294308
             30  |   .1639458   .0072421    22.64   0.000       .14942    .1784716
             31  |   .4137987   .0161976    25.55   0.000     .3813104    .4462869
             32  |  -.0529699   .0073355    -7.22   0.000     -.067683   -.0382567
             33  |   .3413236   .0141465    24.13   0.000     .3129492    .3696979
             34  |  -.0808743    .006008   -13.46   0.000    -.0929249   -.0688238
             35  |    .057465   .0068146     8.43   0.000     .0437966    .0711333
             36  |  -.0260265   .0108352    -2.40   0.020    -.0477591   -.0042939
             37  |  -.0239356   .0101271    -2.36   0.022     -.044248   -.0036233
             38  |   .0446564   .0062295     7.17   0.000     .0321616    .0571512
             39  |   .0457035   .0106745     4.28   0.000     .0242933    .0671138
             41  |   .0310973   .0120747     2.58   0.013     .0068786     .055316
             42  |  -.0039979   .0106133    -0.38   0.708    -.0252854    .0172895
             43  |  -.0786461   .0048872   -16.09   0.000    -.0884484   -.0688437
             44  |    .108293    .027198     3.98   0.000     .0537407    .1628452
             45  |  -.0024601    .012551    -0.20   0.845    -.0276342    .0227141
             46  |   .0242586   .0079338     3.06   0.003     .0083454    .0401719
             47  |  -.0079725   .0059758    -1.33   0.188    -.0199584    .0040133
             50  |  -.0099896   .0145003    -0.69   0.494    -.0390735    .0190943
             52  |   .0146643   .0102465     1.43   0.158    -.0058877    .0352162
             53  |  -.0088624   .0055043    -1.61   0.113    -.0199026    .0021778
             54  |   .0854493   .0057573    14.84   0.000     .0739016    .0969971
             55  |  -.0299555   .0067509    -4.44   0.000     -.043496   -.0164149
             58  |  -.0678332   .0050126   -13.53   0.000    -.0778872   -.0577793
             59  |   .0434797   .0069978     6.21   0.000     .0294439    .0575155
             61  |   .1695416   .0140498    12.07   0.000     .1413614    .1977219
             62  |   .0820325   .0111738     7.34   0.000     .0596207    .1044443
             64  |   .0972579   .0151826     6.41   0.000     .0668054    .1277104
             67  |   .0151548   .0086652     1.75   0.086    -.0022254     .032535
             68  |  -.0480785   .0074531    -6.45   0.000    -.0630274   -.0331295
                 |
      year_birth |
           1904  |   .1755103   .0033847    51.85   0.000     .1687214    .1822992
           1905  |  -.2007071    .007582   -26.47   0.000    -.2159147   -.1854994
           1906  |   -.000871   .0066446    -0.13   0.896    -.0141984    .0124563
           1907  |   .0913698   .0072258    12.65   0.000     .0768768    .1058628
           1908  |   .2155399   .0083173    25.91   0.000     .1988574    .2322223
           1909  |   .1345011   .0106805    12.59   0.000     .1130788    .1559234
           1910  |   .0936322   .0121364     7.72   0.000     .0692897    .1179746
           1911  |  -.0412939   .0135047    -3.06   0.003    -.0683809    -.014207
           1912  |    .018087   .0150713     1.20   0.235    -.0121422    .0483162
           1913  |   .0182855   .0164377     1.11   0.271    -.0146843    .0512554
           1914  |    .070029   .0181984     3.85   0.000     .0335277    .1065302
           1915  |  -.0233493   .0191735    -1.22   0.229    -.0618066    .0151079
           1916  |   .0007036   .0201502     0.03   0.972    -.0397125    .0411197
           1917  |  -.0239897   .0216027    -1.11   0.272    -.0673191    .0193398
           1918  |  -.0177007   .0225724    -0.78   0.436    -.0629752    .0275738
           1919  |   .0076291   .0230306     0.33   0.742    -.0385644    .0538227
           1920  |  -.0100492     .02405    -0.42   0.678    -.0582873     .038189
           1921  |  -.0244834   .0252012    -0.97   0.336    -.0750306    .0260638
           1922  |  -.0346733    .025935    -1.34   0.187    -.0866924    .0173458
           1923  |  -.0633171   .0265705    -2.38   0.021    -.1166107   -.0100234
           1924  |  -.0404741   .0273475    -1.48   0.145    -.0953263    .0143781
           1925  |  -.0403266    .027859    -1.45   0.154    -.0962046    .0155515
           1926  |  -.0459303   .0285459    -1.61   0.114    -.1031861    .0113256
           1927  |  -.0302059   .0290583    -1.04   0.303    -.0884895    .0280777
           1928  |  -.0408877   .0292722    -1.40   0.168    -.0996002    .0178249
           1929  |  -.0501135   .0300354    -1.67   0.101    -.1103569    .0101298
           1930  |  -.0279984   .0305183    -0.92   0.363    -.0892104    .0332136
           1931  |  -.0425154   .0308371    -1.38   0.174    -.1043668     .019336
           1932  |   .0117419   .0313205     0.37   0.709     -.051079    .0745629
           1933  |  -.0724498   .0317475    -2.28   0.027    -.1361272   -.0087725
           1934  |  -.0231109   .0319929    -0.72   0.473    -.0872805    .0410587
           1935  |  -.0571254   .0324209    -1.76   0.084    -.1221535    .0079028
           1936  |  -.0544408   .0330317    -1.65   0.105     -.120694    .0118123
           1937  |  -.0553285   .0329515    -1.68   0.099    -.1214209    .0107639
           1941  |   .8068431   .0394688    20.44   0.000     .7276788    .8860074
           1942  |   .2419061   .0649261     3.73   0.000     .1116809    .3721313
           1943  |   .1849835   .0458641     4.03   0.000     .0929917    .2769753
           1944  |   .2559778   .0459436     5.57   0.000     .1638266    .3481291
           1945  |    .223658   .0516452     4.33   0.000     .1200709    .3272452
           1946  |   .2173389   .0560923     3.87   0.000      .104832    .3298457
           1947  |   .2232149    .050488     4.42   0.000     .1219488     .324481
           1948  |   .1991437   .0479953     4.15   0.000     .1028774      .29541
           1949  |   .1952043   .0456382     4.28   0.000     .1036658    .2867429
           1950  |   .1765704   .0415312     4.25   0.000     .0932693    .2598715
           1951  |   .1658454   .0441672     3.75   0.000     .0772571    .2544336
           1952  |   .1572354    .040558     3.88   0.000     .0758863    .2385845
           1953  |   .1576538   .0388838     4.05   0.000     .0796626    .2356449
           1954  |   .1472819   .0354104     4.16   0.000     .0762576    .2183061
           1955  |   .1377549    .037614     3.66   0.001     .0623109    .2131989
           1956  |   .1290295   .0370674     3.48   0.001     .0546816    .2033773
           1957  |   .1089702   .0341612     3.19   0.002     .0404516    .1774888
           1958  |   .1061546   .0350522     3.03   0.004     .0358487    .1764604
           1959  |    .103203    .032099     3.22   0.002     .0388206    .1675854
           1960  |   .0896811   .0330995     2.71   0.009      .023292    .1560703
           1961  |   .0839193   .0334185     2.51   0.015     .0168904    .1509483
           1962  |   .0825907    .030261     2.73   0.009     .0218948    .1432865
           1963  |   .0721598   .0282691     2.55   0.014     .0154593    .1288604
           1964  |   .0684316   .0281613     2.43   0.019     .0119472    .1249161
           1965  |   .0594092   .0292583     2.03   0.047     .0007245    .1180939
           1966  |   .0683575   .0271538     2.52   0.015      .013894    .1228211
           1967  |    .062719   .0256424     2.45   0.018     .0112869    .1141511
           1968  |   .0599293   .0242633     2.47   0.017     .0112634    .1085953
           1969  |    .060615   .0238525     2.54   0.014     .0127729     .108457
           1970  |   .0525699   .0240695     2.18   0.033     .0042925    .1008473
           1971  |   .0539163   .0219846     2.45   0.018     .0098208    .0980118
           1972  |   .0577514   .0210448     2.74   0.008     .0155409    .0999619
           1973  |   .0461662   .0206757     2.23   0.030      .004696    .0876364
           1974  |   .0498054   .0186656     2.67   0.010      .012367    .0872438
           1975  |    .044845   .0192579     2.33   0.024     .0062185    .0834716
           1976  |   .0410038   .0180566     2.27   0.027     .0047868    .0772208
           1977  |   .0496277   .0175454     2.83   0.007      .014436    .0848194
           1978  |   .0390663   .0171553     2.28   0.027     .0046572    .0734754
           1979  |   .0435013   .0151575     2.87   0.006     .0130993    .0739034
           1980  |   .0467583   .0152133     3.07   0.003     .0162443    .0772723
           1981  |   .0444348   .0139371     3.19   0.002     .0164805    .0723891
           1982  |   .0384288   .0139944     2.75   0.008     .0103595    .0664981
           1983  |    .045386   .0123208     3.68   0.001     .0206736    .0700983
           1984  |   .0525145   .0118804     4.42   0.000     .0286855    .0763434
           1985  |   .0489164      .0114     4.29   0.000     .0260508    .0717819
           1986  |   .0490668   .0103537     4.74   0.000        .0283    .0698336
           1987  |   .0431981    .012467     3.47   0.001     .0181926    .0682037
           1988  |   .0485025   .0099681     4.87   0.000      .028509     .068496
           1989  |   .0435904   .0099252     4.39   0.000      .023683    .0634978
           1990  |   .0445375   .0147109     3.03   0.004     .0150312    .0740439
           1991  |   .0437034   .0179227     2.44   0.018      .007755    .0796519
           1992  |   .0364207   .0148746     2.45   0.018     .0065859    .0662554
           1993  |   .0346704   .0218483     1.59   0.118    -.0091518    .0784926
           1994  |   .0273158   .0220831     1.24   0.222    -.0169774     .071609
           1995  |   .0359103   .0218059     1.65   0.106    -.0078268    .0796475
           1996  |          0  (omitted)
                 |
           _cons |  -.2686505   .0566135    -4.75   0.000    -.3822028   -.1550982
----------------------------------------------------------------------------------

. outreg2 using $outreg/terminated_preg.xls, excel append
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout

. reg terminated_preg fertility $depvars1 [pw=v005], cluster(_cou)
(sum of wgt is   7.0968e+11)
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  709648
                                                       F( 54,    53) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0579
                                                       Root MSE      =  .39561

                                      (Std. Err. adjusted for 54 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       fertility |   .0011693   .0027293     0.43   0.670    -.0043051    .0066436
                 |
       education |
              1  |   .0233243    .007125     3.27   0.002     .0090332    .0376153
              2  |   .0195532   .0045343     4.31   0.000     .0104586    .0286478
              3  |   .0148617   .0053472     2.78   0.008     .0041366    .0255869
              4  |   .0145287   .0040181     3.62   0.001     .0064695     .022588
              5  |   .0136331   .0050465     2.70   0.009     .0035111     .023755
              6  |    .013958   .0040611     3.44   0.001     .0058125    .0221035
              7  |    .016686   .0038944     4.28   0.000     .0088749    .0244971
              8  |    .017011   .0049631     3.43   0.001     .0070564    .0269657
              9  |   .0215227   .0075294     2.86   0.006     .0064207    .0366247
             10  |   .0156678   .0086011     1.82   0.074    -.0015837    .0329193
             11  |    .006959   .0054855     1.27   0.210    -.0040436    .0179616
             12  |   .0104617    .009092     1.15   0.255    -.0077746     .028698
             13  |   .0137466   .0112874     1.22   0.229    -.0088932    .0363863
             14  |   .0133676   .0068202     1.96   0.055     -.000312    .0270472
             15  |   .0204055   .0127165     1.60   0.115    -.0051007    .0459116
             16  |  -.0060149   .0120301    -0.50   0.619    -.0301443    .0181144
             17  |   .0228153    .011647     1.96   0.055    -.0005455    .0461762
             18  |  -.0141248   .0358359    -0.39   0.695    -.0860025    .0577529
             19  |   .0848196   .0421532     2.01   0.049     .0002709    .1693683
             20  |   .0244162   .0385752     0.63   0.529    -.0529558    .1017881
             21  |   .1960383   .0815576     2.40   0.020     .0324545     .359622
             22  |   .1078375   .0431831     2.50   0.016     .0212231    .1944519
             23  |  -.1273826    .022474    -5.67   0.000    -.1724597   -.0823054
             24  |   .2860843   .3257269     0.88   0.384    -.3672412    .9394098
                 |
            poor |   -.005486   .0039454    -1.39   0.170    -.0133994    .0024274
           rural |  -.0156743     .00408    -3.84   0.000    -.0238579   -.0074908
          height |  -.0587178   .0334287    -1.76   0.085    -.1257673    .0083318
   agefirstbirth |  -.0027617   .0013783    -2.00   0.050    -.0055263    2.87e-06
very_underweight |  -.0045788   .0065574    -0.70   0.488    -.0177312    .0085736
     underweight |  -.0003095   .0020917    -0.15   0.883     -.004505     .003886
      overweight |   .0141635   .0032637     4.34   0.000     .0076174    .0207096
   moderateobese |   .0263827   .0071012     3.72   0.000     .0121395     .040626
     severeobese |   .0360548   .0062087     5.81   0.000     .0236017    .0485078
             age |   .0296444   .0026139    11.34   0.000     .0244015    .0348873
           agesq |  -.0003823   .0000415    -9.21   0.000    -.0004656   -.0002991
                 |
           _cou1 |
              3  |   .4574733   .0043612   104.90   0.000     .4487259    .4662208
              4  |   .0829688     .01178     7.04   0.000     .0593411    .1065964
              5  |   .0369952   .0098276     3.76   0.000     .0172836    .0567068
              6  |   .0438119   .0084744     5.17   0.000     .0268145    .0608094
              7  |   .0400335   .0164411     2.43   0.018     .0070569    .0730102
              8  |   .0276452   .0135239     2.04   0.046     .0005196    .0547709
              9  |   .0562413   .0105163     5.35   0.000     .0351483    .0773344
             10  |    .106252   .0184588     5.76   0.000     .0692283    .1432757
             11  |   .0864418   .0130894     6.60   0.000     .0601878    .1126958
             12  |   .1053226   .0110628     9.52   0.000     .0831335    .1275118
             13  |  -.0026055   .0112468    -0.23   0.818    -.0251637    .0199528
             14  |   .0589582   .0056842    10.37   0.000     .0475572    .0703592
             16  |   .1739062   .0079313    21.93   0.000      .157998    .1898143
             18  |   .0800211   .0166323     4.81   0.000      .046661    .1133812
             19  |   .0457563   .0088677     5.16   0.000     .0279699    .0635427
             20  |  -.0487341   .0164609    -2.96   0.005    -.0817504   -.0157177
             21  |   .1786218   .0125926    14.18   0.000     .1533643    .2038793
             22  |   .0288778   .0090499     3.19   0.002      .010726    .0470296
             23  |  -.0309356   .0198542    -1.56   0.125     -.070758    .0088868
             24  |   .0006494   .0091942     0.07   0.944    -.0177918    .0190906
             25  |   .1245449   .0041421    30.07   0.000      .116237    .1328529
             26  |  -.0108337   .0133889    -0.81   0.422    -.0376885    .0160211
             27  |      .0058   .0085364     0.68   0.500    -.0113218    .0229217
             28  |   .0127999   .0083019     1.54   0.129    -.0038515    .0294514
             30  |   .1614708   .0101245    15.95   0.000     .1411637    .1817779
             31  |   .4146088    .016009    25.90   0.000     .3824988    .4467187
             32  |  -.0542222   .0088038    -6.16   0.000    -.0718804    -.036564
             33  |   .3410437   .0143026    23.84   0.000     .3123562    .3697311
             34  |  -.0812837   .0065033   -12.50   0.000    -.0943278   -.0682396
             35  |   .0565316   .0078404     7.21   0.000     .0408059    .0722574
             36  |  -.0271272   .0119389    -2.27   0.027    -.0510737   -.0031807
             37  |  -.0250238   .0112735    -2.22   0.031    -.0476356   -.0024119
             38  |   .0442295   .0068165     6.49   0.000     .0305573    .0579017
             39  |   .0441389    .011904     3.71   0.001     .0202625    .0680153
             41  |   .0305078   .0124207     2.46   0.017     .0055951    .0554206
             42  |   -.004811   .0113045    -0.43   0.672     -.027485    .0178629
             43  |   -.079212   .0056852   -13.93   0.000     -.090615    -.067809
             44  |   .1019207   .0314184     3.24   0.002     .0389033    .1649381
             45  |  -.0030696   .0128673    -0.24   0.812    -.0288781     .022739
             46  |    .022468   .0100213     2.24   0.029     .0023677    .0425682
             47  |  -.0097103   .0084516    -1.15   0.256     -.026662    .0072414
             50  |  -.0105322   .0147901    -0.71   0.480    -.0401975     .019133
             52  |   .0132782   .0118593     1.12   0.268    -.0105085    .0370649
             53  |  -.0099608    .007057    -1.41   0.164    -.0241152    .0041937
             54  |   .0841509   .0074738    11.26   0.000     .0691603    .0991415
             55  |   -.030813   .0079268    -3.89   0.000    -.0467122   -.0149139
             58  |  -.0685974   .0059838   -11.46   0.000    -.0805993   -.0565954
             59  |   .0423063   .0083908     5.04   0.000     .0254765    .0591361
             61  |   .1685693   .0148444    11.36   0.000     .1387951    .1983435
             62  |   .0804288   .0126123     6.38   0.000     .0551317    .1057259
             64  |   .0969311   .0153663     6.31   0.000     .0661102    .1277519
             67  |   .0137561   .0102076     1.35   0.184    -.0067177      .03423
             68  |  -.0487235   .0081188    -6.00   0.000    -.0650077   -.0324392
                 |
      year_birth |
           1904  |   .1779281   .0046289    38.44   0.000     .1686436    .1872125
           1905  |  -.1966396   .0076968   -25.55   0.000    -.2120773   -.1812018
           1906  |   .0009182   .0058301     0.16   0.875    -.0107756    .0126119
           1907  |   .0939729   .0079968    11.75   0.000     .0779333    .1100124
           1908  |   .2177558   .0089835    24.24   0.000     .1997371    .2357744
           1909  |   .1377699   .0109441    12.59   0.000     .1158187     .159721
           1910  |    .096849   .0120703     8.02   0.000     .0726391    .1210589
           1911  |  -.0371697   .0138584    -2.68   0.010    -.0649662   -.0093732
           1912  |   .0215865   .0142962     1.51   0.137     -.007088     .050261
           1913  |   .0220679   .0157379     1.40   0.167    -.0094984    .0536343
           1914  |   .0747045   .0173849     4.30   0.000     .0398347    .1095742
           1915  |  -.0184443   .0183304    -1.01   0.319    -.0552104    .0183218
           1916  |   .0059533   .0195075     0.31   0.761    -.0331738    .0450804
           1917  |  -.0186557   .0205681    -0.91   0.368      -.05991    .0225986
           1918  |  -.0123997   .0215111    -0.58   0.567    -.0555455     .030746
           1919  |   .0135721    .022626     0.60   0.551    -.0318099    .0589541
           1920  |  -.0039719   .0234236    -0.17   0.866    -.0509537      .04301
           1921  |  -.0183186   .0242124    -0.76   0.453    -.0668825    .0302453
           1922  |  -.0281918   .0252644    -1.12   0.270    -.0788658    .0224822
           1923  |  -.0568733   .0260222    -2.19   0.033    -.1090672   -.0046793
           1924  |  -.0339835   .0267012    -1.27   0.209    -.0875393    .0195723
           1925  |  -.0335425   .0274486    -1.22   0.227    -.0885974    .0215125
           1926  |  -.0389965   .0282303    -1.38   0.173    -.0956192    .0176263
           1927  |  -.0232106   .0289156    -0.80   0.426    -.0812079    .0347867
           1928  |  -.0338362   .0293049    -1.15   0.253    -.0926145    .0249421
           1929  |  -.0429446   .0301097    -1.43   0.160    -.1033371    .0174478
           1930  |  -.0208309   .0308328    -0.68   0.502    -.0826736    .0410119
           1931  |  -.0352858   .0314947    -1.12   0.268    -.0984563    .0278846
           1932  |   .0189746   .0321236     0.59   0.557    -.0454572    .0834063
           1933  |  -.0652356   .0329482    -1.98   0.053    -.1313214    .0008501
           1934  |  -.0159001   .0334464    -0.48   0.636    -.0829851     .051185
           1935  |  -.0500239   .0342008    -1.46   0.149     -.118622    .0185741
           1936  |  -.0477007   .0347054    -1.37   0.175    -.1173109    .0219095
           1937  |  -.0485013    .035269    -1.38   0.175     -.119242    .0222394
           1941  |   .8021309   .0417132    19.23   0.000     .7184647    .8857971
           1942  |   .2384554   .0660945     3.61   0.001     .1058866    .3710242
           1943  |   .1823308   .0461705     3.95   0.000     .0897244    .2749371
           1944  |   .2536011   .0457152     5.55   0.000      .161908    .3452943
           1945  |   .2207718   .0526164     4.20   0.000     .1152367    .3263069
           1946  |   .2152017   .0563633     3.82   0.000     .1021513     .328252
           1947  |   .2212171   .0505673     4.37   0.000     .1197919    .3226424
           1948  |    .197313   .0479675     4.11   0.000     .1011024    .2935237
           1949  |   .1934934   .0456596     4.24   0.000     .1019119     .285075
           1950  |   .1749051   .0420105     4.16   0.000     .0906427    .2591675
           1951  |   .1644651   .0442537     3.72   0.000     .0757035    .2532268
           1952  |   .1559893   .0407821     3.82   0.000     .0741907    .2377878
           1953  |   .1564287   .0391091     4.00   0.000     .0779857    .2348716
           1954  |   .1462088    .035665     4.10   0.000     .0746739    .2177437
           1955  |   .1368987   .0377305     3.63   0.001     .0612209    .2125766
           1956  |   .1284568   .0372399     3.45   0.001     .0537629    .2031507
           1957  |   .1085797   .0344516     3.15   0.003     .0394785    .1776809
           1958  |   .1059264   .0352953     3.00   0.004      .035133    .1767198
           1959  |   .1031096    .032326     3.19   0.002     .0382719    .1679473
           1960  |   .0897075   .0332423     2.70   0.009     .0230319     .156383
           1961  |    .084114    .033466     2.51   0.015     .0169897    .1512383
           1962  |   .0828848   .0302932     2.74   0.008     .0221244    .1436453
           1963  |   .0725715   .0282136     2.57   0.013     .0159822    .1291608
           1964  |   .0690067   .0280692     2.46   0.017      .012707    .1253065
           1965  |   .0601303   .0288266     2.09   0.042     .0023114    .1179491
           1966  |   .0690876   .0270256     2.56   0.013      .014881    .1232942
           1967  |   .0635948   .0253687     2.51   0.015     .0127117    .1144779
           1968  |   .0608192   .0240389     2.53   0.014     .0126033    .1090351
           1969  |   .0616542    .023621     2.61   0.012     .0142765    .1090319
           1970  |   .0536965   .0235017     2.28   0.026     .0065579     .100835
           1971  |   .0551144   .0216728     2.54   0.014     .0116442    .0985846
           1972  |   .0589956   .0209069     2.82   0.007     .0170616    .1009296
           1973  |   .0474201   .0206643     2.29   0.026     .0059727    .0888675
           1974  |   .0511359   .0187407     2.73   0.009     .0135468    .0887251
           1975  |   .0462487   .0189128     2.45   0.018     .0083144    .0841829
           1976  |   .0424116   .0180336     2.35   0.022     .0062408    .0785824
           1977  |   .0510721   .0174395     2.93   0.005     .0160929    .0860513
           1978  |   .0405585   .0175398     2.31   0.025     .0053782    .0757389
           1979  |   .0449701   .0153139     2.94   0.005     .0142542     .075686
           1980  |   .0482695   .0156477     3.08   0.003     .0168843    .0796547
           1981  |   .0459383   .0145261     3.16   0.003     .0168026     .075074
           1982  |   .0399365   .0145512     2.74   0.008     .0107504    .0691225
           1983  |   .0469098   .0126889     3.70   0.001     .0214591    .0723605
           1984  |   .0540293   .0126864     4.26   0.000     .0285836    .0794749
           1985  |   .0503684   .0117001     4.30   0.000     .0269011    .0738358
           1986  |   .0506205   .0114552     4.42   0.000     .0276444    .0735966
           1987  |   .0446347    .013416     3.33   0.002     .0177257    .0715438
           1988  |   .0500743   .0103395     4.84   0.000     .0293359    .0708127
           1989  |   .0450433   .0103153     4.37   0.000     .0243534    .0657331
           1990  |   .0460373   .0143051     3.22   0.002     .0173449    .0747298
           1991  |   .0449838   .0174768     2.57   0.013     .0099299    .0800378
           1992  |   .0376178   .0146041     2.58   0.013     .0083257    .0669098
           1993  |   .0355755    .021664     1.64   0.106    -.0078769    .0790278
           1994  |   .0281512   .0219717     1.28   0.206    -.0159183    .0722208
           1995  |   .0362917   .0219021     1.66   0.103    -.0076384    .0802218
           1996  |          0  (omitted)
                 |
           _cons |  -.2650955   .0564852    -4.69   0.000    -.3783904   -.1518006
----------------------------------------------------------------------------------

. outreg2 using $outreg/terminated_preg.xls, excel append
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout

. **SPLIT BY COUNTRY INCOME LEVELS
. foreach inc in LOWINCOME LOWERMIDDLE UPPERMIDDLE {
  2.         reg terminated_preg $depvars2 [pw=v005] if income_status=="`inc'", cluster(_cou)
  3.         outreg2 using $outreg/terminated_preg.xls, excel append 
  4.         reg terminated_preg fertility $depvars2 [pw=v005] if income_status=="`inc'", cluster(_cou)
  5.         outreg2 using $outreg/terminated_preg.xls, excel append
  6. }
(sum of wgt is   2.7427e+11)
note: 1995.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  271660
                                                       F( 23,    23) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0514
                                                       Root MSE      =  .37729

                                      (Std. Err. adjusted for 24 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       education |   .0031912   .0012914     2.47   0.021     .0005198    .0058626
          educsq |  -.0002334   .0001119    -2.09   0.048     -.000465   -1.93e-06
            poor |  -.0008081   .0054837    -0.15   0.884    -.0121519    .0105358
           rural |  -.0083405   .0052291    -1.60   0.124    -.0191578    .0024768
          height |  -.0830411   .0210935    -3.94   0.001    -.1266764   -.0394058
   agefirstbirth |  -.0023269   .0007174    -3.24   0.004    -.0038111   -.0008428
very_underweight |  -.0000174    .007456    -0.00   0.998    -.0154413    .0154064
     underweight |  -.0001316   .0030905    -0.04   0.966    -.0065247    .0062616
      overweight |   .0148124   .0037577     3.94   0.001     .0070391    .0225858
   moderateobese |   .0314575   .0070914     4.44   0.000     .0167877    .0461273
     severeobese |    .010611   .0099742     1.06   0.298    -.0100222    .0312443
             age |   .0226624   .0039186     5.78   0.000     .0145561    .0307687
           agesq |  -.0002737   .0000635    -4.31   0.000    -.0004051   -.0001424
                 |
           _cou1 |
              5  |  -.0416817   .0041082   -10.15   0.000    -.0501802   -.0331832
              8  |  -.0542448   .0049551   -10.95   0.000    -.0644952   -.0439945
              9  |  -.0244977   .0090988    -2.69   0.013      -.04332   -.0056753
             10  |   .0254624   .0097846     2.60   0.016     .0052213    .0457034
             11  |   .0052389   .0029073     1.80   0.085    -.0007754    .0112531
             13  |  -.0802349   .0038547   -20.81   0.000     -.088209   -.0722607
             20  |  -.1294186   .0077881   -16.62   0.000    -.1455295   -.1133077
             24  |   -.082273   .0041079   -20.03   0.000    -.0907709   -.0737751
             26  |   -.088259   .0042804   -20.62   0.000    -.0971136   -.0794044
             32  |  -.1311364   .0036713   -35.72   0.000    -.1387311   -.1235417
             33  |     .26564   .0114215    23.26   0.000     .2420129    .2892671
             35  |  -.0217158   .0053781    -4.04   0.001    -.0328413   -.0105903
             36  |  -.1069149   .0023631   -45.24   0.000    -.1118034   -.1020265
             37  |  -.1028538   .0018951   -54.27   0.000    -.1067741   -.0989334
             39  |  -.0362681   .0029273   -12.39   0.000    -.0423237   -.0302126
             42  |  -.0840658   .0020682   -40.65   0.000    -.0883441   -.0797874
             44  |  -.0779551   .0493513    -1.58   0.128    -.1800459    .0241358
             46  |  -.0576879   .0048291   -11.95   0.000    -.0676777   -.0476982
             52  |  -.0663433   .0033581   -19.76   0.000    -.0732902   -.0593965
             55  |  -.1101864   .0067268   -16.38   0.000    -.1241019   -.0962709
             59  |  -.0353007   .0056495    -6.25   0.000    -.0469876   -.0236138
             62  |   .0033596   .0018147     1.85   0.077    -.0003945    .0071137
             68  |  -.1252875   .0046561   -26.91   0.000    -.1349194   -.1156557
                 |
      year_birth |
           1904  |     .17826   .0033139    53.79   0.000     .1714047    .1851152
           1905  |  -.1972785   .0060974   -32.35   0.000     -.209892    -.184665
           1906  |   .0092382    .007803     1.18   0.249    -.0069034    .0253799
           1907  |   .1059803   .0104339    10.16   0.000     .0843961    .1275646
           1908  |    .235128   .0128026    18.37   0.000     .2086439    .2616122
           1909  |   .1558475   .0147477    10.57   0.000     .1253396    .1863553
           1910  |   .1172652   .0171398     6.84   0.000     .0818088    .1527216
           1911  |  -.0150367   .0188766    -0.80   0.434    -.0540859    .0240125
           1912  |   .0457977   .0204512     2.24   0.035     .0034911    .0881043
           1913  |   .0480195   .0224592     2.14   0.043     .0015591    .0944798
           1914  |    .100301   .0239071     4.20   0.000     .0508455    .1497565
           1915  |   .0075221   .0252032     0.30   0.768    -.0446146    .0596588
           1916  |   .0330148   .0268849     1.23   0.232    -.0226008    .0886303
           1917  |     .00866   .0281516     0.31   0.761    -.0495759     .066896
           1918  |   .0159177   .0294813     0.54   0.594     -.045069    .0769043
           1919  |    .041831    .030837     1.36   0.188    -.0219602    .1056221
           1920  |   .0239617   .0317233     0.76   0.458     -.041663    .0895864
           1921  |   .0101797   .0326865     0.31   0.758    -.0574374    .0777969
           1922  |  -.0007713   .0336384    -0.02   0.982    -.0703577    .0688151
           1923  |  -.0296469   .0346536    -0.86   0.401    -.1013333    .0420396
           1924  |  -.0075858   .0353273    -0.21   0.832    -.0806658    .0654942
           1925  |  -.0083178   .0360841    -0.23   0.820    -.0829635    .0663278
           1926  |   -.015814   .0367848    -0.43   0.671     -.091909    .0602811
           1927  |  -.0019527   .0374364    -0.05   0.959    -.0793957    .0754904
           1928  |  -.0131382   .0379982    -0.35   0.733    -.0917434     .065467
           1929  |   -.024321   .0385042    -0.63   0.534     -.103973     .055331
           1930  |  -.0046132   .0390493    -0.12   0.907    -.0853929    .0761664
           1931  |  -.0218267     .03968    -0.55   0.588    -.1039109    .0602576
           1932  |   .0312874    .040231     0.78   0.445    -.0519369    .1145116
           1933  |   -.057016   .0408112    -1.40   0.176    -.1414405    .0274084
           1934  |  -.0105484    .041315    -0.26   0.801     -.096015    .0749181
           1935  |  -.0470733   .0420011    -1.12   0.274    -.1339591    .0398126
           1936  |  -.0475621   .0424133    -1.12   0.274    -.1353007    .0401766
           1937  |  -.0499589   .0432285    -1.16   0.260    -.1393838    .0394661
           1942  |   .1798319   .0545732     3.30   0.003     .0669386    .2927253
           1943  |   .0883134   .0536351     1.65   0.113    -.0226393    .1992662
           1944  |    .157647   .0520526     3.03   0.006     .0499679     .265326
           1945  |    .161551   .0598256     2.70   0.013     .0377923    .2853097
           1946  |   .1570613   .0502867     3.12   0.005     .0530353    .2610873
           1947  |   .1360587   .0612718     2.22   0.037     .0093083    .2628092
           1948  |   .1198563    .050538     2.37   0.026     .0153105     .224402
           1949  |    .093328   .0682697     1.37   0.185    -.0478986    .2345547
           1950  |   .0996903   .0682549     1.46   0.158    -.0415058    .2408863
           1951  |   .0601258   .0598259     1.01   0.325    -.0636335    .1838851
           1952  |   .0602835   .0541716     1.11   0.277    -.0517789    .1723459
           1953  |   .0782426   .0517908     1.51   0.144    -.0288949    .1853802
           1954  |   .0436803   .0506307     0.86   0.397    -.0610572    .1484178
           1955  |   .0444704   .0478048     0.93   0.362    -.0544214    .1433622
           1956  |     .04677   .0425853     1.10   0.283    -.0413243    .1348644
           1957  |   .0145785    .044828     0.33   0.748    -.0781552    .1073122
           1958  |   .0292254    .043577     0.67   0.509    -.0609205    .1193712
           1959  |   .0321305   .0409566     0.78   0.441    -.0525946    .1168557
           1960  |   .0258352    .041984     0.62   0.544    -.0610153    .1126857
           1961  |   .0156409   .0372532     0.42   0.678    -.0614232     .092705
           1962  |   .0093382   .0364477     0.26   0.800    -.0660596    .0847361
           1963  |   .0075818   .0347115     0.22   0.829    -.0642243    .0793879
           1964  |  -.0028875   .0353809    -0.08   0.936    -.0760784    .0703034
           1965  |   .0062052   .0376061     0.17   0.870    -.0715891    .0839994
           1966  |   .0041453   .0320181     0.13   0.898    -.0620892    .0703799
           1967  |  -.0071278    .032964    -0.22   0.831    -.0753191    .0610635
           1968  |  -.0098125   .0322838    -0.30   0.764    -.0765965    .0569716
           1969  |  -.0063364   .0313269    -0.20   0.841    -.0711409    .0584681
           1970  |  -.0111038   .0291983    -0.38   0.707    -.0715052    .0492976
           1971  |  -.0120233   .0303561    -0.40   0.696    -.0748198    .0507731
           1972  |  -.0152404   .0282811    -0.54   0.595    -.0737443    .0432636
           1973  |   -.024071   .0276408    -0.87   0.393    -.0812505    .0331084
           1974  |  -.0246186   .0274139    -0.90   0.378    -.0813285    .0320914
           1975  |  -.0182871   .0262922    -0.70   0.494    -.0726767    .0361024
           1976  |  -.0352439   .0241046    -1.46   0.157    -.0851081    .0146202
           1977  |  -.0210122   .0264803    -0.79   0.436    -.0757908    .0337665
           1978  |  -.0327462   .0271888    -1.20   0.241    -.0889904    .0234981
           1979  |  -.0371877   .0228575    -1.63   0.117     -.084472    .0100965
           1980  |  -.0317508   .0235162    -1.35   0.190    -.0803979    .0168962
           1981  |  -.0389746   .0228496    -1.71   0.102    -.0862425    .0082934
           1982  |  -.0400878   .0223084    -1.80   0.085    -.0862362    .0060606
           1983  |  -.0363066   .0207629    -1.75   0.094    -.0792579    .0066447
           1984  |   -.031413   .0203683    -1.54   0.137     -.073548     .010722
           1985  |  -.0278794   .0205962    -1.35   0.189     -.070486    .0147272
           1986  |  -.0425179   .0221328    -1.92   0.067    -.0883031    .0032674
           1987  |  -.0498112   .0249028    -2.00   0.057    -.1013265    .0017042
           1988  |  -.0391223   .0188879    -2.07   0.050    -.0781949   -.0000498
           1989  |  -.0442021    .019539    -2.26   0.033    -.0846216   -.0037826
           1990  |  -.0309227     .02153    -1.44   0.164    -.0754609    .0136154
           1991  |   -.031099   .0269662    -1.15   0.261    -.0868829     .024685
           1992  |  -.0430881   .0214136    -2.01   0.056    -.0873856    .0012094
           1993  |  -.0461198   .0238513    -1.93   0.066      -.09546    .0032204
           1994  |  -.0338197   .0337839    -1.00   0.327     -.103707    .0360677
           1995  |          0  (omitted)
                 |
           _cons |   .0184341    .048301     0.38   0.706    -.0814841    .1183524
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout
(sum of wgt is   2.7427e+11)
note: 1995.year_birth omitted because of collinearity

Linear regression                                      Number of obs =  271660
                                                       F( 23,    23) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0519
                                                       Root MSE      =  .37719

                                      (Std. Err. adjusted for 24 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       fertility |  -.0056373   .0016816    -3.35   0.003     -.009116   -.0021587
       education |   .0029609   .0012956     2.29   0.032     .0002808    .0056411
          educsq |  -.0002399   .0001122    -2.14   0.043     -.000472   -7.81e-06
            poor |   .0002171   .0054361     0.04   0.968    -.0110284    .0114625
           rural |  -.0057691   .0053554    -1.08   0.293    -.0168476    .0053093
          height |  -.0819565   .0211197    -3.88   0.001     -.125646   -.0382669
   agefirstbirth |  -.0037714   .0009004    -4.19   0.000    -.0056341   -.0019088
very_underweight |  -.0007954    .007705    -0.10   0.919    -.0167344    .0151436
     underweight |  -.0001649   .0031458    -0.05   0.959    -.0066724    .0063427
      overweight |   .0139801   .0036344     3.85   0.001     .0064618    .0214984
   moderateobese |   .0294579   .0071022     4.15   0.000     .0147659    .0441499
     severeobese |   .0076949   .0093513     0.82   0.419    -.0116498    .0270396
             age |   .0256575    .004409     5.82   0.000     .0165368    .0347781
           agesq |  -.0003044   .0000707    -4.31   0.000    -.0004507   -.0001582
                 |
           _cou1 |
              5  |  -.0361836   .0048804    -7.41   0.000    -.0462794   -.0260878
              8  |  -.0498466   .0044864   -11.11   0.000    -.0591273   -.0405658
              9  |  -.0167005   .0100611    -1.66   0.111    -.0375136    .0041125
             10  |    .031196   .0088128     3.54   0.002     .0129653    .0494267
             11  |    .007236   .0027258     2.65   0.014     .0015974    .0128747
             13  |  -.0717267   .0054616   -13.13   0.000    -.0830249   -.0604286
             20  |  -.1266669   .0073765   -17.17   0.000    -.1419264   -.1114074
             24  |  -.0779193    .004791   -16.26   0.000    -.0878301   -.0680084
             26  |  -.0841994   .0035575   -23.67   0.000    -.0915587   -.0768402
             32  |  -.1257139    .003724   -33.76   0.000    -.1334177   -.1180101
             33  |   .2667982   .0113235    23.56   0.000     .2433738    .2902225
             35  |  -.0178397   .0057806    -3.09   0.005    -.0297978   -.0058816
             36  |  -.1020747   .0030296   -33.69   0.000    -.1083419   -.0958074
             37  |  -.0980938   .0023206   -42.27   0.000    -.1028943   -.0932932
             39  |  -.0289251   .0033643    -8.60   0.000    -.0358847   -.0219655
             42  |  -.0804645   .0024953   -32.25   0.000    -.0856264   -.0753026
             44  |   -.047844   .0520131    -0.92   0.367    -.1554413    .0597533
             46  |  -.0493903   .0064267    -7.69   0.000    -.0626851   -.0360956
             52  |  -.0603166   .0038471   -15.68   0.000     -.068275   -.0523583
             55  |  -.1062758   .0070474   -15.08   0.000    -.1208545   -.0916972
             59  |   -.030326   .0060508    -5.01   0.000    -.0428431   -.0178089
             62  |   .0105207   .0019004     5.54   0.000     .0065895    .0144519
             68  |  -.1227021   .0044272   -27.72   0.000    -.1318604   -.1135438
                 |
      year_birth |
           1904  |    .167387   .0058042    28.84   0.000     .1553802    .1793939
           1905  |  -.2155335   .0101634   -21.21   0.000    -.2365582   -.1945088
           1906  |   .0018788   .0095567     0.20   0.846    -.0178906    .0216483
           1907  |   .0946846    .013122     7.22   0.000     .0675396    .1218296
           1908  |   .2257743   .0150848    14.97   0.000      .194569    .2569797
           1909  |   .1417913    .018134     7.82   0.000     .1042783    .1793043
           1910  |   .1038966   .0203965     5.09   0.000     .0617032    .1460899
           1911  |  -.0325379   .0230807    -1.41   0.172    -.0802841    .0152082
           1912  |   .0316851   .0238872     1.33   0.198    -.0177293    .0810995
           1913  |   .0327723   .0261829     1.25   0.223    -.0213911    .0869357
           1914  |   .0811318   .0284894     2.85   0.009     .0221971    .1400665
           1915  |  -.0125116   .0299556    -0.42   0.680    -.0744796    .0494564
           1916  |    .011537   .0319264     0.36   0.721    -.0545077    .0775817
           1917  |  -.0129211   .0332167    -0.39   0.701     -.081635    .0557929
           1918  |  -.0053676   .0344468    -0.16   0.878    -.0766263    .0658911
           1919  |   .0175916   .0364038     0.48   0.633    -.0577154    .0928986
           1920  |  -.0007536     .03733    -0.02   0.984    -.0779766    .0764693
           1921  |  -.0146896   .0382951    -0.38   0.705     -.093909    .0645299
           1922  |  -.0270636   .0394707    -0.69   0.500    -.1087149    .0545877
           1923  |   -.055649   .0403376    -1.38   0.181    -.1390936    .0277957
           1924  |  -.0336997   .0409331    -0.82   0.419    -.1183763    .0509769
           1925  |    -.03573   .0418594    -0.85   0.402    -.1223227    .0508627
           1926  |    -.04383   .0425629    -1.03   0.314     -.131878     .044218
           1927  |  -.0301548   .0430863    -0.70   0.491    -.1192856    .0589761
           1928  |  -.0416177   .0435579    -0.96   0.349    -.1317241    .0484886
           1929  |  -.0533188   .0439857    -1.21   0.238    -.1443101    .0376724
           1930  |  -.0335248   .0442776    -0.76   0.457    -.1251199    .0580703
           1931  |  -.0510297   .0447237    -1.14   0.266    -.1435478    .0414884
           1932  |   .0019977   .0450496     0.04   0.965    -.0911945      .09519
           1933  |  -.0862262   .0452669    -1.90   0.069     -.179868    .0074155
           1934  |  -.0397421   .0454796    -0.87   0.391    -.1338238    .0543395
           1935  |  -.0758191   .0457009    -1.66   0.111    -.1703586    .0187203
           1936  |  -.0747549   .0455759    -1.64   0.115    -.1690359     .019526
           1937  |  -.0774212   .0460044    -1.68   0.106    -.1725887    .0177462
           1942  |   .1893906   .0544933     3.48   0.002     .0766627    .3021185
           1943  |   .0970559   .0530681     1.83   0.080    -.0127239    .2068357
           1944  |   .1659339   .0510969     3.25   0.004      .060232    .2716358
           1945  |   .1722757   .0616077     2.80   0.010     .0448304    .2997209
           1946  |   .1656516   .0497706     3.33   0.003     .0626932      .26861
           1947  |   .1440739   .0622504     2.31   0.030      .015299    .2728487
           1948  |   .1275799   .0507224     2.52   0.019     .0226526    .2325072
           1949  |   .1013366   .0699263     1.45   0.161    -.0433169    .2459902
           1950  |   .1088859   .0700504     1.55   0.134    -.0360243    .2537962
           1951  |   .0679453   .0593725     1.14   0.264    -.0548762    .1907668
           1952  |   .0672673   .0536901     1.25   0.223     -.043799    .1783337
           1953  |   .0858743   .0514095     1.67   0.108    -.0204742    .1922229
           1954  |   .0507667   .0504567     1.01   0.325    -.0536109    .1551443
           1955  |   .0505503   .0477858     1.06   0.301    -.0483021    .1494027
           1956  |   .0523792   .0415512     1.26   0.220     -.033576    .1383345
           1957  |   .0193399    .043703     0.44   0.662    -.0710666    .1097463
           1958  |   .0328706   .0426316     0.77   0.449    -.0553196    .1210608
           1959  |   .0359402   .0395275     0.91   0.373    -.0458286     .117709
           1960  |   .0290722    .040843     0.71   0.484    -.0554179    .1135623
           1961  |   .0186197   .0359315     0.52   0.609    -.0557103    .0929497
           1962  |   .0115948    .035175     0.33   0.745    -.0611701    .0843598
           1963  |    .009166   .0335432     0.27   0.787    -.0602234    .0785553
           1964  |  -.0016317   .0341149    -0.05   0.962    -.0722038    .0689404
           1965  |   .0068859   .0363324     0.19   0.851    -.0682735    .0820452
           1966  |   .0048526   .0306361     0.16   0.876    -.0585231    .0682282
           1967  |  -.0072254   .0318647    -0.23   0.823    -.0731426    .0586918
           1968  |   -.009969   .0311164    -0.32   0.752    -.0743381    .0544001
           1969  |  -.0070944   .0303805    -0.23   0.817    -.0699411    .0557524
           1970  |  -.0123901   .0281789    -0.44   0.664    -.0706826    .0459024
           1971  |  -.0136103   .0294438    -0.46   0.648    -.0745196    .0472989
           1972  |  -.0170806   .0273577    -0.62   0.539    -.0736743    .0395132
           1973  |  -.0262331   .0268885    -0.98   0.339    -.0818562      .02939
           1974  |  -.0269696   .0267635    -1.01   0.324    -.0823341    .0283948
           1975  |  -.0213035    .025776    -0.83   0.417    -.0746251    .0320182
           1976  |  -.0381514   .0237533    -1.61   0.122    -.0872888     .010986
           1977  |  -.0241416    .026151    -0.92   0.366     -.078239    .0299558
           1978  |  -.0360646   .0266908    -1.35   0.190    -.0912789    .0191496
           1979  |  -.0405335   .0225566    -1.80   0.085    -.0871953    .0061283
           1980  |  -.0354033   .0231106    -1.53   0.139    -.0832113    .0124047
           1981  |  -.0427193   .0223743    -1.91   0.069    -.0890041    .0035655
           1982  |  -.0437149   .0220337    -1.98   0.059     -.089295    .0018652
           1983  |  -.0398501   .0206204    -1.93   0.066    -.0825066    .0028065
           1984  |   -.035246   .0202724    -1.74   0.095    -.0771826    .0066907
           1985  |  -.0314967   .0206148    -1.53   0.140    -.0741418    .0111483
           1986  |  -.0465337   .0223171    -2.09   0.048       -.0927   -.0003673
           1987  |  -.0532819   .0246278    -2.16   0.041    -.1042284   -.0023354
           1988  |  -.0426668   .0189195    -2.26   0.034    -.0818048   -.0035287
           1989  |  -.0476441   .0198729    -2.40   0.025    -.0887544   -.0065339
           1990  |  -.0342236   .0213988    -1.60   0.123    -.0784905    .0100433
           1991  |  -.0336618   .0272786    -1.23   0.230     -.090092    .0227683
           1992  |  -.0450589   .0216974    -2.08   0.049    -.0899434   -.0001745
           1993  |  -.0476502   .0241579    -1.97   0.061    -.0976247    .0023243
           1994  |  -.0348462   .0347207    -1.00   0.326    -.1066714     .036979
           1995  |          0  (omitted)
                 |
           _cons |  -.0019037   .0498449    -0.04   0.970    -.1050158    .1012084
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout
(sum of wgt is   2.9704e+11)

Linear regression                                      Number of obs =  295337
                                                       F( 18,    18) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0318
                                                       Root MSE      =  .39759

                                      (Std. Err. adjusted for 19 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       education |   .0035217   .0012434     2.83   0.011     .0009093    .0061341
          educsq |  -.0002063   .0001477    -1.40   0.179    -.0005166    .0001039
            poor |  -.0137597   .0058892    -2.34   0.031    -.0261325   -.0013868
           rural |  -.0116086    .005138    -2.26   0.037     -.022403   -.0008141
          height |  -.1057637   .0306622    -3.45   0.003    -.1701826   -.0413447
   agefirstbirth |  -.0021682   .0017021    -1.27   0.219    -.0057442    .0014077
very_underweight |  -.0113037   .0074045    -1.53   0.144      -.02686    .0042525
     underweight |  -.0040914   .0027036    -1.51   0.148    -.0097714    .0015886
      overweight |   .0101808   .0066926     1.52   0.146    -.0038798    .0242414
   moderateobese |   .0184601   .0097303     1.90   0.074    -.0019825    .0389027
     severeobese |   .0353108   .0101967     3.46   0.003     .0138883    .0567333
             age |   .0314294   .0034253     9.18   0.000      .024233    .0386257
           agesq |  -.0004299   .0000632    -6.80   0.000    -.0005626   -.0002971
                 |
           _cou1 |
              6  |   .0390544   .0078062     5.00   0.000     .0226542    .0554547
             12  |   .0972551   .0146408     6.64   0.000     .0664959    .1280142
             16  |   .1693753    .009473    17.88   0.000     .1494733    .1892774
             19  |   .0362434   .0115956     3.13   0.006     .0118818    .0606049
             22  |   .0227895   .0117341     1.94   0.068    -.0018629    .0474418
             23  |   -.050703   .0262238    -1.93   0.069    -.1057971    .0043912
             25  |   .1223141   .0031078    39.36   0.000     .1157848    .1288434
             27  |   .0006548   .0093999     0.07   0.945    -.0190936    .0204032
             28  |    .005315   .0106947     0.50   0.625    -.0171538    .0277838
             34  |  -.0862533   .0078296   -11.02   0.000    -.1027027   -.0698039
             41  |   .0198991   .0183122     1.09   0.292    -.0185733    .0583715
             45  |  -.0161597   .0170061    -0.95   0.355    -.0518882    .0195688
             47  |  -.0144522   .0083056    -1.74   0.099    -.0319016    .0029971
             53  |  -.0095701   .0075798    -1.26   0.223    -.0254947    .0063545
             54  |   .0835083   .0083138    10.04   0.000     .0660417     .100975
             58  |  -.0722599   .0060293   -11.98   0.000    -.0849269   -.0595928
             64  |   .0775955   .0222367     3.49   0.003     .0308778    .1243131
             67  |   .0071895   .0121012     0.59   0.560    -.0182341    .0326131
                 |
      year_birth |
           1943  |  -.0185232   .0150353    -1.23   0.234    -.0501113    .0130649
           1944  |    .222781   .0764273     2.91   0.009     .0622132    .3833487
           1945  |  -.0096069   .0088026    -1.09   0.290    -.0281005    .0088868
           1946  |   .0873185   .1200044     0.73   0.476    -.1648013    .3394383
           1947  |   .1575793   .0224403     7.02   0.000      .110434    .2047246
           1948  |   .0965804   .0444096     2.17   0.043     .0032793    .1898815
           1949  |   .1213455   .0158894     7.64   0.000     .0879632    .1547278
           1950  |    .064305   .0197555     3.26   0.004     .0228001    .1058098
           1951  |   .0823544    .017148     4.80   0.000     .0463278    .1183811
           1952  |   .0601276   .0160184     3.75   0.001     .0264741    .0937811
           1953  |   .0795763   .0187692     4.24   0.000     .0401437    .1190088
           1954  |   .0642929   .0258392     2.49   0.023     .0100067    .1185791
           1955  |   .0423411   .0114166     3.71   0.002     .0183556    .0663265
           1956  |   .0298005   .0153308     1.94   0.068    -.0024083    .0620093
           1957  |   .0047281   .0280625     0.17   0.868    -.0542291    .0636853
           1958  |    .001314   .0261606     0.05   0.960    -.0536474    .0562753
           1959  |  -.0069709   .0261277    -0.27   0.793    -.0618631    .0479214
           1960  |  -.0315447   .0311935    -1.01   0.325    -.0970797    .0339904
           1961  |  -.0372446   .0340533    -1.09   0.289     -.108788    .0342988
           1962  |  -.0312307    .033028    -0.95   0.357      -.10062    .0381586
           1963  |  -.0505175   .0329352    -1.53   0.142    -.1197118    .0186768
           1964  |  -.0485148   .0348087    -1.39   0.180    -.1216453    .0246156
           1965  |  -.0764003   .0385062    -1.98   0.063    -.1572989    .0044983
           1966  |  -.0460929   .0372459    -1.24   0.232    -.1243437    .0321578
           1967  |  -.0577469   .0393409    -1.47   0.159    -.1403991    .0249052
           1968  |   -.067319   .0383325    -1.76   0.096    -.1478525    .0132145
           1969  |  -.0606499    .039102    -1.55   0.138    -.1428002    .0215004
           1970  |  -.0781342   .0441189    -1.77   0.093    -.1708246    .0145561
           1971  |  -.0722894   .0421253    -1.72   0.103    -.1607914    .0162127
           1972  |  -.0637724   .0441203    -1.45   0.166    -.1564656    .0289209
           1973  |  -.0775212   .0417694    -1.86   0.080    -.1652754     .010233
           1974  |  -.0760862   .0445305    -1.71   0.105    -.1696414     .017469
           1975  |  -.0832782   .0470156    -1.77   0.093    -.1820543    .0154979
           1976  |  -.0806877   .0460156    -1.75   0.097    -.1773629    .0159875
           1977  |  -.0796793   .0474762    -1.68   0.111    -.1794231    .0200644
           1978  |  -.0889099   .0465457    -1.91   0.072    -.1866987    .0088789
           1979  |  -.0820111     .04972    -1.65   0.116    -.1864689    .0224468
           1980  |  -.0785653   .0499107    -1.57   0.133    -.1834237    .0262931
           1981  |  -.0809049   .0524966    -1.54   0.141    -.1911962    .0293864
           1982  |  -.0851482    .051745    -1.65   0.117    -.1938604    .0235641
           1983  |  -.0845724   .0550663    -1.54   0.142    -.2002625    .0311177
           1984  |  -.0768996   .0537365    -1.43   0.170    -.1897959    .0359967
           1985  |  -.0834958   .0565232    -1.48   0.157    -.2022467    .0352552
           1986  |  -.0831444   .0556778    -1.49   0.153    -.2001192    .0338303
           1987  |   -.079715    .056245    -1.42   0.173    -.1978813    .0384514
           1988  |  -.0866448    .057686    -1.50   0.150    -.2078386     .034549
           1989  |  -.0966992   .0584809    -1.65   0.116     -.219563    .0261647
           1990  |  -.0990945    .057399    -1.73   0.101    -.2196853    .0214963
           1991  |  -.0921487   .0619444    -1.49   0.154    -.2222889    .0379916
           1992  |  -.1036293    .061827    -1.68   0.111    -.2335229    .0262643
           1993  |  -.0546775    .068032    -0.80   0.432    -.1976074    .0882524
           1994  |  -.1812982   .0641909    -2.82   0.011    -.3161584   -.0464381
           1995  |  -.1727253   .0646596    -2.67   0.016      -.30857   -.0368805
                 |
           _cons |  -.0741927   .0818429    -0.91   0.377    -.2461382    .0977528
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout
(sum of wgt is   2.9704e+11)

Linear regression                                      Number of obs =  295337
                                                       F( 18,    18) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0324
                                                       Root MSE      =  .39746

                                      (Std. Err. adjusted for 19 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       fertility |   .0066286   .0034699     1.91   0.072    -.0006613    .0139185
       education |   .0041024   .0013666     3.00   0.008     .0012312    .0069735
          educsq |  -.0002206   .0001539    -1.43   0.169    -.0005438    .0001027
            poor |  -.0162476   .0055622    -2.92   0.009    -.0279334   -.0045618
           rural |  -.0140506   .0049922    -2.81   0.011    -.0245388   -.0035624
          height |  -.1030958   .0289936    -3.56   0.002    -.1640091   -.0421825
   agefirstbirth |  -.0006765   .0022436    -0.30   0.766      -.00539     .004037
very_underweight |  -.0111037   .0075555    -1.47   0.159    -.0269772    .0047699
     underweight |  -.0046362   .0030633    -1.51   0.148    -.0110719    .0017995
      overweight |   .0108083     .00665     1.63   0.121    -.0031628    .0247794
   moderateobese |   .0197983   .0094323     2.10   0.050    -.0000183    .0396148
     severeobese |   .0372172   .0100183     3.71   0.002     .0161695     .058265
             age |   .0276317   .0029346     9.42   0.000     .0214664     .033797
           agesq |  -.0003848   .0000482    -7.98   0.000    -.0004862   -.0002835
                 |
           _cou1 |
              6  |    .033092   .0100759     3.28   0.004     .0119234    .0542607
             12  |    .089724    .016813     5.34   0.000     .0544012    .1250468
             16  |   .1652109   .0106993    15.44   0.000     .1427325    .1876893
             19  |   .0315238   .0129872     2.43   0.026     .0042387    .0588089
             22  |   .0183604   .0130408     1.41   0.176    -.0090373    .0457582
             23  |  -.0573655   .0280229    -2.05   0.056    -.1162395    .0015084
             25  |   .1209409    .003605    33.55   0.000     .1133671    .1285147
             27  |   -.003609   .0109437    -0.33   0.745     -.026601    .0193829
             28  |   .0058581   .0103959     0.56   0.580    -.0159828    .0276991
             34  |  -.0884739   .0085841   -10.31   0.000    -.1065085   -.0704393
             41  |   .0169434   .0191362     0.89   0.388    -.0232603    .0571472
             45  |  -.0192906    .017691    -1.09   0.290    -.0564579    .0178767
             47  |  -.0240982   .0120644    -2.00   0.061    -.0494445    .0012482
             53  |     -.0156    .009862    -1.58   0.131    -.0363193    .0051193
             54  |   .0761891   .0108901     7.00   0.000     .0533098    .0990684
             58  |  -.0763603   .0074335   -10.27   0.000    -.0919776   -.0607431
             64  |   .0758527   .0223953     3.39   0.003     .0288019    .1229034
             67  |    -.00058   .0145686    -0.04   0.969    -.0311875    .0300275
                 |
      year_birth |
           1943  |  -.0142135   .0142431    -1.00   0.332    -.0441372    .0157101
           1944  |   .2322086    .077492     3.00   0.008     .0694039    .3950134
           1945  |   .0001891   .0075713     0.02   0.980    -.0157175    .0160958
           1946  |   .1036798   .1249759     0.83   0.418    -.1588849    .3662444
           1947  |   .1768352   .0249213     7.10   0.000     .1244776    .2291929
           1948  |   .1187786   .0498894     2.38   0.029     .0139649    .2235923
           1949  |   .1471372   .0207918     7.08   0.000     .1034552    .1908191
           1950  |    .090973   .0227273     4.00   0.001     .0432247    .1387213
           1951  |   .1111325   .0250719     4.43   0.000     .0584584    .1638067
           1952  |   .0893202    .020557     4.35   0.000     .0461316    .1325088
           1953  |   .1093048   .0170268     6.42   0.000     .0735328    .1450768
           1954  |   .0952053   .0252716     3.77   0.001     .0421118    .1482989
           1955  |   .0742506   .0181073     4.10   0.001     .0362085    .1122926
           1956  |   .0636375    .022521     2.83   0.011     .0163227    .1109523
           1957  |   .0398887   .0205377     1.94   0.068    -.0032595    .0830368
           1958  |   .0370763   .0209244     1.77   0.093    -.0068843    .0810369
           1959  |   .0297461   .0189736     1.57   0.134    -.0101159    .0696081
           1960  |   .0059899   .0220978     0.27   0.789    -.0404359    .0524157
           1961  |   .0018533    .024318     0.08   0.940     -.049237    .0529435
           1962  |   .0077825   .0252655     0.31   0.762    -.0452984    .0608635
           1963  |  -.0109482   .0257952    -0.42   0.676     -.065142    .0432455
           1964  |  -.0077069   .0254725    -0.30   0.766    -.0612226    .0458089
           1965  |  -.0346273   .0277087    -1.25   0.227     -.092841    .0235865
           1966  |  -.0044183   .0280885    -0.16   0.877    -.0634301    .0545935
           1967  |  -.0154404   .0295946    -0.52   0.608    -.0776163    .0467354
           1968  |  -.0250572   .0305599    -0.82   0.423    -.0892612    .0391468
           1969  |  -.0173663   .0305414    -0.57   0.577    -.0815315    .0467989
           1970  |  -.0344873   .0347586    -0.99   0.334    -.1075124    .0385378
           1971  |  -.0283356   .0341269    -0.83   0.417    -.1000335    .0433623
           1972  |  -.0195755   .0374267    -0.52   0.607    -.0982061    .0590551
           1973  |   -.033493   .0369282    -0.91   0.376    -.1110763    .0440904
           1974  |  -.0315341    .039869    -0.79   0.439    -.1152958    .0522276
           1975  |  -.0386351   .0396609    -0.97   0.343    -.1219596    .0446894
           1976  |  -.0359465    .039645    -0.91   0.377    -.1192375    .0473445
           1977  |  -.0348076    .041367    -0.84   0.411    -.1217164    .0521013
           1978  |  -.0436936   .0437815    -1.00   0.332    -.1356751    .0482879
           1979  |  -.0371131   .0441596    -0.84   0.412    -.1298889    .0556627
           1980  |  -.0335121   .0458699    -0.73   0.474    -.1298813     .062857
           1981  |  -.0359937   .0485943    -0.74   0.468    -.1380866    .0660992
           1982  |  -.0399216   .0471925    -0.85   0.409    -.1390694    .0592263
           1983  |  -.0389037   .0492221    -0.79   0.440    -.1423154     .064508
           1984  |  -.0317733   .0499105    -0.64   0.532    -.1366314    .0730847
           1985  |  -.0384523   .0510902    -0.75   0.461    -.1457888    .0688841
           1986  |  -.0376283   .0521971    -0.72   0.480    -.1472904    .0720338
           1987  |  -.0344176   .0523988    -0.66   0.520    -.1445034    .0756681
           1988  |  -.0396746   .0518982    -0.76   0.454    -.1487087    .0693596
           1989  |  -.0505278   .0543665    -0.93   0.365    -.1647477     .063692
           1990  |  -.0514146   .0501421    -1.03   0.319    -.1567593    .0539301
           1991  |  -.0445843   .0532956    -0.84   0.414    -.1565542    .0673856
           1992  |  -.0560211   .0542406    -1.03   0.315    -.1699764    .0579342
           1993  |  -.0065815   .0597543    -0.11   0.914    -.1321206    .1189576
           1994  |  -.1329518   .0588321    -2.26   0.036    -.2565534   -.0093502
           1995  |  -.1256928   .0593255    -2.12   0.048     -.250331   -.0010545
                 |
           _cons |  -.0954568   .0767721    -1.24   0.230     -.256749    .0658354
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout
(sum of wgt is   1.3836e+11)

Linear regression                                      Number of obs =  142651
                                                       F( 10,    10) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0928
                                                       Root MSE      =  .42464

                                      (Std. Err. adjusted for 11 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       education |   .0037148   .0029592     1.26   0.238    -.0028786    .0103083
          educsq |  -.0002233   .0001507    -1.48   0.169    -.0005591    .0001124
            poor |   .0143298   .0105585     1.36   0.205    -.0091959    .0378556
           rural |  -.0374698   .0092524    -4.05   0.002    -.0580855    -.016854
          height |   .1051145   .0835985     1.26   0.237    -.0811546    .2913837
   agefirstbirth |  -.0060793   .0013389    -4.54   0.001    -.0090626   -.0030961
very_underweight |   .0310728   .0216366     1.44   0.182    -.0171366    .0792821
     underweight |   .0062354   .0121535     0.51   0.619    -.0208443     .033315
      overweight |   .0192159   .0031711     6.06   0.000     .0121502    .0262816
   moderateobese |    .035148   .0107174     3.28   0.008     .0112682    .0590278
     severeobese |   .0443149   .0069668     6.36   0.000      .028792    .0598378
             age |   .0404093   .0044053     9.17   0.000     .0305937    .0502248
           agesq |  -.0005026   .0000658    -7.64   0.000    -.0006492   -.0003561
                 |
           _cou1 |
              7  |  -.3925345   .0115623   -33.95   0.000    -.4182969   -.3667721
             14  |   -.397178   .0019196  -206.91   0.000    -.4014551   -.3929009
             18  |  -.3567381   .0157399   -22.66   0.000    -.3918087   -.3216674
             21  |  -.2639622   .0052516   -50.26   0.000    -.2756636   -.2522608
             30  |  -.2922305   .0046868   -62.35   0.000    -.3026735   -.2817876
             31  |  -.0310312   .0169455    -1.83   0.097    -.0687882    .0067258
             38  |  -.3998389   .0065553   -60.99   0.000    -.4144451   -.3852327
             43  |  -.5359914   .0057292   -93.55   0.000    -.5487568   -.5232261
             50  |  -.4452255   .0166659   -26.71   0.000    -.4823595   -.4080915
             61  |  -.2687729   .0078555   -34.21   0.000    -.2862759   -.2512698
                 |
      year_birth |
           1942  |  -.6108573   .0348605   -17.52   0.000    -.6885314   -.5331832
           1943  |  -.5468873   .0652442    -8.38   0.000    -.6922605    -.401514
           1944  |  -.6441201   .0391299   -16.46   0.000    -.7313069   -.5569333
           1945  |  -.6580285   .0404924   -16.25   0.000    -.7482511   -.5678059
           1946  |  -.7121515   .0176284   -40.40   0.000      -.75143    -.672873
           1947  |  -.6768939   .0298243   -22.70   0.000    -.7433466   -.6104411
           1948  |  -.6804846   .0174507   -38.99   0.000    -.7193671   -.6416021
           1949  |  -.6808407   .0181922   -37.42   0.000    -.7213754    -.640306
           1950  |  -.6883045   .0177292   -38.82   0.000    -.7278077   -.6488014
           1951  |  -.6951121   .0308776   -22.51   0.000    -.7639116   -.6263127
           1952  |   -.701168   .0196746   -35.64   0.000    -.7450058   -.6573301
           1953  |  -.7512686   .0276287   -27.19   0.000    -.8128291    -.689708
           1954  |  -.7208292   .0244005   -29.54   0.000    -.7751969   -.6664616
           1955  |  -.7278824   .0216585   -33.61   0.000    -.7761405   -.6796244
           1956  |  -.7444883   .0167472   -44.45   0.000    -.7818034   -.7071732
           1957  |  -.7340108   .0217806   -33.70   0.000    -.7825411   -.6854805
           1958  |  -.7654985   .0204657   -37.40   0.000    -.8110989   -.7198982
           1959  |  -.7621869   .0186215   -40.93   0.000    -.8036781   -.7206956
           1960  |   -.762796   .0192089   -39.71   0.000     -.805596    -.719996
           1961  |  -.7740559   .0181528   -42.64   0.000    -.8145029   -.7336088
           1962  |  -.7787444   .0192471   -40.46   0.000    -.8216297   -.7358591
           1963  |  -.7839708   .0225231   -34.81   0.000    -.8341555   -.7337861
           1964  |  -.7936133   .0235624   -33.68   0.000    -.8461136   -.7411131
           1965  |  -.7908324   .0251357   -31.46   0.000    -.8468383   -.7348266
           1966  |  -.8088247   .0287114   -28.17   0.000    -.8727978   -.7448517
           1967  |  -.7958236   .0269658   -29.51   0.000    -.8559071   -.7357401
           1968  |  -.7846099   .0325179   -24.13   0.000    -.8570642   -.7121555
           1969  |  -.8023927   .0329079   -24.38   0.000    -.8757161   -.7290694
           1970  |  -.7974678   .0287199   -27.77   0.000    -.8614598   -.7334758
           1971  |  -.8026414   .0341956   -23.47   0.000     -.878834   -.7264487
           1972  |   -.797554   .0365438   -21.82   0.000    -.8789788   -.7161293
           1973  |  -.8105271   .0393593   -20.59   0.000     -.898225   -.7228292
           1974  |  -.7967001    .039362   -20.24   0.000     -.884404   -.7089962
           1975  |   -.824069   .0441377   -18.67   0.000    -.9224139   -.7257241
           1976  |  -.8142916   .0421563   -19.32   0.000    -.9082218   -.7203614
           1977  |  -.8054873   .0377958   -21.31   0.000    -.8897015    -.721273
           1978  |  -.8185739   .0501946   -16.31   0.000    -.9304143   -.7067334
           1979  |  -.8003329   .0459364   -17.42   0.000    -.9026855   -.6979804
           1980  |  -.8075844   .0387992   -20.81   0.000    -.8940343   -.7211345
           1981  |  -.7994367   .0523732   -15.26   0.000    -.9161315   -.6827418
           1982  |  -.8272225   .0568799   -14.54   0.000    -.9539589   -.7004862
           1983  |  -.7989773   .0581768   -13.73   0.000    -.9286032   -.6693515
           1984  |   -.786619   .0532643   -14.77   0.000    -.9052992   -.6679388
           1985  |  -.8045821   .0622523   -12.92   0.000    -.9432889   -.6658753
           1986  |  -.7654949   .0479533   -15.96   0.000    -.8723416   -.6586482
           1987  |  -.7946238   .0470158   -16.90   0.000    -.8993816   -.6898661
           1988  |  -.7743273   .0496325   -15.60   0.000    -.8849154   -.6637392
           1989  |  -.7688154   .0453746   -16.94   0.000    -.8699164   -.6677145
           1990  |  -.7906084   .0442578   -17.86   0.000    -.8892211   -.6919958
           1991  |  -.7965988   .0426737   -18.67   0.000    -.8916817   -.7015159
           1992  |   -.792419   .0445305   -17.79   0.000    -.8916391   -.6931989
           1993  |  -.8005434   .0455092   -17.59   0.000    -.9019443   -.6991425
           1994  |   -.792138   .0459498   -17.24   0.000    -.8945205   -.6897555
           1995  |  -.7813461   .0462734   -16.89   0.000    -.8844495   -.6782426
           1996  |  -.7907617   .0479623   -16.49   0.000    -.8976283    -.683895
                 |
           _cons |   .6677413   .1747965     3.82   0.003     .2782705    1.057212
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout
(sum of wgt is   1.3836e+11)

Linear regression                                      Number of obs =  142651
                                                       F( 10,    10) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0931
                                                       Root MSE      =  .42457

                                      (Std. Err. adjusted for 11 clusters in _cou)
----------------------------------------------------------------------------------
                 |               Robust
 terminated_preg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       fertility |   .0060017    .004879     1.23   0.247    -.0048694    .0168728
       education |   .0049025   .0023978     2.04   0.068    -.0004402    .0102453
          educsq |  -.0002665   .0001289    -2.07   0.066    -.0005538    .0000208
            poor |   .0130088   .0112479     1.16   0.274    -.0120531    .0380708
           rural |  -.0398216    .008495    -4.69   0.001    -.0587496   -.0208935
          height |   .1061227   .0830059     1.28   0.230     -.078826    .2910714
   agefirstbirth |  -.0049051   .0020625    -2.38   0.039    -.0095006   -.0003095
very_underweight |   .0311628    .021647     1.44   0.181    -.0170698    .0793954
     underweight |    .005794   .0124505     0.47   0.652    -.0219475    .0335355
      overweight |   .0197582   .0029231     6.76   0.000     .0132452    .0262711
   moderateobese |   .0355805   .0105981     3.36   0.007     .0119664    .0591947
     severeobese |   .0442798   .0068959     6.42   0.000     .0289148    .0596448
             age |   .0374541   .0051869     7.22   0.000     .0258969    .0490113
           agesq |  -.0004657    .000077    -6.05   0.000    -.0006373   -.0002941
                 |
           _cou1 |
              7  |  -.3927417    .011927   -32.93   0.000    -.4193167   -.3661668
             14  |  -.3959927   .0021854  -181.20   0.000     -.400862   -.3911234
             18  |  -.3549815   .0164906   -21.53   0.000    -.3917249    -.318238
             21  |  -.2698608   .0068274   -39.53   0.000    -.2850732   -.2546484
             30  |  -.3028199   .0067743   -44.70   0.000     -.317914   -.2877257
             31  |  -.0253431   .0196557    -1.29   0.226    -.0691388    .0184525
             38  |  -.4000032   .0070494   -56.74   0.000    -.4157103    -.384296
             43  |  -.5369582   .0065369   -82.14   0.000    -.5515233   -.5223932
             50  |  -.4456601   .0164756   -27.05   0.000    -.4823701   -.4089501
             61  |  -.2696025   .0082177   -32.81   0.000    -.2879127   -.2512922
                 |
      year_birth |
           1942  |  -.6216037   .0387833   -16.03   0.000    -.7080184    -.535189
           1943  |  -.5497486    .070464    -7.80   0.000    -.7067521   -.3927451
           1944  |  -.6462179   .0376206   -17.18   0.000    -.7300417    -.562394
           1945  |  -.6539982   .0446261   -14.66   0.000    -.7534314   -.5545649
           1946  |  -.6999661   .0232579   -30.10   0.000    -.7517881   -.6481442
           1947  |  -.6625312   .0298188   -22.22   0.000    -.7289718   -.5960907
           1948  |  -.6651305   .0274271   -24.25   0.000    -.7262418   -.6040192
           1949  |  -.6657651   .0276811   -24.05   0.000    -.7274424   -.6040877
           1950  |  -.6715052   .0291041   -23.07   0.000    -.7363531   -.6066573
           1951  |  -.6769977   .0430916   -15.71   0.000    -.7730116   -.5809837
           1952  |  -.6823726   .0322562   -21.15   0.000    -.7542439   -.6105012
           1953  |  -.7320033   .0399108   -18.34   0.000    -.8209301   -.6430765
           1954  |  -.7000693   .0384111   -18.23   0.000    -.7856546   -.6144839
           1955  |  -.7061042   .0369417   -19.11   0.000    -.7884154    -.623793
           1956  |  -.7208606    .034243   -21.05   0.000    -.7971588   -.6445625
           1957  |  -.7095549   .0398525   -17.80   0.000    -.7983518   -.6207581
           1958  |  -.7405822   .0360084   -20.57   0.000    -.8208139   -.6603506
           1959  |  -.7364562   .0355072   -20.74   0.000    -.8155712   -.6573412
           1960  |  -.7368196   .0379554   -19.41   0.000    -.8213894   -.6522498
           1961  |  -.7472687   .0354603   -21.07   0.000    -.8262791   -.6682583
           1962  |  -.7510113   .0372791   -20.15   0.000    -.8340744   -.6679483
           1963  |   -.755791   .0434233   -17.41   0.000    -.8525442   -.6590377
           1964  |  -.7643752   .0457145   -16.72   0.000    -.8662336   -.6625169
           1965  |  -.7612356   .0465981   -16.34   0.000    -.8650627   -.6574085
           1966  |  -.7784995   .0508233   -15.32   0.000    -.8917408   -.6652581
           1967  |  -.7649361   .0475538   -16.09   0.000    -.8708924   -.6589797
           1968  |  -.7531756   .0561735   -13.41   0.000     -.878338   -.6280133
           1969  |  -.7704687   .0569855   -13.52   0.000    -.8974403   -.6434972
           1970  |  -.7650988   .0528385   -14.48   0.000    -.8828304   -.6473673
           1971  |  -.7695993   .0583555   -13.19   0.000    -.8996234   -.6395751
           1972  |   -.764376   .0614734   -12.43   0.000    -.9013473   -.6274046
           1973  |  -.7774306   .0635949   -12.22   0.000    -.9191289   -.6357323
           1974  |  -.7630742   .0641176   -11.90   0.000     -.905937   -.6202113
           1975  |  -.7902407   .0673033   -11.74   0.000    -.9402017   -.6402797
           1976  |  -.7803812   .0661418   -11.80   0.000    -.9277542   -.6330082
           1977  |  -.7711626    .060645   -12.72   0.000     -.906288   -.6360372
           1978  |  -.7842136   .0740597   -10.59   0.000    -.9492288   -.6191984
           1979  |  -.7660358   .0701056   -10.93   0.000    -.9222408   -.6098308
           1980  |  -.7731821   .0639465   -12.09   0.000    -.9156637   -.6307004
           1981  |  -.7653023   .0762246   -10.04   0.000    -.9351412   -.5954634
           1982  |   -.792948   .0797964    -9.94   0.000    -.9707454   -.6151505
           1983  |  -.7650312    .082522    -9.27   0.000    -.9489016   -.5811607
           1984  |  -.7528714   .0771413    -9.76   0.000    -.9247529   -.5809899
           1985  |  -.7710982   .0852232    -9.05   0.000    -.9609873   -.5812091
           1986  |   -.731893   .0720393   -10.16   0.000    -.8924065   -.5713794
           1987  |   -.761687   .0712599   -10.69   0.000    -.9204638   -.6029101
           1988  |   -.741589   .0736173   -10.07   0.000    -.9056187   -.5775593
           1989  |  -.7364294   .0690815   -10.66   0.000    -.8903525   -.5825063
           1990  |  -.7586802    .068039   -11.15   0.000    -.9102805   -.6070798
           1991  |  -.7653347   .0662033   -11.56   0.000     -.912845   -.6178245
           1992  |  -.7606684   .0687703   -11.06   0.000    -.9138983   -.6074386
           1993  |  -.7696866   .0690484   -11.15   0.000     -.923536   -.6158372
           1994  |  -.7612755   .0695054   -10.95   0.000    -.9161431   -.6064079
           1995  |  -.7512428   .0691934   -10.86   0.000    -.9054153   -.5970704
           1996  |  -.7597347   .0713117   -10.65   0.000     -.918627   -.6008424
                 |
           _cons |   .6457516   .1874581     3.44   0.006     .2280689    1.063434
----------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/AbortPredict/terminated_preg.xls
dir : seeout

. 
end of do-file

. ls

total 148
-rw------- 1 damiancclarke damiancclarke 10903 oct  4 13:52 countrynaming.do
-rw-rw-r-- 1 damiancclarke damiancclarke  6202 oct 26 05:42 DHS_Twins.do
-rw-rw-r-- 1 damiancclarke damiancclarke  6177 oct 22 19:21 DHS_Twins.do~
-rw-rw-r-- 1 damiancclarke damiancclarke 12742 oct 25 13:59 DHS_Twins_regressions
-rw-rw-r-- 1 damiancclarke damiancclarke 13008 nov  3 08:24 DHS_Twins_regressions.do
-rw-rw-r-- 1 damiancclarke damiancclarke 12747 oct 27 04:08 DHS_Twins_regressions.do~
-rw-rw-r-- 1 damiancclarke damiancclarke  3063 nov  3 14:55 TerminatedPreg.do
-rw-rw-r-- 1 damiancclarke damiancclarke  3056 nov  3 14:27 TerminatedPreg.do~
-rw-rw-r-- 1 damiancclarke damiancclarke  2091 nov  3 15:43 TerminatedPreg_regressions.do
-rw-rw-r-- 1 damiancclarke damiancclarke  2137 nov  3 15:43 TerminatedPreg_regressions.do~
-rw-rw-r-- 1 damiancclarke damiancclarke  3353 nov  3 15:44 TerminatedPreg_setup.do
-rw-rw-r-- 1 damiancclarke damiancclarke  3342 nov  3 15:44 TerminatedPreg_setup.do~
-rw------- 1 damiancclarke damiancclarke 12427 nov  3 15:58 TwinRegressions.do
-rw------- 1 damiancclarke damiancclarke 12319 oct  3 11:30 TwinRegressions.do~
-rw-rw-r-- 1 damiancclarke damiancclarke  1097 sep 12 14:47 TwinSetup2.do
-rw------- 1 damiancclarke damiancclarke 10846 oct  4 14:17 TwinSetup.do

. h return
--Break--
r(1);

. h exit
--Break--
r(1);

. h break

. h end

. do DHS_Twins_regressions

. /* TWIN_RESULTS 1.00                 UTF-8                         dh:2012-04-09
> *---|----1----|----2----|----3----|----4----|----5----|----6----|----7----|----8
> */
. 
. clear all

. version 11.2

. cap log close
