-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/TwinRegressions.log
  log type:  text
 opened on:   2 Sep 2012, 20:00:13

. 
. *TWIN PREDICT CONTROLS
. global twinpredict bord agemay educf_* height bmi aiquin i.yearc country2- country46

. global twinpredict_i i.bord agemay educf_* height bmi aiquin i.yearc country2- country46

. 
. global sumstats bord fert agemay educfyrs eduyears attendance poor1 height bmi

. 
. *Q-Q CONTROLS
. global basic malec agemay age17-age38 yearc1-yearc88 country1-country46 /*
> */ borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. global socioeconomic educf_* poor1 malec agemay age17-age38 yearc1-yearc88/*
> */ country1-country46 borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. global allcontrols educf_* poor1 height bmi malec agemay age17-age38 yearc1-yearc88/*
> */ country1-country46 borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. 
. *OUTREG Q-Q
. global basic_out fert malec agemay borddummy2 borddummy3 borddummy4 

. global socioeconomic_out fert malec agemay educf_* poor1 borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7 

. global all_out fert malec agemay educf_* bmi poor1 height borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. 
. 
. 
. use $Data/Twins/DHS_Base, clear

. 
. drop if height<80|height>240 //THIS IS 1728 OBSERVATIONS
(584347 observations deleted)

. rename educf_0 educf00

. 
end of do-file

. do "/tmp/SD01964.000000"

. replace terminated_preg=. if terminated_preg==8
(5 real changes made, 5 to missing)

. gen incstat=1 if income_status=="LOWINCOME"
(665476 missing values generated)

. replace incstat=2 if income_status=="LOWERMIDDLE"
(524479 real changes made)

. replace incstat=3 if income_status=="UPPERMIDDLE"
(140997 real changes made)

. *collapse fert agemay educf_* height bmi aiquin yearc country2- country46 anemia sweight terminated_preg incstat, by(caseid2)
. 
. *replace yearc=round(yearc)
. reg terminated_preg fert agemay educf_* height bmi aiquin i.yearc country2- country46 [pw=sweight]
(sum of wgt is   9.2758e+05)
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  940190
                                                       F(114,940074) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0519
                                                       Root MSE      =  .41166

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0041111   .0002815    14.60   0.000     .0035593    .0046629
      agemay |   .0067743   .0001075    62.99   0.000     .0065635    .0069851
   educf_1_4 |   .0178465   .0015614    11.43   0.000     .0147863    .0209068
   educf_5_6 |   .0138402   .0017333     7.98   0.000     .0104429    .0172374
  educf_7_10 |   .0177447   .0017727    10.01   0.000     .0142701    .0212192
educf_11plus |   .0085121   .0021888     3.89   0.000     .0042221    .0128022
      height |  -.0002324   .0000846    -2.75   0.006    -.0003982   -.0000665
         bmi |   .0021504   .0001286    16.72   0.000     .0018984    .0024024
      aiquin |   .0040764   .0004168     9.78   0.000     .0032595    .0048933
             |
       yearc |
       1928  |   .7480288   .1901602     3.93   0.000     .3753211    1.120736
       1929  |   .0273954   .0050475     5.43   0.000     .0175025    .0372882
       1930  |   .6518291   .2245416     2.90   0.004      .211735    1.091923
       1931  |   .3693687   .1971074     1.87   0.061    -.0169551    .7556926
       1932  |   .2303157   .1108149     2.08   0.038     .0131221    .4475093
       1933  |   .2757201   .1268968     2.17   0.030     .0270065    .5244337
       1934  |   .2225285   .0749005     2.97   0.003     .0757261    .3693309
       1935  |   .2927988   .0745978     3.93   0.000     .1465896     .439008
       1936  |   .2869835   .0657801     4.36   0.000     .1580568    .4159103
       1937  |   .2556511   .0496841     5.15   0.000     .1582718    .3530303
       1938  |   .2203535   .0421827     5.22   0.000     .1376769    .3030301
       1939  |   .2540512   .0451312     5.63   0.000     .1655956    .3425068
       1940  |   .2069294   .0308689     6.70   0.000     .1464274    .2674315
       1941  |   .1903411   .0318685     5.97   0.000     .1278798    .2528023
       1942  |   .2046262   .0284137     7.20   0.000     .1489362    .2603161
       1943  |    .196605   .0258152     7.62   0.000      .146008     .247202
       1944  |   .2125321   .0247377     8.59   0.000     .1640471    .2610171
       1945  |   .2015328   .0220142     9.15   0.000     .1583857      .24468
       1946  |   .1548871   .0187299     8.27   0.000      .118177    .1915971
       1947  |   .2116686   .0190171    11.13   0.000     .1743958    .2489414
       1948  |   .1755907   .0161696    10.86   0.000     .1438988    .2072827
       1949  |   .1719718   .0168625    10.20   0.000     .1389219    .2050217
       1950  |   .1526884   .0126126    12.11   0.000     .1279681    .1774088
       1951  |   .1625171   .0118935    13.66   0.000     .1392062    .1858281
       1952  |   .1442231   .0116377    12.39   0.000     .1214136    .1670327
       1953  |   .2514797   .0908175     2.77   0.006     .0734805    .4294789
       1962  |   .4056661   .2807723     1.44   0.149    -.1446382    .9559704
       1963  |   .3628307   .1275911     2.84   0.004     .1127563    .6129051
       1964  |   .2979127   .1017536     2.93   0.003     .0984791    .4973463
       1965  |   .4023732    .068835     5.85   0.000     .2674589    .5372874
       1966  |   .4114313   .0493624     8.33   0.000     .3146827    .5081799
       1967  |   .3537213   .0410003     8.63   0.000     .2733621    .4340806
       1968  |   .2612272     .02268    11.52   0.000     .2167752    .3056792
       1969  |   .3486591   .0250284    13.93   0.000     .2996043    .3977139
       1970  |   .2896259   .0180048    16.09   0.000     .2543371    .3249146
       1971  |   .3007184   .0159991    18.80   0.000     .2693607    .3320761
       1972  |   .3129838   .0143522    21.81   0.000     .2848541    .3411136
       1973  |   .3012601   .0107369    28.06   0.000     .2802161    .3223041
       1974  |   .2873802    .010739    26.76   0.000     .2663322    .3084282
       1975  |   .2934728   .0089072    32.95   0.000      .276015    .3109306
       1976  |   .2825131   .0078216    36.12   0.000     .2671829    .2978432
       1977  |   .2817092   .0075886    37.12   0.000     .2668357    .2965827
       1978  |    .280849   .0067698    41.49   0.000     .2675804    .2941177
       1979  |   .2834304   .0065068    43.56   0.000     .2706773    .2961834
       1980  |   .2688416   .0059395    45.26   0.000     .2572004    .2804829
       1981  |   .2785926   .0059087    47.15   0.000     .2670119    .2901734
       1982  |   .2644235   .0055806    47.38   0.000     .2534858    .2753612
       1983  |   .2618349   .0054353    48.17   0.000     .2511819     .272488
       1984  |   .2576946   .0053271    48.37   0.000     .2472537    .2681355
       1985  |    .257657   .0052263    49.30   0.000     .2474137    .2679004
       1986  |   .2485114   .0051433    48.32   0.000     .2384308    .2585921
       1987  |   .2430562   .0050949    47.71   0.000     .2330704    .2530421
       1988  |   .2382835   .0050229    47.44   0.000     .2284388    .2481282
       1989  |   .2374277   .0050609    46.91   0.000     .2275086    .2473468
       1990  |    .226211   .0049893    45.34   0.000     .2164321    .2359899
       1991  |   .2216708    .005029    44.08   0.000     .2118142    .2315275
       1992  |   .2123484   .0050056    42.42   0.000     .2025377    .2221591
       1993  |   .2059437   .0050169    41.05   0.000     .1961108    .2157765
       1994  |   .2005643   .0050167    39.98   0.000     .1907318    .2103969
       1995  |   .1962299   .0050413    38.92   0.000      .186349    .2061107
       1996  |   .1876255   .0050713    37.00   0.000     .1776858    .1975651
       1997  |   .1806082   .0051189    35.28   0.000     .1705753     .190641
       1998  |   .1721615   .0051445    33.47   0.000     .1620785    .1822445
       1999  |   .1675246   .0052481    31.92   0.000     .1572384    .1778107
       2000  |   .1575912    .005305    29.71   0.000     .1471935    .1679889
       2001  |   .1611183   .0055868    28.84   0.000     .1501683    .1720684
       2002  |   .1502484   .0057267    26.24   0.000     .1390242    .1614725
       2003  |   .1433684   .0057386    24.98   0.000     .1321208    .1546159
       2004  |   .1376942    .006266    21.97   0.000     .1254131    .1499753
       2005  |   .1179699   .0082685    14.27   0.000     .1017639    .1341759
       2006  |   .1069187   .0239478     4.46   0.000     .0599818    .1538555
             |
    country2 |  -.4926567   .0055225   -89.21   0.000    -.5034806   -.4818328
    country3 |  -.5006729   .0066613   -75.16   0.000    -.5137289   -.4876169
    country4 |  -.5572305    .005756   -96.81   0.000     -.568512   -.5459489
    country5 |  -.5728673   .0055194  -103.79   0.000    -.5836851   -.5620494
    country6 |  -.5826745   .0064398   -90.48   0.000    -.5952962   -.5700529
    country7 |  -.4759959   .0066554   -71.52   0.000    -.4890403   -.4629515
    country8 |   -.592591   .0067507   -87.78   0.000    -.6058221   -.5793599
    country9 |   -.523591   .0051807  -101.07   0.000    -.5337451    -.513437
   country10 |          0  (omitted)
   country11 |  -.4261954    .007911   -53.87   0.000    -.4417007   -.4106902
   country12 |          0  (omitted)
   country13 |  -.5379535   .0104934   -51.27   0.000    -.5585202   -.5173867
   country14 |  -.5265455   .0048908  -107.66   0.000    -.5361313   -.5169597
   country15 |  -.5859602   .0060768   -96.43   0.000    -.5978705   -.5740498
   country16 |  -.5834786   .0071684   -81.40   0.000    -.5975283   -.5694288
   country17 |  -.6036813   .0066852   -90.30   0.000     -.616784   -.5905786
   country18 |  -.5485938   .0055736   -98.43   0.000    -.5595179   -.5376696
   country19 |  -.5579697   .0049145  -113.54   0.000    -.5676018   -.5483375
   country20 |          0  (omitted)
   country21 |  -.1893047   .0091022   -20.80   0.000    -.2071447   -.1714648
   country22 |  -.6394584   .0054111  -118.17   0.000     -.650064   -.6288527
   country23 |  -.6678992   .0070346   -94.94   0.000    -.6816867   -.6541116
   country24 |  -.6390109    .005793  -110.31   0.000    -.6503651   -.6276567
   country25 |   -.628342    .005195  -120.95   0.000     -.638524   -.6181601
   country26 |  -.5439089   .0055724   -97.61   0.000    -.5548307   -.5329871
   country27 |   -.553957   .0053732  -103.10   0.000    -.5644883   -.5434258
   country28 |  -.5971917    .005881  -101.55   0.000    -.6087182   -.5856651
   country29 |          0  (omitted)
   country30 |  -.5595471   .0059585   -93.91   0.000    -.5712256   -.5478686
   country31 |  -.5787301   .0052172  -110.93   0.000    -.5889556   -.5685047
   country32 |          0  (omitted)
   country33 |  -.5922314   .0059401   -99.70   0.000    -.6038739   -.5805889
   country34 |          0  (omitted)
   country35 |  -.6027975   .0051187  -117.76   0.000      -.61283   -.5927649
   country36 |          0  (omitted)
   country37 |  -.5808108     .00546  -106.38   0.000    -.5915122   -.5701095
   country38 |  -.4448554   .0089484   -49.71   0.000     -.462394   -.4273168
   country39 |          0  (omitted)
   country40 |  -.5404619   .0061002   -88.60   0.000     -.552418   -.5285058
   country41 |          0  (omitted)
   country42 |  -.4158543     .00704   -59.07   0.000    -.4296524   -.4020562
   country43 |  -.5173519   .0065418   -79.08   0.000    -.5301737   -.5045301
   country44 |          0  (omitted)
   country45 |  -.5498481   .0061246   -89.78   0.000    -.5618521   -.5378441
   country46 |  -.6652029   .0057269  -116.15   0.000    -.6764275   -.6539783
       _cons |   .3506156   .0158492    22.12   0.000     .3195518    .3816795
------------------------------------------------------------------------------

. outreg2 fert agemay educf_* height bmi aiquin using $Base/Results/TwinPredict/pregterm_predict, excel replace 2aster
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout

. *reg twind100 $twinpredict_i [pw=sweight]
. *outreg2 agemay educf_* height bmi poor1 using $Base/Results/TwinPredict/twinpredict_table2, excel append 2aster
. *test educf_0=educf_1_4=educf_5_6=educf_7_10=height=bmi=poor1=0
. 
. gen income_status="LOWINCOME" if incstat==1
income_status already defined
r(110);

end of do-file

r(110);

. do "/tmp/SD01964.000000"

. foreach incstat in LOWINCOME LOWERMIDDLE UPPERMIDDLE{
  2.         reg terminated_preg fert agemay educf_* height bmi aiquin yearc country2- country46 [pw=sweight] if income_status=="`incstat'"
  3.         outreg2 fert agemay educf_* height bmi aiquin using $Base/Results/TwinPredict/pregterm_predict, excel append 2aster
  4.         *reg twind100 $twinpredict_i [pw=sweight] if income_status=="`incstat'"
.         *outreg2 agemay educf_* height bmi poor1 using $Base/Results/TwinPredict/twinpredict_table2, excel append 2aster
. }
(sum of wgt is   3.4717e+05)
note: country4 omitted because of collinearity
note: country7 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country11 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country14 omitted because of collinearity
note: country15 omitted because of collinearity
note: country16 omitted because of collinearity
note: country18 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country23 omitted because of collinearity
note: country27 omitted because of collinearity
note: country29 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country35 omitted because of collinearity
note: country36 omitted because of collinearity
note: country38 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity

Linear regression                                      Number of obs =  341863
                                                       F( 26,341836) =  293.95
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0278
                                                       Root MSE      =  .39299

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0042415    .000403    10.52   0.000     .0034516    .0050313
      agemay |   .0055782   .0001613    34.58   0.000     .0052621    .0058944
   educf_1_4 |   .0128895   .0023239     5.55   0.000     .0083347    .0174442
   educf_5_6 |   .0091062   .0028571     3.19   0.001     .0035063     .014706
  educf_7_10 |   .0069956   .0027795     2.52   0.012     .0015479    .0124434
educf_11plus |  -.0012554   .0049545    -0.25   0.800     -.010966    .0084552
      height |  -.0003418   .0001326    -2.58   0.010    -.0006017    -.000082
         bmi |   .0026265   .0002587    10.15   0.000     .0021194    .0031336
      aiquin |   .0023327   .0006318     3.69   0.000     .0010943    .0035711
       yearc |  -.0031293   .0001053   -29.71   0.000    -.0033357   -.0029228
    country2 |   .1032385   .0060678    17.01   0.000     .0913459    .1151312
    country3 |   .0933517   .0069412    13.45   0.000      .079747    .1069563
    country4 |          0  (omitted)
    country5 |   .0247137   .0058273     4.24   0.000     .0132924     .036135
    country6 |   .0250367   .0069535     3.60   0.000      .011408    .0386655
    country7 |          0  (omitted)
    country8 |  -.0115685   .0069317    -1.67   0.095    -.0251544    .0020174
    country9 |          0  (omitted)
   country10 |          0  (omitted)
   country11 |          0  (omitted)
   country12 |          0  (omitted)
   country13 |          0  (omitted)
   country14 |          0  (omitted)
   country15 |          0  (omitted)
   country16 |          0  (omitted)
   country17 |   .0017744   .0070466     0.25   0.801    -.0120367    .0155854
   country18 |          0  (omitted)
   country19 |          0  (omitted)
   country20 |          0  (omitted)
   country21 |          0  (omitted)
   country22 |  -.0390007   .0061126    -6.38   0.000    -.0509812   -.0270202
   country23 |          0  (omitted)
   country24 |  -.0429971   .0063216    -6.80   0.000    -.0553873   -.0306069
   country25 |  -.0353402   .0056837    -6.22   0.000    -.0464801   -.0242003
   country26 |   .0549887   .0058817     9.35   0.000     .0434607    .0665167
   country27 |          0  (omitted)
   country28 |  -.0087433   .0062428    -1.40   0.161     -.020979    .0034925
   country29 |          0  (omitted)
   country30 |  -.0176071   .0064193    -2.74   0.006    -.0301888   -.0050254
   country31 |          0  (omitted)
   country32 |          0  (omitted)
   country33 |          0  (omitted)
   country34 |          0  (omitted)
   country35 |          0  (omitted)
   country36 |          0  (omitted)
   country37 |   .0175926   .0059418     2.96   0.003     .0059468    .0292385
   country38 |          0  (omitted)
   country39 |          0  (omitted)
   country40 |    .049298   .0065844     7.49   0.000     .0363929    .0622032
   country41 |          0  (omitted)
   country42 |          0  (omitted)
   country43 |   .0804517   .0069713    11.54   0.000     .0667881    .0941153
   country44 |          0  (omitted)
   country45 |          0  (omitted)
   country46 |  -.0553652   .0064885    -8.53   0.000    -.0680824    -.042648
       _cons |   6.239882   .2117543    29.47   0.000      5.82485    6.654915
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout
(sum of wgt is   4.5064e+05)
note: country2 omitted because of collinearity
note: country3 omitted because of collinearity
note: country5 omitted because of collinearity
note: country6 omitted because of collinearity
note: country8 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country16 omitted because of collinearity
note: country17 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country22 omitted because of collinearity
note: country24 omitted because of collinearity
note: country25 omitted because of collinearity
note: country26 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country35 omitted because of collinearity
note: country36 omitted because of collinearity
note: country37 omitted because of collinearity
note: country39 omitted because of collinearity
note: country40 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country43 omitted because of collinearity
note: country44 omitted because of collinearity
note: country46 omitted because of collinearity

Linear regression                                      Number of obs =  461516
                                                       F( 23,461492) = 1146.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0555
                                                       Root MSE      =  .42199

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0094044   .0004028    23.35   0.000      .008615    .0101939
      agemay |   .0063888   .0001543    41.40   0.000     .0060863    .0066912
   educf_1_4 |   .0253875   .0023721    10.70   0.000     .0207383    .0300366
   educf_5_6 |   .0180279   .0024913     7.24   0.000     .0131451    .0229108
  educf_7_10 |   .0216005    .002526     8.55   0.000     .0166495    .0265514
educf_11plus |   .0057473   .0028178     2.04   0.041     .0002245      .01127
      height |  -.0006251   .0001201    -5.21   0.000    -.0008604   -.0003898
         bmi |   .0015581   .0001635     9.53   0.000     .0012376    .0018785
      aiquin |   .0065786   .0006124    10.74   0.000     .0053784    .0077788
       yearc |  -.0044128   .0001281   -34.44   0.000    -.0046639   -.0041616
    country2 |          0  (omitted)
    country3 |          0  (omitted)
    country4 |  -.5799716    .005927   -97.85   0.000    -.5915884   -.5683548
    country5 |          0  (omitted)
    country6 |          0  (omitted)
    country7 |  -.4994017   .0068134   -73.30   0.000    -.5127558   -.4860476
    country8 |          0  (omitted)
    country9 |          0  (omitted)
   country10 |          0  (omitted)
   country11 |  -.4520596   .0080193   -56.37   0.000    -.4677771   -.4363421
   country12 |          0  (omitted)
   country13 |          0  (omitted)
   country14 |  -.5370381    .005024  -106.89   0.000    -.5468851   -.5271912
   country15 |  -.6055288   .0062203   -97.35   0.000    -.6177204   -.5933372
   country16 |          0  (omitted)
   country17 |          0  (omitted)
   country18 |  -.5754407   .0057938   -99.32   0.000    -.5867964    -.564085
   country19 |  -.5719443     .00508  -112.59   0.000    -.5819009   -.5619876
   country20 |          0  (omitted)
   country21 |          0  (omitted)
   country22 |          0  (omitted)
   country23 |  -.6860142   .0071395   -96.09   0.000    -.7000074    -.672021
   country24 |          0  (omitted)
   country25 |          0  (omitted)
   country26 |          0  (omitted)
   country27 |   -.568122   .0055364  -102.62   0.000    -.5789732   -.5572708
   country28 |          0  (omitted)
   country29 |          0  (omitted)
   country30 |          0  (omitted)
   country31 |  -.5957479   .0053519  -111.31   0.000    -.6062375   -.5852584
   country32 |          0  (omitted)
   country33 |  -.6158144   .0061313  -100.44   0.000    -.6278316   -.6037972
   country34 |          0  (omitted)
   country35 |          0  (omitted)
   country36 |          0  (omitted)
   country37 |          0  (omitted)
   country38 |  -.4701777   .0091346   -51.47   0.000    -.4880812   -.4522741
   country39 |          0  (omitted)
   country40 |          0  (omitted)
   country41 |          0  (omitted)
   country42 |          0  (omitted)
   country43 |          0  (omitted)
   country44 |          0  (omitted)
   country45 |  -.5764373   .0062875   -91.68   0.000    -.5887607   -.5641139
   country46 |          0  (omitted)
       _cons |   9.420085   .2557968    36.83   0.000     8.918731    9.921438
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout
(sum of wgt is   1.2976e+05)
note: country2 omitted because of collinearity
note: country3 omitted because of collinearity
note: country4 omitted because of collinearity
note: country5 omitted because of collinearity
note: country6 omitted because of collinearity
note: country7 omitted because of collinearity
note: country8 omitted because of collinearity
note: country10 omitted because of collinearity
note: country11 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country14 omitted because of collinearity
note: country15 omitted because of collinearity
note: country16 omitted because of collinearity
note: country17 omitted because of collinearity
note: country18 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country22 omitted because of collinearity
note: country23 omitted because of collinearity
note: country24 omitted because of collinearity
note: country25 omitted because of collinearity
note: country26 omitted because of collinearity
note: country27 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country37 omitted because of collinearity
note: country38 omitted because of collinearity
note: country39 omitted because of collinearity
note: country40 omitted because of collinearity
note: country41 omitted because of collinearity
note: country43 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity
note: country46 omitted because of collinearity

Linear regression                                      Number of obs =  136811
                                                       F( 14,136796) =  446.09
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0612
                                                       Root MSE      =  .42512

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0061572   .0008396     7.33   0.000     .0045116    .0078028
      agemay |   .0065497   .0003016    21.72   0.000     .0059586    .0071408
   educf_1_4 |   .0366892   .0052572     6.98   0.000     .0263852    .0469933
   educf_5_6 |   .0407687   .0053021     7.69   0.000     .0303767    .0511607
  educf_7_10 |   .0549788   .0060544     9.08   0.000     .0431123    .0668453
educf_11plus |   .0513871   .0063752     8.06   0.000     .0388917    .0638824
      height |   .0019489   .0002632     7.40   0.000      .001433    .0024649
         bmi |   .0047078   .0003538    13.31   0.000     .0040143    .0054013
      aiquin |   .0075731   .0012747     5.94   0.000     .0050746    .0100716
       yearc |  -.0058631   .0002898   -20.23   0.000    -.0064311    -.005295
    country2 |          0  (omitted)
    country3 |          0  (omitted)
    country4 |          0  (omitted)
    country5 |          0  (omitted)
    country6 |          0  (omitted)
    country7 |          0  (omitted)
    country8 |          0  (omitted)
    country9 |   .0099312     .00992     1.00   0.317    -.0095118    .0293742
   country10 |          0  (omitted)
   country11 |          0  (omitted)
   country12 |          0  (omitted)
   country13 |          0  (omitted)
   country14 |          0  (omitted)
   country15 |          0  (omitted)
   country16 |          0  (omitted)
   country17 |          0  (omitted)
   country18 |          0  (omitted)
   country19 |          0  (omitted)
   country20 |          0  (omitted)
   country21 |   .3239062   .0124669    25.98   0.000     .2994712    .3483412
   country22 |          0  (omitted)
   country23 |          0  (omitted)
   country24 |          0  (omitted)
   country25 |          0  (omitted)
   country26 |          0  (omitted)
   country27 |          0  (omitted)
   country28 |          0  (omitted)
   country29 |          0  (omitted)
   country30 |          0  (omitted)
   country31 |          0  (omitted)
   country32 |          0  (omitted)
   country33 |          0  (omitted)
   country34 |          0  (omitted)
   country35 |  -.0599294   .0099384    -6.03   0.000    -.0794085   -.0404503
   country36 |          0  (omitted)
   country37 |          0  (omitted)
   country38 |          0  (omitted)
   country39 |          0  (omitted)
   country40 |          0  (omitted)
   country41 |          0  (omitted)
   country42 |   .1251555   .0110595    11.32   0.000      .103479     .146832
   country43 |          0  (omitted)
   country44 |          0  (omitted)
   country45 |          0  (omitted)
   country46 |          0  (omitted)
       _cons |   11.26206   .5791447    19.45   0.000     10.12695    12.39717
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout

. 
end of do-file

. tab bmi

  BMI ma, not |
 adjusted for |
    pregnancy |
       (v445) |      Freq.     Percent        Cum.
--------------+-----------------------------------
        12.01 |          1        0.00        0.00
        12.02 |          2        0.00        0.00
        12.03 |          3        0.00        0.00
        12.06 |          3        0.00        0.00
        12.08 |          5        0.00        0.00
         12.1 |          1        0.00        0.00
        12.14 |          5        0.00        0.00
        12.17 |          6        0.00        0.00
        12.19 |          6        0.00        0.00
        12.24 |          2        0.00        0.00
        12.25 |         11        0.00        0.00
        12.26 |          3        0.00        0.00
         12.3 |          4        0.00        0.00
        12.31 |          5        0.00        0.01
        12.33 |          4        0.00        0.01
        12.34 |          3        0.00        0.01
        12.35 |         11        0.00        0.01
        12.37 |          2        0.00        0.01
        12.38 |          5        0.00        0.01
        12.39 |          1        0.00        0.01
         12.4 |          7        0.00        0.01
        12.42 |          7        0.00        0.01
        12.44 |          3        0.00        0.01
        12.45 |         19        0.00        0.01
        12.48 |          1        0.00        0.01
        12.49 |          4        0.00        0.01
         12.5 |          8        0.00        0.01
        12.51 |          4        0.00        0.01
        12.52 |          2        0.00        0.01
        12.53 |          3        0.00        0.01
        12.54 |          2        0.00        0.01
        12.56 |          1        0.00        0.01
        12.57 |          1        0.00        0.01
        12.58 |          5        0.00        0.01
         12.6 |          9        0.00        0.01
        12.62 |          3        0.00        0.01
        12.63 |          3        0.00        0.01
        12.64 |          3        0.00        0.02
        12.65 |          3        0.00        0.02
        12.66 |          8        0.00        0.02
        12.67 |          2        0.00        0.02
        12.69 |          6        0.00        0.02
         12.7 |         13        0.00        0.02
        12.71 |          6        0.00        0.02
        12.72 |          1        0.00        0.02
        12.73 |          7        0.00        0.02
        12.74 |          2        0.00        0.02
        12.75 |          9        0.00        0.02
        12.76 |          3        0.00        0.02
        12.77 |          4        0.00        0.02
        12.78 |          3        0.00        0.02
        12.79 |         10        0.00        0.02
         12.8 |          9        0.00        0.02
        12.81 |          5        0.00        0.02
        12.82 |          5        0.00        0.02
        12.83 |         10        0.00        0.02
        12.84 |          1        0.00        0.02
        12.85 |         10        0.00        0.03
        12.86 |          5        0.00        0.03
        12.88 |          7        0.00        0.03
        12.89 |          6        0.00        0.03
        12.91 |          5        0.00        0.03
        12.92 |          6        0.00        0.03
        12.93 |          3        0.00        0.03
        12.94 |          6        0.00        0.03
        12.95 |         13        0.00        0.03
        12.96 |         12        0.00        0.03
        12.97 |          7        0.00        0.03
        12.98 |          3        0.00        0.03
        12.99 |         11        0.00        0.03
           13 |          6        0.00        0.03
        13.01 |          4        0.00        0.03
        13.02 |          9        0.00        0.03
        13.03 |          4        0.00        0.04
        13.05 |          6        0.00        0.04
        13.06 |         11        0.00        0.04
        13.07 |          6        0.00        0.04
        13.09 |          2        0.00        0.04
        13.11 |         12        0.00        0.04
        13.12 |          4        0.00        0.04
        13.13 |          7        0.00        0.04
        13.14 |          9        0.00        0.04
        13.15 |          8        0.00        0.04
        13.16 |          7        0.00        0.04
        13.17 |          1        0.00        0.04
        13.18 |          5        0.00        0.04
        13.19 |          5        0.00        0.04
         13.2 |         19        0.00        0.04
        13.21 |          6        0.00        0.04
        13.22 |          8        0.00        0.05
        13.23 |          6        0.00        0.05
        13.24 |          7        0.00        0.05
        13.25 |          8        0.00        0.05
        13.26 |          7        0.00        0.05
        13.27 |          5        0.00        0.05
        13.28 |          1        0.00        0.05
        13.29 |          3        0.00        0.05
         13.3 |          3        0.00        0.05
        13.31 |          6        0.00        0.05
        13.32 |          5        0.00        0.05
        13.33 |          2        0.00        0.05
        13.34 |          5        0.00        0.05
        13.35 |         12        0.00        0.05
        13.36 |          3        0.00        0.05
        13.37 |          7        0.00        0.05
        13.38 |         13        0.00        0.05
        13.39 |          8        0.00        0.05
         13.4 |          5        0.00        0.06
        13.41 |          9        0.00        0.06
        13.42 |         10        0.00        0.06
        13.43 |          2        0.00        0.06
        13.44 |          6        0.00        0.06
        13.45 |         17        0.00        0.06
        13.46 |          5        0.00        0.06
        13.47 |          1        0.00        0.06
        13.48 |          6        0.00        0.06
        13.49 |         15        0.00        0.06
         13.5 |          9        0.00        0.06
        13.51 |          8        0.00        0.06
        13.52 |         19        0.00        0.06
        13.53 |         12        0.00        0.07
        13.54 |         10        0.00        0.07
        13.55 |         19        0.00        0.07
        13.56 |          3        0.00        0.07
        13.57 |         14        0.00        0.07
        13.58 |         14        0.00        0.07
        13.59 |          3        0.00        0.07
         13.6 |         10        0.00        0.07
        13.61 |          9        0.00        0.07
        13.62 |         24        0.00        0.08
        13.63 |         16        0.00        0.08
        13.64 |         20        0.00        0.08
        13.65 |         16        0.00        0.08
        13.66 |          8        0.00        0.08
        13.67 |          9        0.00        0.08
        13.68 |          7        0.00        0.08
        13.69 |          8        0.00        0.08
         13.7 |         20        0.00        0.08
        13.71 |          6        0.00        0.09
        13.72 |         16        0.00        0.09
        13.73 |         14        0.00        0.09
        13.74 |         16        0.00        0.09
        13.75 |         17        0.00        0.09
        13.76 |         11        0.00        0.09
        13.77 |         10        0.00        0.09
        13.78 |         16        0.00        0.09
        13.79 |          7        0.00        0.10
         13.8 |         21        0.00        0.10
        13.81 |         11        0.00        0.10
        13.82 |          2        0.00        0.10
        13.83 |         24        0.00        0.10
        13.84 |         13        0.00        0.10
        13.85 |         14        0.00        0.10
        13.86 |         11        0.00        0.10
        13.87 |         10        0.00        0.10
        13.88 |         11        0.00        0.11
        13.89 |         27        0.00        0.11
         13.9 |         12        0.00        0.11
        13.91 |         23        0.00        0.11
        13.92 |         22        0.00        0.11
        13.93 |         15        0.00        0.11
        13.94 |         21        0.00        0.12
        13.95 |          6        0.00        0.12
        13.96 |         18        0.00        0.12
        13.97 |         12        0.00        0.12
        13.98 |         17        0.00        0.12
        13.99 |         15        0.00        0.12
           14 |         22        0.00        0.12
        14.01 |         15        0.00        0.13
        14.02 |         22        0.00        0.13
        14.03 |         14        0.00        0.13
        14.04 |         32        0.00        0.13
        14.05 |         19        0.00        0.13
        14.06 |         18        0.00        0.14
        14.07 |         29        0.00        0.14
        14.08 |         12        0.00        0.14
        14.09 |         19        0.00        0.14
         14.1 |         13        0.00        0.14
        14.11 |         22        0.00        0.14
        14.12 |         37        0.00        0.15
        14.13 |         29        0.00        0.15
        14.14 |         12        0.00        0.15
        14.15 |         23        0.00        0.15
        14.16 |         29        0.00        0.16
        14.17 |         30        0.00        0.16
        14.18 |         14        0.00        0.16
        14.19 |         34        0.00        0.16
         14.2 |         35        0.00        0.17
        14.21 |         18        0.00        0.17
        14.22 |         24        0.00        0.17
        14.23 |          9        0.00        0.17
        14.24 |         20        0.00        0.17
        14.25 |         17        0.00        0.17
        14.26 |         26        0.00        0.18
        14.27 |         12        0.00        0.18
        14.28 |         22        0.00        0.18
        14.29 |         34        0.00        0.18
         14.3 |         34        0.00        0.19
        14.31 |         37        0.00        0.19
        14.32 |         34        0.00        0.19
        14.33 |         28        0.00        0.19
        14.34 |         21        0.00        0.20
        14.35 |         23        0.00        0.20
        14.36 |         21        0.00        0.20
        14.37 |         29        0.00        0.20
        14.38 |         26        0.00        0.20
        14.39 |          6        0.00        0.21
         14.4 |         35        0.00        0.21
        14.41 |         19        0.00        0.21
        14.42 |         36        0.00        0.21
        14.43 |         38        0.00        0.22
        14.44 |         34        0.00        0.22
        14.45 |         33        0.00        0.22
        14.46 |         28        0.00        0.23
        14.47 |         24        0.00        0.23
        14.48 |         41        0.00        0.23
        14.49 |         21        0.00        0.23
         14.5 |         20        0.00        0.23
        14.51 |         20        0.00        0.24
        14.52 |         30        0.00        0.24
        14.53 |         30        0.00        0.24
        14.54 |         48        0.00        0.25
        14.55 |         50        0.00        0.25
        14.56 |         34        0.00        0.25
        14.57 |         50        0.00        0.26
        14.58 |         31        0.00        0.26
        14.59 |         47        0.00        0.27
         14.6 |         52        0.00        0.27
        14.61 |         35        0.00        0.27
        14.62 |         20        0.00        0.28
        14.63 |         25        0.00        0.28
        14.64 |         26        0.00        0.28
        14.65 |         37        0.00        0.28
        14.66 |         58        0.01        0.29
        14.67 |         37        0.00        0.29
        14.68 |         25        0.00        0.29
        14.69 |         74        0.01        0.30
         14.7 |         50        0.00        0.31
        14.71 |         60        0.01        0.31
        14.72 |         51        0.00        0.32
        14.73 |         48        0.00        0.32
        14.74 |         59        0.01        0.32
        14.75 |         31        0.00        0.33
        14.76 |         25        0.00        0.33
        14.77 |         48        0.00        0.33
        14.78 |         64        0.01        0.34
        14.79 |         45        0.00        0.34
         14.8 |         57        0.01        0.35
        14.81 |         58        0.01        0.35
        14.82 |         50        0.00        0.36
        14.83 |         72        0.01        0.37
        14.84 |         42        0.00        0.37
        14.85 |         45        0.00        0.37
        14.86 |         54        0.00        0.38
        14.87 |         49        0.00        0.38
        14.88 |         64        0.01        0.39
        14.89 |         49        0.00        0.39
         14.9 |         55        0.00        0.40
        14.91 |         39        0.00        0.40
        14.92 |         70        0.01        0.41
        14.93 |         54        0.00        0.41
        14.94 |         58        0.01        0.42
        14.95 |         46        0.00        0.42
        14.96 |         52        0.00        0.43
        14.97 |         51        0.00        0.43
        14.98 |         69        0.01        0.44
        14.99 |         42        0.00        0.44
           15 |         49        0.00        0.45
        15.01 |         63        0.01        0.45
        15.02 |         74        0.01        0.46
        15.03 |         69        0.01        0.46
        15.04 |         54        0.00        0.47
        15.05 |         57        0.01        0.47
        15.06 |         50        0.00        0.48
        15.07 |         47        0.00        0.48
        15.08 |         71        0.01        0.49
        15.09 |         72        0.01        0.50
         15.1 |         93        0.01        0.50
        15.11 |         94        0.01        0.51
        15.12 |         53        0.00        0.52
        15.13 |         86        0.01        0.52
        15.14 |         73        0.01        0.53
        15.15 |         99        0.01        0.54
        15.16 |         60        0.01        0.55
        15.17 |         69        0.01        0.55
        15.18 |         82        0.01        0.56
        15.19 |         60        0.01        0.56
         15.2 |         95        0.01        0.57
        15.21 |         96        0.01        0.58
        15.22 |         63        0.01        0.59
        15.23 |         72        0.01        0.59
        15.24 |         62        0.01        0.60
        15.25 |         57        0.01        0.60
        15.26 |         71        0.01        0.61
        15.27 |         86        0.01        0.62
        15.28 |        106        0.01        0.63
        15.29 |         70        0.01        0.63
         15.3 |         53        0.00        0.64
        15.31 |         74        0.01        0.65
        15.32 |         72        0.01        0.65
        15.33 |         57        0.01        0.66
        15.34 |         95        0.01        0.67
        15.35 |         95        0.01        0.67
        15.36 |         86        0.01        0.68
        15.37 |         74        0.01        0.69
        15.38 |        102        0.01        0.70
        15.39 |        127        0.01        0.71
         15.4 |         69        0.01        0.72
        15.41 |         89        0.01        0.72
        15.42 |         65        0.01        0.73
        15.43 |         99        0.01        0.74
        15.44 |         77        0.01        0.75
        15.45 |         94        0.01        0.75
        15.46 |         79        0.01        0.76
        15.47 |        114        0.01        0.77
        15.48 |         67        0.01        0.78
        15.49 |         74        0.01        0.78
         15.5 |         83        0.01        0.79
        15.51 |        118        0.01        0.80
        15.52 |        103        0.01        0.81
        15.53 |        124        0.01        0.82
        15.54 |        111        0.01        0.83
        15.55 |        129        0.01        0.84
        15.56 |        128        0.01        0.86
        15.57 |        121        0.01        0.87
        15.58 |        118        0.01        0.88
        15.59 |        110        0.01        0.89
         15.6 |        117        0.01        0.90
        15.61 |        117        0.01        0.91
        15.62 |        168        0.02        0.92
        15.63 |        134        0.01        0.94
        15.64 |        141        0.01        0.95
        15.65 |         88        0.01        0.96
        15.66 |        155        0.01        0.97
        15.67 |        140        0.01        0.98
        15.68 |        112        0.01        0.99
        15.69 |        105        0.01        1.00
         15.7 |        157        0.01        1.02
        15.71 |         89        0.01        1.02
        15.72 |        154        0.01        1.04
        15.73 |         89        0.01        1.05
        15.74 |        139        0.01        1.06
        15.75 |         96        0.01        1.07
        15.76 |        139        0.01        1.08
        15.77 |        102        0.01        1.09
        15.78 |        162        0.01        1.10
        15.79 |        107        0.01        1.11
         15.8 |        177        0.02        1.13
        15.81 |        118        0.01        1.14
        15.82 |        179        0.02        1.16
        15.83 |        103        0.01        1.16
        15.84 |        134        0.01        1.18
        15.85 |        113        0.01        1.19
        15.86 |        177        0.02        1.20
        15.87 |         85        0.01        1.21
        15.88 |        183        0.02        1.23
        15.89 |         88        0.01        1.24
         15.9 |        157        0.01        1.25
        15.91 |         77        0.01        1.26
        15.92 |        169        0.02        1.27
        15.93 |        106        0.01        1.28
        15.94 |        175        0.02        1.30
        15.95 |        110        0.01        1.31
        15.96 |        236        0.02        1.33
        15.97 |        121        0.01        1.34
        15.98 |        224        0.02        1.36
        15.99 |        101        0.01        1.37
           16 |        216        0.02        1.39
        16.01 |        123        0.01        1.40
        16.02 |        191        0.02        1.42
        16.03 |        163        0.01        1.43
        16.04 |        199        0.02        1.45
        16.05 |        198        0.02        1.47
        16.06 |        145        0.01        1.48
        16.07 |        175        0.02        1.49
        16.08 |        148        0.01        1.51
        16.09 |        175        0.02        1.52
         16.1 |        130        0.01        1.54
        16.11 |        147        0.01        1.55
        16.12 |        166        0.01        1.56
        16.13 |        214        0.02        1.58
        16.14 |        211        0.02        1.60
        16.15 |        217        0.02        1.62
        16.16 |        154        0.01        1.64
        16.17 |        198        0.02        1.65
        16.18 |        121        0.01        1.66
        16.19 |        247        0.02        1.69
         16.2 |        164        0.01        1.70
        16.21 |        237        0.02        1.72
        16.22 |        154        0.01        1.74
        16.23 |        297        0.03        1.76
        16.24 |        124        0.01        1.77
        16.25 |        192        0.02        1.79
        16.26 |        129        0.01        1.80
        16.27 |        212        0.02        1.82
        16.28 |        196        0.02        1.84
        16.29 |        216        0.02        1.86
         16.3 |        214        0.02        1.88
        16.31 |        177        0.02        1.89
        16.32 |        306        0.03        1.92
        16.33 |        235        0.02        1.94
        16.34 |        297        0.03        1.97
        16.35 |        193        0.02        1.99
        16.36 |        275        0.02        2.01
        16.37 |        203        0.02        2.03
        16.38 |        292        0.03        2.06
        16.39 |        145        0.01        2.07
         16.4 |        349        0.03        2.10
        16.41 |        106        0.01        2.11
        16.42 |        259        0.02        2.13
        16.43 |        195        0.02        2.15
        16.44 |        217        0.02        2.17
        16.45 |        231        0.02        2.19
        16.46 |        227        0.02        2.21
        16.47 |        227        0.02        2.23
        16.48 |        172        0.02        2.25
        16.49 |        280        0.03        2.27
         16.5 |        196        0.02        2.29
        16.51 |        286        0.03        2.32
        16.52 |        177        0.02        2.33
        16.53 |        396        0.04        2.37
        16.54 |        149        0.01        2.38
        16.55 |        264        0.02        2.41
        16.56 |        291        0.03        2.43
        16.57 |        256        0.02        2.45
        16.58 |        295        0.03        2.48
        16.59 |        168        0.02        2.50
         16.6 |        338        0.03        2.53
        16.61 |        249        0.02        2.55
        16.62 |        372        0.03        2.58
        16.63 |        212        0.02        2.60
        16.64 |        331        0.03        2.63
        16.65 |        254        0.02        2.65
        16.66 |        330        0.03        2.68
        16.67 |        315        0.03        2.71
        16.68 |        268        0.02        2.74
        16.69 |        276        0.02        2.76
         16.7 |        246        0.02        2.78
        16.71 |        347        0.03        2.81
        16.72 |        217        0.02        2.83
        16.73 |        337        0.03        2.86
        16.74 |        178        0.02        2.88
        16.75 |        329        0.03        2.91
        16.76 |        334        0.03        2.94
        16.77 |        312        0.03        2.97
        16.78 |        316        0.03        3.00
        16.79 |        242        0.02        3.02
         16.8 |        407        0.04        3.06
        16.81 |        243        0.02        3.08
        16.82 |        392        0.04        3.11
        16.83 |        234        0.02        3.13
        16.84 |        311        0.03        3.16
        16.85 |        337        0.03        3.19
        16.86 |        277        0.02        3.22
        16.87 |        349        0.03        3.25
        16.88 |        302        0.03        3.28
        16.89 |        423        0.04        3.31
         16.9 |        296        0.03        3.34
        16.91 |        451        0.04        3.38
        16.92 |        264        0.02        3.40
        16.93 |        309        0.03        3.43
        16.94 |        429        0.04        3.47
        16.95 |        273        0.02        3.50
        16.96 |        417        0.04        3.53
        16.97 |        360        0.03        3.57
        16.98 |        415        0.04        3.60
        16.99 |        241        0.02        3.62
           17 |        316        0.03        3.65
        17.01 |        388        0.03        3.69
        17.02 |        363        0.03        3.72
        17.03 |        421        0.04        3.76
        17.04 |        383        0.03        3.79
        17.05 |        449        0.04        3.83
        17.06 |        278        0.03        3.86
        17.07 |        346        0.03        3.89
        17.08 |        375        0.03        3.92
        17.09 |        473        0.04        3.97
         17.1 |        384        0.03        4.00
        17.11 |        335        0.03        4.03
        17.12 |        442        0.04        4.07
        17.13 |        307        0.03        4.10
        17.14 |        387        0.03        4.13
        17.15 |        375        0.03        4.17
        17.16 |        348        0.03        4.20
        17.17 |        438        0.04        4.24
        17.18 |        348        0.03        4.27
        17.19 |        423        0.04        4.31
         17.2 |        386        0.03        4.34
        17.21 |        412        0.04        4.38
        17.22 |        377        0.03        4.41
        17.23 |        313        0.03        4.44
        17.24 |        607        0.05        4.49
        17.25 |        330        0.03        4.52
        17.26 |        523        0.05        4.57
        17.27 |        468        0.04        4.61
        17.28 |        315        0.03        4.64
        17.29 |        495        0.04        4.69
         17.3 |        419        0.04        4.72
        17.31 |        474        0.04        4.77
        17.32 |        375        0.03        4.80
        17.33 |        423        0.04        4.84
        17.34 |        517        0.05        4.89
        17.35 |        413        0.04        4.92
        17.36 |        521        0.05        4.97
        17.37 |        355        0.03        5.00
        17.38 |        445        0.04        5.04
        17.39 |        413        0.04        5.08
         17.4 |        498        0.04        5.12
        17.41 |        513        0.05        5.17
        17.42 |        407        0.04        5.21
        17.43 |        457        0.04        5.25
        17.44 |        422        0.04        5.29
        17.45 |        405        0.04        5.32
        17.46 |        526        0.05        5.37
        17.47 |        537        0.05        5.42
        17.48 |        474        0.04        5.46
        17.49 |        422        0.04        5.50
         17.5 |        611        0.05        5.55
        17.51 |        521        0.05        5.60
        17.52 |        524        0.05        5.65
        17.53 |        484        0.04        5.69
        17.54 |        375        0.03        5.72
        17.55 |        507        0.05        5.77
        17.56 |        453        0.04        5.81
        17.57 |        471        0.04        5.85
        17.58 |        677        0.06        5.91
        17.59 |        485        0.04        5.96
         17.6 |        627        0.06        6.01
        17.61 |        437        0.04        6.05
        17.62 |        447        0.04        6.09
        17.63 |        584        0.05        6.15
        17.64 |        465        0.04        6.19
        17.65 |        507        0.05        6.23
        17.66 |        518        0.05        6.28
        17.67 |        525        0.05        6.33
        17.68 |        558        0.05        6.38
        17.69 |        577        0.05        6.43
         17.7 |        537        0.05        6.48
        17.71 |        529        0.05        6.53
        17.72 |        528        0.05        6.57
        17.73 |        518        0.05        6.62
        17.74 |        577        0.05        6.67
        17.75 |        596        0.05        6.73
        17.76 |        521        0.05        6.77
        17.77 |        551        0.05        6.82
        17.78 |        654        0.06        6.88
        17.79 |        575        0.05        6.93
         17.8 |        626        0.06        6.99
        17.81 |        663        0.06        7.05
        17.82 |        616        0.06        7.10
        17.83 |        554        0.05        7.15
        17.84 |        530        0.05        7.20
        17.85 |        643        0.06        7.26
        17.86 |        648        0.06        7.32
        17.87 |        602        0.05        7.37
        17.88 |        617        0.06        7.43
        17.89 |        507        0.05        7.47
         17.9 |        574        0.05        7.52
        17.91 |        661        0.06        7.58
        17.92 |        595        0.05        7.64
        17.93 |        680        0.06        7.70
        17.94 |        531        0.05        7.75
        17.95 |        486        0.04        7.79
        17.96 |        644        0.06        7.85
        17.97 |        615        0.06        7.90
        17.98 |        655        0.06        7.96
        17.99 |        694        0.06        8.02
           18 |        664        0.06        8.08
        18.01 |        613        0.06        8.14
        18.02 |        555        0.05        8.19
        18.03 |        805        0.07        8.26
        18.04 |        579        0.05        8.31
        18.05 |        570        0.05        8.37
        18.06 |        676        0.06        8.43
        18.07 |        678        0.06        8.49
        18.08 |        560        0.05        8.54
        18.09 |        641        0.06        8.60
         18.1 |        630        0.06        8.65
        18.11 |        568        0.05        8.70
        18.12 |        723        0.07        8.77
        18.13 |        667        0.06        8.83
        18.14 |        713        0.06        8.89
        18.15 |        590        0.05        8.95
        18.16 |        709        0.06        9.01
        18.17 |        729        0.07        9.07
        18.18 |        637        0.06        9.13
        18.19 |        632        0.06        9.19
         18.2 |        612        0.06        9.24
        18.21 |        719        0.06        9.31
        18.22 |        749        0.07        9.38
        18.23 |        601        0.05        9.43
        18.24 |        723        0.07        9.50
        18.25 |        716        0.06        9.56
        18.26 |        728        0.07        9.63
        18.27 |        731        0.07        9.69
        18.28 |        581        0.05        9.74
        18.29 |        809        0.07        9.82
         18.3 |        782        0.07        9.89
        18.31 |        740        0.07        9.95
        18.32 |        673        0.06       10.01
        18.33 |        760        0.07       10.08
        18.34 |        699        0.06       10.15
        18.35 |        622        0.06       10.20
        18.36 |        886        0.08       10.28
        18.37 |        777        0.07       10.35
        18.38 |        660        0.06       10.41
        18.39 |        727        0.07       10.48
         18.4 |        958        0.09       10.56
        18.41 |        747        0.07       10.63
        18.42 |        684        0.06       10.69
        18.43 |        830        0.07       10.77
        18.44 |        832        0.07       10.84
        18.45 |        590        0.05       10.89
        18.46 |        744        0.07       10.96
        18.47 |        807        0.07       11.03
        18.48 |        707        0.06       11.10
        18.49 |        734        0.07       11.16
         18.5 |        814        0.07       11.24
        18.51 |        793        0.07       11.31
        18.52 |        808        0.07       11.38
        18.53 |        759        0.07       11.45
        18.54 |        687        0.06       11.51
        18.55 |        772        0.07       11.58
        18.56 |        787        0.07       11.65
        18.57 |        648        0.06       11.71
        18.58 |        766        0.07       11.78
        18.59 |      1,051        0.09       11.87
         18.6 |        670        0.06       11.93
        18.61 |        844        0.08       12.01
        18.62 |        769        0.07       12.08
        18.63 |        870        0.08       12.16
        18.64 |        768        0.07       12.22
        18.65 |        792        0.07       12.30
        18.66 |        876        0.08       12.38
        18.67 |        852        0.08       12.45
        18.68 |        743        0.07       12.52
        18.69 |        766        0.07       12.59
         18.7 |        807        0.07       12.66
        18.71 |        777        0.07       12.73
        18.72 |        696        0.06       12.79
        18.73 |        898        0.08       12.87
        18.74 |        846        0.08       12.95
        18.75 |        957        0.09       13.04
        18.76 |        718        0.06       13.10
        18.77 |        814        0.07       13.17
        18.78 |        854        0.08       13.25
        18.79 |        851        0.08       13.33
         18.8 |        844        0.08       13.40
        18.81 |        862        0.08       13.48
        18.82 |        892        0.08       13.56
        18.83 |        859        0.08       13.64
        18.84 |        764        0.07       13.71
        18.85 |        794        0.07       13.78
        18.86 |        960        0.09       13.86
        18.87 |        882        0.08       13.94
        18.88 |        783        0.07       14.01
        18.89 |        756        0.07       14.08
         18.9 |        885        0.08       14.16
        18.91 |        901        0.08       14.24
        18.92 |        882        0.08       14.32
        18.93 |        865        0.08       14.40
        18.94 |      1,040        0.09       14.49
        18.95 |      1,046        0.09       14.59
        18.96 |        851        0.08       14.66
        18.97 |        889        0.08       14.74
        18.98 |        985        0.09       14.83
        18.99 |        893        0.08       14.91
           19 |        874        0.08       14.99
        19.01 |        899        0.08       15.07
        19.02 |      1,011        0.09       15.16
        19.03 |        931        0.08       15.25
        19.04 |        703        0.06       15.31
        19.05 |        938        0.08       15.40
        19.06 |        924        0.08       15.48
        19.07 |        852        0.08       15.56
        19.08 |        990        0.09       15.64
        19.09 |        871        0.08       15.72
         19.1 |      1,015        0.09       15.81
        19.11 |        969        0.09       15.90
        19.12 |        984        0.09       15.99
        19.13 |        874        0.08       16.07
        19.14 |      1,046        0.09       16.16
        19.15 |      1,000        0.09       16.25
        19.16 |        994        0.09       16.34
        19.17 |        904        0.08       16.42
        19.18 |        946        0.09       16.51
        19.19 |      1,085        0.10       16.61
         19.2 |        910        0.08       16.69
        19.21 |        861        0.08       16.77
        19.22 |        952        0.09       16.85
        19.23 |      1,073        0.10       16.95
        19.24 |        768        0.07       17.02
        19.25 |      1,047        0.09       17.11
        19.26 |      1,004        0.09       17.20
        19.27 |      1,045        0.09       17.30
        19.28 |        838        0.08       17.37
        19.29 |        994        0.09       17.46
         19.3 |      1,028        0.09       17.55
        19.31 |      1,071        0.10       17.65
        19.32 |        875        0.08       17.73
        19.33 |      1,030        0.09       17.82
        19.34 |      1,007        0.09       17.91
        19.35 |      1,159        0.10       18.02
        19.36 |        867        0.08       18.09
        19.37 |        767        0.07       18.16
        19.38 |      1,067        0.10       18.26
        19.39 |      1,034        0.09       18.35
         19.4 |      1,161        0.10       18.46
        19.41 |        944        0.08       18.54
        19.42 |        897        0.08       18.62
        19.43 |      1,109        0.10       18.72
        19.44 |        976        0.09       18.81
        19.45 |        983        0.09       18.90
        19.46 |      1,028        0.09       18.99
        19.47 |      1,041        0.09       19.08
        19.48 |      1,101        0.10       19.18
        19.49 |        945        0.09       19.27
         19.5 |      1,049        0.09       19.36
        19.51 |      1,100        0.10       19.46
        19.52 |        964        0.09       19.55
        19.53 |      1,127        0.10       19.65
        19.54 |        944        0.08       19.74
        19.55 |      1,024        0.09       19.83
        19.56 |      1,161        0.10       19.93
        19.57 |      1,051        0.09       20.03
        19.58 |        937        0.08       20.11
        19.59 |      1,085        0.10       20.21
         19.6 |      1,094        0.10       20.31
        19.61 |      1,071        0.10       20.40
        19.62 |      1,023        0.09       20.50
        19.63 |      1,062        0.10       20.59
        19.64 |      1,060        0.10       20.69
        19.65 |      1,157        0.10       20.79
        19.66 |      1,011        0.09       20.88
        19.67 |        961        0.09       20.97
        19.68 |      1,159        0.10       21.07
        19.69 |      1,163        0.10       21.18
         19.7 |      1,067        0.10       21.27
        19.71 |      1,098        0.10       21.37
        19.72 |      1,049        0.09       21.47
        19.73 |      1,155        0.10       21.57
        19.74 |      1,013        0.09       21.66
        19.75 |      1,053        0.09       21.76
        19.76 |      1,076        0.10       21.85
        19.77 |      1,131        0.10       21.95
        19.78 |      1,121        0.10       22.06
        19.79 |        958        0.09       22.14
         19.8 |        989        0.09       22.23
        19.81 |      1,139        0.10       22.33
        19.82 |      1,212        0.11       22.44
        19.83 |      1,005        0.09       22.53
        19.84 |        939        0.08       22.62
        19.85 |      1,002        0.09       22.71
        19.86 |      1,072        0.10       22.80
        19.87 |      1,017        0.09       22.90
        19.88 |      1,138        0.10       23.00
        19.89 |        990        0.09       23.09
         19.9 |      1,258        0.11       23.20
        19.91 |      1,189        0.11       23.31
        19.92 |        949        0.09       23.39
        19.93 |      1,145        0.10       23.50
        19.94 |      1,126        0.10       23.60
        19.95 |      1,258        0.11       23.71
        19.96 |      1,204        0.11       23.82
        19.97 |        962        0.09       23.91
        19.98 |      1,235        0.11       24.02
        19.99 |      1,097        0.10       24.11
           20 |      1,222        0.11       24.22
        20.01 |      1,063        0.10       24.32
        20.02 |      1,064        0.10       24.42
        20.03 |      1,088        0.10       24.51
        20.04 |      1,271        0.11       24.63
        20.05 |      1,006        0.09       24.72
        20.06 |      1,145        0.10       24.82
        20.07 |      1,025        0.09       24.91
        20.08 |      1,176        0.11       25.02
        20.09 |      1,144        0.10       25.12
         20.1 |      1,007        0.09       25.21
        20.11 |      1,079        0.10       25.31
        20.12 |      1,126        0.10       25.41
        20.13 |      1,321        0.12       25.53
        20.14 |      1,072        0.10       25.63
        20.15 |      1,030        0.09       25.72
        20.16 |      1,064        0.10       25.82
        20.17 |      1,072        0.10       25.91
        20.18 |      1,123        0.10       26.01
        20.19 |      1,014        0.09       26.10
         20.2 |      1,274        0.11       26.22
        20.21 |      1,313        0.12       26.34
        20.22 |      1,114        0.10       26.44
        20.23 |      1,172        0.11       26.54
        20.24 |      1,240        0.11       26.65
        20.25 |      1,030        0.09       26.75
        20.26 |      1,300        0.12       26.86
        20.27 |      1,072        0.10       26.96
        20.28 |      1,238        0.11       27.07
        20.29 |      1,090        0.10       27.17
         20.3 |      1,079        0.10       27.27
        20.31 |      1,257        0.11       27.38
        20.32 |      1,172        0.11       27.49
        20.33 |      1,033        0.09       27.58
        20.34 |      1,037        0.09       27.67
        20.35 |      1,194        0.11       27.78
        20.36 |      1,195        0.11       27.89
        20.37 |      1,235        0.11       28.00
        20.38 |      1,073        0.10       28.10
        20.39 |      1,090        0.10       28.19
         20.4 |      1,186        0.11       28.30
        20.41 |      1,254        0.11       28.41
        20.42 |      1,115        0.10       28.51
        20.43 |      1,039        0.09       28.61
        20.44 |      1,259        0.11       28.72
        20.45 |      1,134        0.10       28.82
        20.46 |      1,152        0.10       28.93
        20.47 |      1,253        0.11       29.04
        20.48 |      1,019        0.09       29.13
        20.49 |      1,216        0.11       29.24
         20.5 |      1,256        0.11       29.35
        20.51 |      1,155        0.10       29.46
        20.52 |      1,244        0.11       29.57
        20.53 |      1,118        0.10       29.67
        20.54 |      1,138        0.10       29.77
        20.55 |      1,412        0.13       29.90
        20.56 |      1,116        0.10       30.00
        20.57 |      1,263        0.11       30.11
        20.58 |      1,086        0.10       30.21
        20.59 |      1,079        0.10       30.31
         20.6 |      1,214        0.11       30.42
        20.61 |      1,217        0.11       30.53
        20.62 |      1,060        0.10       30.62
        20.63 |      1,244        0.11       30.73
        20.64 |      1,163        0.10       30.84
        20.65 |      1,272        0.11       30.95
        20.66 |      1,214        0.11       31.06
        20.67 |      1,139        0.10       31.16
        20.68 |      1,141        0.10       31.27
        20.69 |      1,178        0.11       31.37
         20.7 |      1,247        0.11       31.49
        20.71 |        936        0.08       31.57
        20.72 |      1,082        0.10       31.67
        20.73 |      1,334        0.12       31.79
        20.74 |      1,080        0.10       31.88
        20.75 |      1,126        0.10       31.99
        20.76 |      1,043        0.09       32.08
        20.77 |      1,173        0.11       32.19
        20.78 |      1,155        0.10       32.29
        20.79 |      1,270        0.11       32.40
         20.8 |      1,007        0.09       32.49
        20.81 |      1,170        0.11       32.60
        20.82 |      1,336        0.12       32.72
        20.83 |      1,379        0.12       32.84
        20.84 |        948        0.09       32.93
        20.85 |      1,133        0.10       33.03
        20.86 |      1,100        0.10       33.13
        20.87 |      1,254        0.11       33.24
        20.88 |      1,149        0.10       33.35
        20.89 |      1,171        0.11       33.45
         20.9 |      1,059        0.10       33.55
        20.91 |      1,173        0.11       33.65
        20.92 |      1,301        0.12       33.77
        20.93 |        949        0.09       33.85
        20.94 |      1,104        0.10       33.95
        20.95 |      1,171        0.11       34.06
        20.96 |      1,454        0.13       34.19
        20.97 |      1,100        0.10       34.29
        20.98 |      1,067        0.10       34.39
        20.99 |      1,214        0.11       34.49
           21 |      1,240        0.11       34.61
        21.01 |        956        0.09       34.69
        21.02 |      1,113        0.10       34.79
        21.03 |      1,116        0.10       34.89
        21.04 |      1,188        0.11       35.00
        21.05 |      1,012        0.09       35.09
        21.06 |      1,059        0.10       35.19
        21.07 |      1,293        0.12       35.30
        21.08 |      1,418        0.13       35.43
        21.09 |      1,020        0.09       35.52
         21.1 |      1,158        0.10       35.63
        21.11 |      1,253        0.11       35.74
        21.12 |      1,293        0.12       35.86
        21.13 |        966        0.09       35.94
        21.14 |      1,127        0.10       36.04
        21.15 |      1,224        0.11       36.15
        21.16 |      1,212        0.11       36.26
        21.17 |        972        0.09       36.35
        21.18 |      1,062        0.10       36.45
        21.19 |      1,247        0.11       36.56
         21.2 |      1,280        0.12       36.67
        21.21 |        969        0.09       36.76
        21.22 |      1,296        0.12       36.88
        21.23 |      1,268        0.11       36.99
        21.24 |      1,259        0.11       37.10
        21.25 |        950        0.09       37.19
        21.26 |      1,241        0.11       37.30
        21.27 |      1,354        0.12       37.42
        21.28 |      1,084        0.10       37.52
        21.29 |      1,097        0.10       37.62
         21.3 |      1,360        0.12       37.74
        21.31 |      1,351        0.12       37.86
        21.32 |        975        0.09       37.95
        21.33 |      1,195        0.11       38.06
        21.34 |      1,280        0.12       38.17
        21.35 |      1,090        0.10       38.27
        21.36 |      1,093        0.10       38.37
        21.37 |      1,200        0.11       38.48
        21.38 |      1,330        0.12       38.60
        21.39 |      1,216        0.11       38.71
         21.4 |      1,025        0.09       38.80
        21.41 |      1,192        0.11       38.91
        21.42 |      1,228        0.11       39.02
        21.43 |      1,037        0.09       39.11
        21.44 |      1,138        0.10       39.21
        21.45 |      1,237        0.11       39.32
        21.46 |      1,296        0.12       39.44
        21.47 |      1,030        0.09       39.53
        21.48 |      1,233        0.11       39.65
        21.49 |      1,381        0.12       39.77
         21.5 |      1,220        0.11       39.88
        21.51 |      1,086        0.10       39.98
        21.52 |      1,138        0.10       40.08
        21.53 |      1,284        0.12       40.20
        21.54 |      1,004        0.09       40.29
        21.55 |      1,146        0.10       40.39
        21.56 |      1,385        0.12       40.51
        21.57 |      1,319        0.12       40.63
        21.58 |        912        0.08       40.71
        21.59 |      1,162        0.10       40.82
         21.6 |      1,210        0.11       40.93
        21.61 |      1,004        0.09       41.02
        21.62 |      1,139        0.10       41.12
        21.63 |      1,265        0.11       41.23
        21.64 |      1,415        0.13       41.36
        21.65 |        900        0.08       41.44
        21.66 |      1,119        0.10       41.54
        21.67 |      1,282        0.12       41.66
        21.68 |      1,139        0.10       41.76
        21.69 |      1,057        0.10       41.86
         21.7 |      1,283        0.12       41.97
        21.71 |      1,157        0.10       42.08
        21.72 |      1,064        0.10       42.17
        21.73 |      1,156        0.10       42.28
        21.74 |      1,179        0.11       42.38
        21.75 |      1,019        0.09       42.47
        21.76 |      1,193        0.11       42.58
        21.77 |      1,173        0.11       42.69
        21.78 |      1,140        0.10       42.79
        21.79 |      1,139        0.10       42.89
         21.8 |      1,337        0.12       43.01
        21.81 |      1,138        0.10       43.11
        21.82 |        940        0.08       43.20
        21.83 |      1,057        0.10       43.29
        21.84 |      1,154        0.10       43.40
        21.85 |      1,006        0.09       43.49
        21.86 |      1,028        0.09       43.58
        21.87 |      1,195        0.11       43.69
        21.88 |      1,175        0.11       43.79
        21.89 |      1,067        0.10       43.89
         21.9 |      1,095        0.10       43.99
        21.91 |      1,159        0.10       44.09
        21.92 |        888        0.08       44.17
        21.93 |      1,199        0.11       44.28
        21.94 |      1,193        0.11       44.39
        21.95 |        984        0.09       44.48
        21.96 |      1,137        0.10       44.58
        21.97 |      1,249        0.11       44.69
        21.98 |        887        0.08       44.77
        21.99 |      1,299        0.12       44.89
           22 |      1,172        0.11       44.99
        22.01 |      1,110        0.10       45.09
        22.02 |      1,180        0.11       45.20
        22.03 |      1,199        0.11       45.31
        22.04 |      1,088        0.10       45.41
        22.05 |      1,044        0.09       45.50
        22.06 |      1,108        0.10       45.60
        22.07 |      1,300        0.12       45.72
        22.08 |        812        0.07       45.79
        22.09 |      1,088        0.10       45.89
         22.1 |      1,250        0.11       46.00
        22.11 |        877        0.08       46.08
        22.12 |      1,128        0.10       46.18
        22.13 |      1,159        0.10       46.28
        22.14 |      1,003        0.09       46.37
        22.15 |      1,241        0.11       46.49
        22.16 |      1,138        0.10       46.59
        22.17 |      1,002        0.09       46.68
        22.18 |      1,004        0.09       46.77
        22.19 |      1,246        0.11       46.88
         22.2 |      1,041        0.09       46.97
        22.21 |      1,120        0.10       47.08
        22.22 |      1,207        0.11       47.18
        22.23 |      1,021        0.09       47.28
        22.24 |        862        0.08       47.35
        22.25 |      1,105        0.10       47.45
        22.26 |      1,131        0.10       47.55
        22.27 |      1,089        0.10       47.65
        22.28 |      1,107        0.10       47.75
        22.29 |      1,070        0.10       47.85
         22.3 |      1,016        0.09       47.94
        22.31 |      1,199        0.11       48.05
        22.32 |        946        0.09       48.13
        22.33 |      1,187        0.11       48.24
        22.34 |      1,008        0.09       48.33
        22.35 |      1,242        0.11       48.44
        22.36 |        851        0.08       48.52
        22.37 |      1,126        0.10       48.62
        22.38 |        946        0.09       48.71
        22.39 |      1,121        0.10       48.81
         22.4 |      1,075        0.10       48.90
        22.41 |      1,008        0.09       48.99
        22.42 |      1,002        0.09       49.08
        22.43 |      1,153        0.10       49.19
        22.44 |      1,053        0.09       49.28
        22.45 |        933        0.08       49.37
        22.46 |      1,142        0.10       49.47
        22.47 |      1,010        0.09       49.56
        22.48 |      1,164        0.10       49.67
        22.49 |        958        0.09       49.75
         22.5 |        962        0.09       49.84
        22.51 |      1,097        0.10       49.94
        22.52 |      1,174        0.11       50.04
        22.53 |        979        0.09       50.13
        22.54 |      1,044        0.09       50.22
        22.55 |      1,013        0.09       50.32
        22.56 |        980        0.09       50.40
        22.57 |        916        0.08       50.49
        22.58 |      1,144        0.10       50.59
        22.59 |        947        0.09       50.67
         22.6 |      1,195        0.11       50.78
        22.61 |      1,078        0.10       50.88
        22.62 |        833        0.07       50.95
        22.63 |      1,110        0.10       51.05
        22.64 |      1,163        0.10       51.16
        22.65 |        757        0.07       51.23
        22.66 |      1,209        0.11       51.34
        22.67 |      1,094        0.10       51.43
        22.68 |      1,178        0.11       51.54
        22.69 |        997        0.09       51.63
         22.7 |        913        0.08       51.71
        22.71 |        916        0.08       51.79
        22.72 |      1,191        0.11       51.90
        22.73 |        944        0.08       51.99
        22.74 |      1,024        0.09       52.08
        22.75 |      1,067        0.10       52.17
        22.76 |        970        0.09       52.26
        22.77 |      1,224        0.11       52.37
        22.78 |      1,063        0.10       52.47
        22.79 |        962        0.09       52.55
         22.8 |        827        0.07       52.63
        22.81 |      1,066        0.10       52.72
        22.82 |      1,018        0.09       52.82
        22.83 |      1,066        0.10       52.91
        22.84 |        948        0.09       53.00
        22.85 |      1,066        0.10       53.09
        22.86 |      1,149        0.10       53.20
        22.87 |        860        0.08       53.27
        22.88 |        883        0.08       53.35
        22.89 |      1,086        0.10       53.45
         22.9 |        911        0.08       53.53
        22.91 |        973        0.09       53.62
        22.92 |      1,059        0.10       53.72
        22.93 |        786        0.07       53.79
        22.94 |      1,096        0.10       53.89
        22.95 |        944        0.08       53.97
        22.96 |      1,072        0.10       54.07
        22.97 |        902        0.08       54.15
        22.98 |        991        0.09       54.24
        22.99 |      1,012        0.09       54.33
           23 |        972        0.09       54.42
        23.01 |        931        0.08       54.50
        23.02 |      1,043        0.09       54.59
        23.03 |      1,053        0.09       54.69
        23.04 |        821        0.07       54.76
        23.05 |      1,189        0.11       54.87
        23.06 |        753        0.07       54.94
        23.07 |      1,101        0.10       55.04
        23.08 |      1,003        0.09       55.13
        23.09 |        948        0.09       55.21
         23.1 |        841        0.08       55.29
        23.11 |        991        0.09       55.38
        23.12 |        955        0.09       55.46
        23.13 |        904        0.08       55.54
        23.14 |        947        0.09       55.63
        23.15 |      1,128        0.10       55.73
        23.16 |        884        0.08       55.81
        23.17 |        959        0.09       55.90
        23.18 |      1,049        0.09       55.99
        23.19 |        970        0.09       56.08
         23.2 |        941        0.08       56.16
        23.21 |        929        0.08       56.25
        23.22 |        900        0.08       56.33
        23.23 |        872        0.08       56.41
        23.24 |        971        0.09       56.49
        23.25 |        827        0.07       56.57
        23.26 |        903        0.08       56.65
        23.27 |        839        0.08       56.72
        23.28 |        964        0.09       56.81
        23.29 |        995        0.09       56.90
         23.3 |        798        0.07       56.97
        23.31 |        939        0.08       57.06
        23.32 |        967        0.09       57.14
        23.33 |        832        0.07       57.22
        23.34 |        994        0.09       57.31
        23.35 |      1,000        0.09       57.40
        23.36 |        812        0.07       57.47
        23.37 |      1,007        0.09       57.56
        23.38 |        843        0.08       57.64
        23.39 |        877        0.08       57.72
         23.4 |        991        0.09       57.81
        23.41 |        830        0.07       57.88
        23.42 |      1,002        0.09       57.97
        23.43 |        891        0.08       58.05
        23.44 |        914        0.08       58.13
        23.45 |        865        0.08       58.21
        23.46 |        883        0.08       58.29
        23.47 |        884        0.08       58.37
        23.48 |        865        0.08       58.45
        23.49 |        946        0.09       58.53
         23.5 |        873        0.08       58.61
        23.51 |        934        0.08       58.70
        23.52 |        800        0.07       58.77
        23.53 |        952        0.09       58.85
        23.54 |        887        0.08       58.93
        23.55 |        847        0.08       59.01
        23.56 |        990        0.09       59.10
        23.57 |        810        0.07       59.17
        23.58 |        876        0.08       59.25
        23.59 |        912        0.08       59.33
         23.6 |        887        0.08       59.41
        23.61 |      1,080        0.10       59.51
        23.62 |        773        0.07       59.58
        23.63 |        922        0.08       59.66
        23.64 |        788        0.07       59.73
        23.65 |        820        0.07       59.81
        23.66 |        801        0.07       59.88
        23.67 |        831        0.07       59.95
        23.68 |        759        0.07       60.02
        23.69 |        893        0.08       60.10
         23.7 |        692        0.06       60.16
        23.71 |        929        0.08       60.25
        23.72 |        788        0.07       60.32
        23.73 |        939        0.08       60.40
        23.74 |        942        0.08       60.49
        23.75 |        785        0.07       60.56
        23.76 |        744        0.07       60.63
        23.77 |        912        0.08       60.71
        23.78 |        897        0.08       60.79
        23.79 |        746        0.07       60.86
         23.8 |        961        0.09       60.94
        23.81 |      1,088        0.10       61.04
        23.82 |        732        0.07       61.11
        23.83 |        900        0.08       61.19
        23.84 |        803        0.07       61.26
        23.85 |        855        0.08       61.34
        23.86 |        774        0.07       61.41
        23.87 |        799        0.07       61.48
        23.88 |        834        0.08       61.55
        23.89 |        827        0.07       61.63
         23.9 |        896        0.08       61.71
        23.91 |        804        0.07       61.78
        23.92 |        953        0.09       61.87
        23.93 |        861        0.08       61.94
        23.94 |        861        0.08       62.02
        23.95 |        970        0.09       62.11
        23.96 |        858        0.08       62.19
        23.97 |        763        0.07       62.25
        23.98 |        880        0.08       62.33
        23.99 |        864        0.08       62.41
           24 |        765        0.07       62.48
        24.01 |        913        0.08       62.56
        24.02 |        909        0.08       62.64
        24.03 |      1,058        0.10       62.74
        24.04 |        730        0.07       62.80
        24.05 |        701        0.06       62.87
        24.06 |        804        0.07       62.94
        24.07 |        825        0.07       63.01
        24.08 |        665        0.06       63.07
        24.09 |        921        0.08       63.16
         24.1 |        901        0.08       63.24
        24.11 |        830        0.07       63.31
        24.12 |        781        0.07       63.38
        24.13 |        929        0.08       63.47
        24.14 |        735        0.07       63.53
        24.15 |        878        0.08       63.61
        24.16 |        750        0.07       63.68
        24.17 |        811        0.07       63.75
        24.18 |        724        0.07       63.82
        24.19 |        787        0.07       63.89
         24.2 |        851        0.08       63.96
        24.21 |        775        0.07       64.03
        24.22 |        893        0.08       64.11
        24.23 |        788        0.07       64.19
        24.24 |        956        0.09       64.27
        24.25 |        780        0.07       64.34
        24.26 |        696        0.06       64.40
        24.27 |        733        0.07       64.47
        24.28 |        750        0.07       64.54
        24.29 |        824        0.07       64.61
         24.3 |        859        0.08       64.69
        24.31 |        800        0.07       64.76
        24.32 |        727        0.07       64.83
        24.33 |        799        0.07       64.90
        24.34 |        857        0.08       64.98
        24.35 |        937        0.08       65.06
        24.36 |        700        0.06       65.12
        24.37 |        711        0.06       65.19
        24.38 |        772        0.07       65.26
        24.39 |        779        0.07       65.33
         24.4 |        831        0.07       65.40
        24.41 |        809        0.07       65.47
        24.42 |        693        0.06       65.54
        24.43 |        689        0.06       65.60
        24.44 |        845        0.08       65.67
        24.45 |        748        0.07       65.74
        24.46 |        828        0.07       65.82
        24.47 |        748        0.07       65.88
        24.48 |        773        0.07       65.95
        24.49 |        829        0.07       66.03
         24.5 |        773        0.07       66.10
        24.51 |        721        0.06       66.16
        24.52 |        896        0.08       66.24
        24.53 |        713        0.06       66.31
        24.54 |        846        0.08       66.38
        24.55 |        752        0.07       66.45
        24.56 |        859        0.08       66.53
        24.57 |        696        0.06       66.59
        24.58 |        806        0.07       66.66
        24.59 |        661        0.06       66.72
         24.6 |        621        0.06       66.78
        24.61 |        788        0.07       66.85
        24.62 |        677        0.06       66.91
        24.63 |        701        0.06       66.97
        24.64 |        685        0.06       67.04
        24.65 |        822        0.07       67.11
        24.66 |        731        0.07       67.18
        24.67 |        704        0.06       67.24
        24.68 |        762        0.07       67.31
        24.69 |        721        0.06       67.37
         24.7 |        697        0.06       67.44
        24.71 |        820        0.07       67.51
        24.72 |        669        0.06       67.57
        24.73 |        701        0.06       67.63
        24.74 |        722        0.06       67.70
        24.75 |        758        0.07       67.77
        24.76 |        657        0.06       67.82
        24.77 |        977        0.09       67.91
        24.78 |        643        0.06       67.97
        24.79 |        671        0.06       68.03
         24.8 |        709        0.06       68.09
        24.81 |        721        0.06       68.16
        24.82 |        692        0.06       68.22
        24.83 |        669        0.06       68.28
        24.84 |        824        0.07       68.36
        24.85 |        623        0.06       68.41
        24.86 |        654        0.06       68.47
        24.87 |        669        0.06       68.53
        24.88 |        789        0.07       68.60
        24.89 |        663        0.06       68.66
         24.9 |        636        0.06       68.72
        24.91 |        712        0.06       68.78
        24.92 |        708        0.06       68.85
        24.93 |        608        0.05       68.90
        24.94 |        765        0.07       68.97
        24.95 |        563        0.05       69.02
        24.96 |        683        0.06       69.08
        24.97 |        784        0.07       69.15
        24.98 |        825        0.07       69.23
        24.99 |        563        0.05       69.28
           25 |        756        0.07       69.35
        25.01 |        659        0.06       69.41
        25.02 |        843        0.08       69.48
        25.03 |        593        0.05       69.53
        25.04 |        688        0.06       69.60
        25.05 |        561        0.05       69.65
        25.06 |        560        0.05       69.70
        25.07 |        689        0.06       69.76
        25.08 |        756        0.07       69.83
        25.09 |        580        0.05       69.88
         25.1 |        650        0.06       69.94
        25.11 |        658        0.06       70.00
        25.12 |        787        0.07       70.07
        25.13 |        674        0.06       70.13
        25.14 |        574        0.05       70.18
        25.15 |        670        0.06       70.24
        25.16 |        671        0.06       70.30
        25.17 |        689        0.06       70.36
        25.18 |        614        0.06       70.42
        25.19 |        587        0.05       70.47
         25.2 |        773        0.07       70.54
        25.21 |        676        0.06       70.60
        25.22 |        666        0.06       70.66
        25.23 |        604        0.05       70.72
        25.24 |        597        0.05       70.77
        25.25 |        557        0.05       70.82
        25.26 |        621        0.06       70.88
        25.27 |        575        0.05       70.93
        25.28 |        674        0.06       70.99
        25.29 |        668        0.06       71.05
         25.3 |        647        0.06       71.11
        25.31 |        651        0.06       71.16
        25.32 |        644        0.06       71.22
        25.33 |        689        0.06       71.28
        25.34 |        609        0.05       71.34
        25.35 |        722        0.06       71.40
        25.36 |        687        0.06       71.47
        25.37 |        668        0.06       71.53
        25.38 |        631        0.06       71.58
        25.39 |        791        0.07       71.65
         25.4 |        573        0.05       71.71
        25.41 |        636        0.06       71.76
        25.42 |        606        0.05       71.82
        25.43 |        543        0.05       71.87
        25.44 |        675        0.06       71.93
        25.45 |        641        0.06       71.99
        25.46 |        684        0.06       72.05
        25.47 |        599        0.05       72.10
        25.48 |        627        0.06       72.16
        25.49 |        636        0.06       72.21
         25.5 |        577        0.05       72.27
        25.51 |        706        0.06       72.33
        25.52 |        624        0.06       72.39
        25.53 |        675        0.06       72.45
        25.54 |        569        0.05       72.50
        25.55 |        593        0.05       72.55
        25.56 |        688        0.06       72.61
        25.57 |        662        0.06       72.67
        25.58 |        621        0.06       72.73
        25.59 |        654        0.06       72.79
         25.6 |        615        0.06       72.84
        25.61 |        636        0.06       72.90
        25.62 |        656        0.06       72.96
        25.63 |        683        0.06       73.02
        25.64 |        693        0.06       73.08
        25.65 |        601        0.05       73.14
        25.66 |        663        0.06       73.20
        25.67 |        618        0.06       73.25
        25.68 |        552        0.05       73.30
        25.69 |        529        0.05       73.35
         25.7 |        560        0.05       73.40
        25.71 |        756        0.07       73.47
        25.72 |        665        0.06       73.53
        25.73 |        585        0.05       73.58
        25.74 |        546        0.05       73.63
        25.75 |        583        0.05       73.68
        25.76 |        559        0.05       73.73
        25.77 |        528        0.05       73.78
        25.78 |        628        0.06       73.84
        25.79 |        533        0.05       73.88
         25.8 |        667        0.06       73.94
        25.81 |        672        0.06       74.00
        25.82 |        528        0.05       74.05
        25.83 |        569        0.05       74.10
        25.84 |        501        0.05       74.15
        25.85 |        616        0.06       74.20
        25.86 |        496        0.04       74.25
        25.87 |        558        0.05       74.30
        25.88 |        521        0.05       74.35
        25.89 |        622        0.06       74.40
         25.9 |        502        0.05       74.45
        25.91 |        745        0.07       74.51
        25.92 |        561        0.05       74.56
        25.93 |        528        0.05       74.61
        25.94 |        618        0.06       74.67
        25.95 |        540        0.05       74.72
        25.96 |        581        0.05       74.77
        25.97 |        663        0.06       74.83
        25.98 |        560        0.05       74.88
        25.99 |        575        0.05       74.93
           26 |        527        0.05       74.98
        26.01 |        497        0.04       75.02
        26.02 |        579        0.05       75.07
        26.03 |        579        0.05       75.13
        26.04 |        597        0.05       75.18
        26.05 |        499        0.04       75.23
        26.06 |        513        0.05       75.27
        26.07 |        614        0.06       75.33
        26.08 |        486        0.04       75.37
        26.09 |        517        0.05       75.42
         26.1 |        540        0.05       75.47
        26.11 |        515        0.05       75.51
        26.12 |        594        0.05       75.57
        26.13 |        586        0.05       75.62
        26.14 |        564        0.05       75.67
        26.15 |        551        0.05       75.72
        26.16 |        548        0.05       75.77
        26.17 |        591        0.05       75.82
        26.18 |        538        0.05       75.87
        26.19 |        501        0.05       75.91
         26.2 |        518        0.05       75.96
        26.21 |        448        0.04       76.00
        26.22 |        602        0.05       76.06
        26.23 |        598        0.05       76.11
        26.24 |        510        0.05       76.16
        26.25 |        566        0.05       76.21
        26.26 |        580        0.05       76.26
        26.27 |        530        0.05       76.31
        26.28 |        540        0.05       76.35
        26.29 |        413        0.04       76.39
         26.3 |        551        0.05       76.44
        26.31 |        592        0.05       76.49
        26.32 |        573        0.05       76.55
        26.33 |        443        0.04       76.59
        26.34 |        489        0.04       76.63
        26.35 |        546        0.05       76.68
        26.36 |        597        0.05       76.73
        26.37 |        597        0.05       76.79
        26.38 |        536        0.05       76.84
        26.39 |        475        0.04       76.88
         26.4 |        583        0.05       76.93
        26.41 |        427        0.04       76.97
        26.42 |        483        0.04       77.01
        26.43 |        487        0.04       77.06
        26.44 |        495        0.04       77.10
        26.45 |        517        0.05       77.15
        26.46 |        454        0.04       77.19
        26.47 |        412        0.04       77.22
        26.48 |        510        0.05       77.27
        26.49 |        601        0.05       77.32
         26.5 |        549        0.05       77.37
        26.51 |        454        0.04       77.42
        26.52 |        485        0.04       77.46
        26.53 |        555        0.05       77.51
        26.54 |        455        0.04       77.55
        26.55 |        603        0.05       77.60
        26.56 |        541        0.05       77.65
        26.57 |        522        0.05       77.70
        26.58 |        516        0.05       77.75
        26.59 |        609        0.05       77.80
         26.6 |        490        0.04       77.84
        26.61 |        584        0.05       77.90
        26.62 |        552        0.05       77.95
        26.63 |        529        0.05       77.99
        26.64 |        463        0.04       78.04
        26.65 |        498        0.04       78.08
        26.66 |        364        0.03       78.11
        26.67 |        686        0.06       78.18
        26.68 |        491        0.04       78.22
        26.69 |        540        0.05       78.27
         26.7 |        502        0.05       78.31
        26.71 |        560        0.05       78.36
        26.72 |        481        0.04       78.41
        26.73 |        394        0.04       78.44
        26.74 |        423        0.04       78.48
        26.75 |        501        0.05       78.53
        26.76 |        543        0.05       78.57
        26.77 |        427        0.04       78.61
        26.78 |        526        0.05       78.66
        26.79 |        417        0.04       78.70
         26.8 |        486        0.04       78.74
        26.81 |        493        0.04       78.79
        26.82 |        507        0.05       78.83
        26.83 |        452        0.04       78.87
        26.84 |        516        0.05       78.92
        26.85 |        478        0.04       78.96
        26.86 |        449        0.04       79.00
        26.87 |        546        0.05       79.05
        26.88 |        438        0.04       79.09
        26.89 |        446        0.04       79.13
         26.9 |        527        0.05       79.18
        26.91 |        562        0.05       79.23
        26.92 |        434        0.04       79.27
        26.93 |        457        0.04       79.31
        26.94 |        505        0.05       79.35
        26.95 |        431        0.04       79.39
        26.96 |        395        0.04       79.43
        26.97 |        444        0.04       79.47
        26.98 |        622        0.06       79.53
        26.99 |        541        0.05       79.57
           27 |        408        0.04       79.61
        27.01 |        573        0.05       79.66
        27.02 |        442        0.04       79.70
        27.03 |        538        0.05       79.75
        27.04 |        385        0.03       79.78
        27.05 |        413        0.04       79.82
        27.06 |        468        0.04       79.86
        27.07 |        390        0.04       79.90
        27.08 |        507        0.05       79.94
        27.09 |        378        0.03       79.98
         27.1 |        476        0.04       80.02
        27.11 |        445        0.04       80.06
        27.12 |        508        0.05       80.11
        27.13 |        413        0.04       80.14
        27.14 |        431        0.04       80.18
        27.15 |        476        0.04       80.23
        27.16 |        546        0.05       80.28
        27.17 |        403        0.04       80.31
        27.18 |        565        0.05       80.36
        27.19 |        417        0.04       80.40
         27.2 |        428        0.04       80.44
        27.21 |        515        0.05       80.48
        27.22 |        474        0.04       80.53
        27.23 |        478        0.04       80.57
        27.24 |        510        0.05       80.62
        27.25 |        477        0.04       80.66
        27.26 |        449        0.04       80.70
        27.27 |        436        0.04       80.74
        27.28 |        391        0.04       80.77
        27.29 |        458        0.04       80.82
         27.3 |        474        0.04       80.86
        27.31 |        432        0.04       80.90
        27.32 |        367        0.03       80.93
        27.33 |        452        0.04       80.97
        27.34 |        463        0.04       81.01
        27.35 |        422        0.04       81.05
        27.36 |        369        0.03       81.08
        27.37 |        483        0.04       81.13
        27.38 |        438        0.04       81.17
        27.39 |        407        0.04       81.20
         27.4 |        444        0.04       81.24
        27.41 |        469        0.04       81.29
        27.42 |        399        0.04       81.32
        27.43 |        426        0.04       81.36
        27.44 |        418        0.04       81.40
        27.45 |        436        0.04       81.44
        27.46 |        362        0.03       81.47
        27.47 |        385        0.03       81.50
        27.48 |        526        0.05       81.55
        27.49 |        368        0.03       81.58
         27.5 |        369        0.03       81.62
        27.51 |        533        0.05       81.67
        27.52 |        441        0.04       81.70
        27.53 |        388        0.03       81.74
        27.54 |        394        0.04       81.78
        27.55 |        423        0.04       81.81
        27.56 |        450        0.04       81.85
        27.57 |        337        0.03       81.88
        27.58 |        439        0.04       81.92
        27.59 |        437        0.04       81.96
         27.6 |        484        0.04       82.01
        27.61 |        434        0.04       82.05
        27.62 |        321        0.03       82.07
        27.63 |        415        0.04       82.11
        27.64 |        527        0.05       82.16
        27.65 |        354        0.03       82.19
        27.66 |        397        0.04       82.23
        27.67 |        425        0.04       82.27
        27.68 |        366        0.03       82.30
        27.69 |        349        0.03       82.33
         27.7 |        461        0.04       82.37
        27.71 |        407        0.04       82.41
        27.72 |        393        0.04       82.44
        27.73 |        512        0.05       82.49
        27.74 |        332        0.03       82.52
        27.75 |        372        0.03       82.55
        27.76 |        457        0.04       82.59
        27.77 |        414        0.04       82.63
        27.78 |        468        0.04       82.67
        27.79 |        361        0.03       82.71
         27.8 |        345        0.03       82.74
        27.81 |        422        0.04       82.77
        27.82 |        452        0.04       82.81
        27.83 |        433        0.04       82.85
        27.84 |        358        0.03       82.89
        27.85 |        488        0.04       82.93
        27.86 |        382        0.03       82.96
        27.87 |        373        0.03       83.00
        27.88 |        351        0.03       83.03
        27.89 |        476        0.04       83.07
         27.9 |        394        0.04       83.11
        27.91 |        340        0.03       83.14
        27.92 |        382        0.03       83.17
        27.93 |        418        0.04       83.21
        27.94 |        420        0.04       83.25
        27.95 |        378        0.03       83.28
        27.96 |        410        0.04       83.32
        27.97 |        453        0.04       83.36
        27.98 |        347        0.03       83.39
        27.99 |        381        0.03       83.43
           28 |        407        0.04       83.46
        28.01 |        370        0.03       83.50
        28.02 |        390        0.04       83.53
        28.03 |        313        0.03       83.56
        28.04 |        533        0.05       83.61
        28.05 |        400        0.04       83.64
        28.06 |        257        0.02       83.67
        28.07 |        351        0.03       83.70
        28.08 |        399        0.04       83.73
        28.09 |        341        0.03       83.76
         28.1 |        422        0.04       83.80
        28.11 |        341        0.03       83.83
        28.12 |        434        0.04       83.87
        28.13 |        440        0.04       83.91
        28.14 |        393        0.04       83.95
        28.15 |        362        0.03       83.98
        28.16 |        461        0.04       84.02
        28.17 |        398        0.04       84.06
        28.18 |        351        0.03       84.09
        28.19 |        327        0.03       84.12
         28.2 |        444        0.04       84.16
        28.21 |        386        0.03       84.19
        28.22 |        347        0.03       84.22
        28.23 |        278        0.03       84.25
        28.24 |        389        0.04       84.28
        28.25 |        343        0.03       84.31
        28.26 |        332        0.03       84.34
        28.27 |        314        0.03       84.37
        28.28 |        380        0.03       84.41
        28.29 |        366        0.03       84.44
         28.3 |        282        0.03       84.47
        28.31 |        342        0.03       84.50
        28.32 |        350        0.03       84.53
        28.33 |        320        0.03       84.56
        28.34 |        350        0.03       84.59
        28.35 |        317        0.03       84.62
        28.36 |        385        0.03       84.65
        28.37 |        339        0.03       84.68
        28.38 |        424        0.04       84.72
        28.39 |        345        0.03       84.75
         28.4 |        395        0.04       84.79
        28.41 |        375        0.03       84.82
        28.42 |        403        0.04       84.86
        28.43 |        282        0.03       84.88
        28.44 |        409        0.04       84.92
        28.45 |        341        0.03       84.95
        28.46 |        368        0.03       84.98
        28.47 |        304        0.03       85.01
        28.48 |        385        0.03       85.04
        28.49 |        352        0.03       85.08
         28.5 |        331        0.03       85.11
        28.51 |        301        0.03       85.13
        28.52 |        335        0.03       85.16
        28.53 |        352        0.03       85.19
        28.54 |        363        0.03       85.23
        28.55 |        377        0.03       85.26
        28.56 |        395        0.04       85.30
        28.57 |        355        0.03       85.33
        28.58 |        380        0.03       85.36
        28.59 |        343        0.03       85.39
         28.6 |        396        0.04       85.43
        28.61 |        321        0.03       85.46
        28.62 |        445        0.04       85.50
        28.63 |        269        0.02       85.52
        28.64 |        353        0.03       85.55
        28.65 |        334        0.03       85.58
        28.66 |        335        0.03       85.61
        28.67 |        440        0.04       85.65
        28.68 |        286        0.03       85.68
        28.69 |        351        0.03       85.71
         28.7 |        340        0.03       85.74
        28.71 |        346        0.03       85.77
        28.72 |        382        0.03       85.81
        28.73 |        286        0.03       85.83
        28.74 |        299        0.03       85.86
        28.75 |        252        0.02       85.88
        28.76 |        388        0.03       85.92
        28.77 |        375        0.03       85.95
        28.78 |        392        0.04       85.99
        28.79 |        295        0.03       86.01
         28.8 |        378        0.03       86.05
        28.81 |        355        0.03       86.08
        28.82 |        298        0.03       86.11
        28.83 |        337        0.03       86.14
        28.84 |        367        0.03       86.17
        28.85 |        320        0.03       86.20
        28.86 |        332        0.03       86.23
        28.87 |        277        0.02       86.25
        28.88 |        282        0.03       86.28
        28.89 |        323        0.03       86.31
         28.9 |        268        0.02       86.33
        28.91 |        446        0.04       86.37
        28.92 |        312        0.03       86.40
        28.93 |        337        0.03       86.43
        28.94 |        299        0.03       86.46
        28.95 |        327        0.03       86.49
        28.96 |        312        0.03       86.51
        28.97 |        302        0.03       86.54
        28.98 |        388        0.03       86.58
        28.99 |        309        0.03       86.60
           29 |        380        0.03       86.64
        29.01 |        330        0.03       86.67
        29.02 |        318        0.03       86.70
        29.03 |        307        0.03       86.72
        29.04 |        308        0.03       86.75
        29.05 |        326        0.03       86.78
        29.06 |        342        0.03       86.81
        29.07 |        316        0.03       86.84
        29.08 |        250        0.02       86.86
        29.09 |        376        0.03       86.90
         29.1 |        318        0.03       86.93
        29.11 |        343        0.03       86.96
        29.12 |        265        0.02       86.98
        29.13 |        312        0.03       87.01
        29.14 |        335        0.03       87.04
        29.15 |        289        0.03       87.06
        29.16 |        279        0.03       87.09
        29.17 |        340        0.03       87.12
        29.18 |        278        0.03       87.15
        29.19 |        315        0.03       87.17
         29.2 |        300        0.03       87.20
        29.21 |        307        0.03       87.23
        29.22 |        322        0.03       87.26
        29.23 |        260        0.02       87.28
        29.24 |        296        0.03       87.31
        29.25 |        305        0.03       87.33
        29.26 |        329        0.03       87.36
        29.27 |        236        0.02       87.39
        29.28 |        251        0.02       87.41
        29.29 |        295        0.03       87.43
         29.3 |        317        0.03       87.46
        29.31 |        275        0.02       87.49
        29.32 |        245        0.02       87.51
        29.33 |        370        0.03       87.54
        29.34 |        341        0.03       87.57
        29.35 |        297        0.03       87.60
        29.36 |        291        0.03       87.63
        29.37 |        313        0.03       87.66
        29.38 |        341        0.03       87.69
        29.39 |        245        0.02       87.71
         29.4 |        281        0.03       87.73
        29.41 |        307        0.03       87.76
        29.42 |        308        0.03       87.79
        29.43 |        287        0.03       87.81
        29.44 |        335        0.03       87.84
        29.45 |        301        0.03       87.87
        29.46 |        182        0.02       87.89
        29.47 |        255        0.02       87.91
        29.48 |        353        0.03       87.94
        29.49 |        253        0.02       87.97
         29.5 |        312        0.03       87.99
        29.51 |        290        0.03       88.02
        29.52 |        274        0.02       88.04
        29.53 |        298        0.03       88.07
        29.54 |        272        0.02       88.10
        29.55 |        267        0.02       88.12
        29.56 |        260        0.02       88.14
        29.57 |        302        0.03       88.17
        29.58 |        348        0.03       88.20
        29.59 |        235        0.02       88.22
         29.6 |        269        0.02       88.25
        29.61 |        288        0.03       88.27
        29.62 |        321        0.03       88.30
        29.63 |        284        0.03       88.33
        29.64 |        268        0.02       88.35
        29.65 |        289        0.03       88.38
        29.66 |        336        0.03       88.41
        29.67 |        249        0.02       88.43
        29.68 |        240        0.02       88.45
        29.69 |        381        0.03       88.49
         29.7 |        235        0.02       88.51
        29.71 |        272        0.02       88.53
        29.72 |        340        0.03       88.56
        29.73 |        279        0.03       88.59
        29.74 |        335        0.03       88.62
        29.75 |        224        0.02       88.64
        29.76 |        281        0.03       88.66
        29.77 |        239        0.02       88.68
        29.78 |        242        0.02       88.71
        29.79 |        297        0.03       88.73
         29.8 |        314        0.03       88.76
        29.81 |        200        0.02       88.78
        29.82 |        261        0.02       88.80
        29.83 |        273        0.02       88.83
        29.84 |        215        0.02       88.85
        29.85 |        224        0.02       88.87
        29.86 |        224        0.02       88.89
        29.87 |        241        0.02       88.91
        29.88 |        211        0.02       88.93
        29.89 |        239        0.02       88.95
         29.9 |        349        0.03       88.98
        29.91 |        262        0.02       89.00
        29.92 |        227        0.02       89.02
        29.93 |        286        0.03       89.05
        29.94 |        303        0.03       89.08
        29.95 |        280        0.03       89.10
        29.96 |        241        0.02       89.12
        29.97 |        284        0.03       89.15
        29.98 |        236        0.02       89.17
        29.99 |        248        0.02       89.19
           30 |        272        0.02       89.22
        30.01 |        296        0.03       89.24
        30.02 |        254        0.02       89.27
        30.03 |        245        0.02       89.29
        30.04 |        287        0.03       89.32
        30.05 |        293        0.03       89.34
        30.06 |        218        0.02       89.36
        30.07 |        237        0.02       89.38
        30.08 |        362        0.03       89.42
        30.09 |        270        0.02       89.44
         30.1 |        237        0.02       89.46
        30.11 |        224        0.02       89.48
        30.12 |        289        0.03       89.51
        30.13 |        261        0.02       89.53
        30.14 |        280        0.03       89.56
        30.15 |        290        0.03       89.58
        30.16 |        236        0.02       89.60
        30.17 |        247        0.02       89.63
        30.18 |        286        0.03       89.65
        30.19 |        325        0.03       89.68
         30.2 |        262        0.02       89.70
        30.21 |        261        0.02       89.73
        30.22 |        275        0.02       89.75
        30.23 |        280        0.03       89.78
        30.24 |        175        0.02       89.79
        30.25 |        247        0.02       89.82
        30.26 |        285        0.03       89.84
        30.27 |        304        0.03       89.87
        30.28 |        245        0.02       89.89
        30.29 |        252        0.02       89.91
         30.3 |        301        0.03       89.94
        30.31 |        152        0.01       89.95
        30.32 |        217        0.02       89.97
        30.33 |        250        0.02       90.00
        30.34 |        265        0.02       90.02
        30.35 |        258        0.02       90.04
        30.36 |        249        0.02       90.07
        30.37 |        285        0.03       90.09
        30.38 |        244        0.02       90.11
        30.39 |        233        0.02       90.13
         30.4 |        215        0.02       90.15
        30.41 |        285        0.03       90.18
        30.42 |        185        0.02       90.20
        30.43 |        184        0.02       90.21
        30.44 |        281        0.03       90.24
        30.45 |        276        0.02       90.26
        30.46 |        244        0.02       90.28
        30.47 |        289        0.03       90.31
        30.48 |        253        0.02       90.33
        30.49 |        303        0.03       90.36
         30.5 |        183        0.02       90.38
        30.51 |        254        0.02       90.40
        30.52 |        293        0.03       90.43
        30.53 |        183        0.02       90.44
        30.54 |        233        0.02       90.46
        30.55 |        234        0.02       90.48
        30.56 |        265        0.02       90.51
        30.57 |        227        0.02       90.53
        30.58 |        173        0.02       90.54
        30.59 |        217        0.02       90.56
         30.6 |        262        0.02       90.59
        30.61 |        134        0.01       90.60
        30.62 |        180        0.02       90.62
        30.63 |        331        0.03       90.65
        30.64 |        261        0.02       90.67
        30.65 |        202        0.02       90.69
        30.66 |        196        0.02       90.70
        30.67 |        371        0.03       90.74
        30.68 |        155        0.01       90.75
        30.69 |        165        0.01       90.77
         30.7 |        231        0.02       90.79
        30.71 |        238        0.02       90.81
        30.72 |        176        0.02       90.82
        30.73 |        190        0.02       90.84
        30.74 |        296        0.03       90.87
        30.75 |        257        0.02       90.89
        30.76 |        195        0.02       90.91
        30.77 |        207        0.02       90.93
        30.78 |        248        0.02       90.95
        30.79 |        247        0.02       90.97
         30.8 |        218        0.02       90.99
        30.81 |        180        0.02       91.01
        30.82 |        306        0.03       91.04
        30.83 |        195        0.02       91.05
        30.84 |        224        0.02       91.07
        30.85 |        278        0.03       91.10
        30.86 |        345        0.03       91.13
        30.87 |        182        0.02       91.15
        30.88 |        157        0.01       91.16
        30.89 |        240        0.02       91.18
         30.9 |        358        0.03       91.21
        30.91 |        169        0.02       91.23
        30.92 |        183        0.02       91.25
        30.93 |        245        0.02       91.27
        30.94 |        257        0.02       91.29
        30.95 |        176        0.02       91.31
        30.96 |        158        0.01       91.32
        30.97 |        256        0.02       91.34
        30.98 |        305        0.03       91.37
        30.99 |        134        0.01       91.38
           31 |        211        0.02       91.40
        31.01 |        220        0.02       91.42
        31.02 |        253        0.02       91.44
        31.03 |        163        0.01       91.46
        31.04 |        226        0.02       91.48
        31.05 |        261        0.02       91.50
        31.06 |        189        0.02       91.52
        31.07 |        199        0.02       91.54
        31.08 |        162        0.01       91.55
        31.09 |        272        0.02       91.58
         31.1 |        147        0.01       91.59
        31.11 |        208        0.02       91.61
        31.12 |        195        0.02       91.63
        31.13 |        320        0.03       91.66
        31.14 |        188        0.02       91.67
        31.15 |        200        0.02       91.69
        31.16 |        218        0.02       91.71
        31.17 |        340        0.03       91.74
        31.18 |        157        0.01       91.75
        31.19 |        220        0.02       91.77
         31.2 |        227        0.02       91.80
        31.21 |        349        0.03       91.83
        31.22 |        147        0.01       91.84
        31.23 |        192        0.02       91.86
        31.24 |        223        0.02       91.88
        31.25 |        345        0.03       91.91
        31.26 |        162        0.01       91.92
        31.27 |        179        0.02       91.94
        31.28 |        227        0.02       91.96
        31.29 |        293        0.03       91.99
         31.3 |        137        0.01       92.00
        31.31 |        182        0.02       92.01
        31.32 |        208        0.02       92.03
        31.33 |        315        0.03       92.06
        31.34 |        193        0.02       92.08
        31.35 |        174        0.02       92.09
        31.36 |        231        0.02       92.12
        31.37 |        191        0.02       92.13
        31.38 |        146        0.01       92.15
        31.39 |        124        0.01       92.16
         31.4 |        240        0.02       92.18
        31.41 |        195        0.02       92.20
        31.42 |        167        0.02       92.21
        31.43 |        183        0.02       92.23
        31.44 |        223        0.02       92.25
        31.45 |        223        0.02       92.27
        31.46 |        167        0.02       92.28
        31.47 |        202        0.02       92.30
        31.48 |        230        0.02       92.32
        31.49 |        169        0.02       92.34
         31.5 |        115        0.01       92.35
        31.51 |        161        0.01       92.36
        31.52 |        254        0.02       92.38
        31.53 |        219        0.02       92.40
        31.54 |        149        0.01       92.42
        31.55 |        168        0.02       92.43
        31.56 |        295        0.03       92.46
        31.57 |        202        0.02       92.48
        31.58 |        141        0.01       92.49
        31.59 |        144        0.01       92.50
         31.6 |        308        0.03       92.53
        31.61 |        187        0.02       92.55
        31.62 |        185        0.02       92.56
        31.63 |        188        0.02       92.58
        31.64 |        315        0.03       92.61
        31.65 |        186        0.02       92.63
        31.66 |        150        0.01       92.64
        31.67 |        198        0.02       92.66
        31.68 |        305        0.03       92.68
        31.69 |        203        0.02       92.70
         31.7 |        176        0.02       92.72
        31.71 |        190        0.02       92.74
        31.72 |        267        0.02       92.76
        31.73 |        197        0.02       92.78
        31.74 |        190        0.02       92.79
        31.75 |        170        0.02       92.81
        31.76 |        308        0.03       92.84
        31.77 |        154        0.01       92.85
        31.78 |        113        0.01       92.86
        31.79 |        191        0.02       92.88
         31.8 |        265        0.02       92.90
        31.81 |        186        0.02       92.92
        31.82 |        113        0.01       92.93
        31.83 |        180        0.02       92.95
        31.84 |        182        0.02       92.96
        31.85 |        232        0.02       92.98
        31.86 |        122        0.01       92.99
        31.87 |        168        0.02       93.01
        31.88 |        236        0.02       93.03
        31.89 |        181        0.02       93.05
         31.9 |        112        0.01       93.06
        31.91 |        153        0.01       93.07
        31.92 |        216        0.02       93.09
        31.93 |        257        0.02       93.11
        31.94 |        140        0.01       93.13
        31.95 |        143        0.01       93.14
        31.96 |        219        0.02       93.16
        31.97 |        251        0.02       93.18
        31.98 |        155        0.01       93.20
        31.99 |        143        0.01       93.21
           32 |        188        0.02       93.22
        32.01 |        349        0.03       93.26
        32.02 |        112        0.01       93.27
        32.03 |        128        0.01       93.28
        32.04 |        138        0.01       93.29
        32.05 |        316        0.03       93.32
        32.06 |        120        0.01       93.33
        32.07 |        100        0.01       93.34
        32.08 |        194        0.02       93.36
        32.09 |        336        0.03       93.39
         32.1 |         90        0.01       93.39
        32.11 |         99        0.01       93.40
        32.12 |        144        0.01       93.42
        32.13 |        269        0.02       93.44
        32.14 |         84        0.01       93.45
        32.15 |        115        0.01       93.46
        32.16 |        172        0.02       93.47
        32.17 |        284        0.03       93.50
        32.18 |         87        0.01       93.51
        32.19 |         74        0.01       93.51
         32.2 |        137        0.01       93.53
        32.21 |        196        0.02       93.54
        32.22 |        186        0.02       93.56
        32.23 |        109        0.01       93.57
        32.24 |        128        0.01       93.58
        32.25 |        207        0.02       93.60
        32.26 |        191        0.02       93.62
        32.27 |        118        0.01       93.63
        32.28 |        135        0.01       93.64
        32.29 |        175        0.02       93.66
         32.3 |        246        0.02       93.68
        32.31 |        100        0.01       93.69
        32.32 |        134        0.01       93.70
        32.33 |        202        0.02       93.72
        32.34 |        260        0.02       93.74
        32.35 |        107        0.01       93.75
        32.36 |        145        0.01       93.76
        32.37 |        167        0.02       93.78
        32.38 |        223        0.02       93.80
        32.39 |        146        0.01       93.81
         32.4 |        158        0.01       93.83
        32.41 |        195        0.02       93.84
        32.42 |        284        0.03       93.87
        32.43 |        178        0.02       93.89
        32.44 |        145        0.01       93.90
        32.45 |        170        0.02       93.91
        32.46 |        282        0.03       93.94
        32.47 |        201        0.02       93.96
        32.48 |        116        0.01       93.97
        32.49 |        137        0.01       93.98
         32.5 |        184        0.02       94.00
        32.51 |        284        0.03       94.02
        32.52 |        125        0.01       94.03
        32.53 |         92        0.01       94.04
        32.54 |        163        0.01       94.06
        32.55 |        234        0.02       94.08
        32.56 |        121        0.01       94.09
        32.57 |        140        0.01       94.10
        32.58 |        147        0.01       94.11
        32.59 |        302        0.03       94.14
         32.6 |         87        0.01       94.15
        32.61 |        111        0.01       94.16
        32.62 |        122        0.01       94.17
        32.63 |        183        0.02       94.19
        32.64 |        150        0.01       94.20
        32.65 |        115        0.01       94.21
        32.66 |        125        0.01       94.22
        32.67 |        161        0.01       94.24
        32.68 |        212        0.02       94.25
        32.69 |        119        0.01       94.27
         32.7 |        137        0.01       94.28
        32.71 |        137        0.01       94.29
        32.72 |        244        0.02       94.31
        32.73 |        108        0.01       94.32
        32.74 |        100        0.01       94.33
        32.75 |         79        0.01       94.34
        32.76 |        246        0.02       94.36
        32.77 |        113        0.01       94.37
        32.78 |        115        0.01       94.38
        32.79 |         88        0.01       94.39
         32.8 |        177        0.02       94.40
        32.81 |        248        0.02       94.43
        32.82 |        112        0.01       94.44
        32.83 |        181        0.02       94.45
        32.84 |        177        0.02       94.47
        32.85 |        203        0.02       94.49
        32.86 |        106        0.01       94.50
        32.87 |        157        0.01       94.51
        32.88 |        146        0.01       94.52
        32.89 |        233        0.02       94.55
         32.9 |        102        0.01       94.55
        32.91 |        112        0.01       94.56
        32.92 |        110        0.01       94.57
        32.93 |        175        0.02       94.59
        32.94 |        158        0.01       94.60
        32.95 |        132        0.01       94.62
        32.96 |        119        0.01       94.63
        32.97 |        167        0.02       94.64
        32.98 |        205        0.02       94.66
        32.99 |         83        0.01       94.67
           33 |        158        0.01       94.68
        33.01 |        177        0.02       94.70
        33.02 |        225        0.02       94.72
        33.03 |         76        0.01       94.73
        33.04 |        109        0.01       94.74
        33.05 |        131        0.01       94.75
        33.06 |        155        0.01       94.76
        33.07 |        151        0.01       94.77
        33.08 |         92        0.01       94.78
        33.09 |        132        0.01       94.79
         33.1 |        173        0.02       94.81
        33.11 |        221        0.02       94.83
        33.12 |         94        0.01       94.84
        33.13 |        100        0.01       94.85
        33.14 |        125        0.01       94.86
        33.15 |        219        0.02       94.88
        33.16 |        148        0.01       94.89
        33.17 |        106        0.01       94.90
        33.18 |        141        0.01       94.91
        33.19 |        122        0.01       94.92
         33.2 |        242        0.02       94.95
        33.21 |         95        0.01       94.96
        33.22 |        135        0.01       94.97
        33.23 |        113        0.01       94.98
        33.24 |        225        0.02       95.00
        33.25 |        128        0.01       95.01
        33.26 |        120        0.01       95.02
        33.27 |        129        0.01       95.03
        33.28 |        120        0.01       95.04
        33.29 |        145        0.01       95.06
         33.3 |        117        0.01       95.07
        33.31 |        135        0.01       95.08
        33.32 |        122        0.01       95.09
        33.33 |        234        0.02       95.11
        33.34 |        114        0.01       95.12
        33.35 |        132        0.01       95.13
        33.36 |        113        0.01       95.14
        33.37 |        134        0.01       95.15
        33.38 |        145        0.01       95.17
        33.39 |         85        0.01       95.18
         33.4 |        113        0.01       95.19
        33.41 |        138        0.01       95.20
        33.42 |        195        0.02       95.22
        33.43 |        109        0.01       95.23
        33.44 |        108        0.01       95.24
        33.45 |         89        0.01       95.24
        33.46 |        131        0.01       95.25
        33.47 |        117        0.01       95.27
        33.48 |         59        0.01       95.27
        33.49 |        107        0.01       95.28
         33.5 |        141        0.01       95.29
        33.51 |        175        0.02       95.31
        33.52 |         93        0.01       95.32
        33.53 |        119        0.01       95.33
        33.54 |        103        0.01       95.34
        33.55 |        165        0.01       95.35
        33.56 |        168        0.02       95.37
        33.57 |         82        0.01       95.37
        33.58 |        102        0.01       95.38
        33.59 |        158        0.01       95.40
         33.6 |        201        0.02       95.42
        33.61 |         84        0.01       95.42
        33.62 |        100        0.01       95.43
        33.63 |        148        0.01       95.45
        33.64 |        137        0.01       95.46
        33.65 |        134        0.01       95.47
        33.66 |         61        0.01       95.48
        33.67 |        143        0.01       95.49
        33.68 |        100        0.01       95.50
        33.69 |        221        0.02       95.52
         33.7 |         92        0.01       95.53
        33.71 |        119        0.01       95.54
        33.72 |        136        0.01       95.55
        33.73 |        193        0.02       95.57
        33.74 |        123        0.01       95.58
        33.75 |         97        0.01       95.59
        33.76 |        119        0.01       95.60
        33.77 |        177        0.02       95.61
        33.78 |        169        0.02       95.63
        33.79 |        116        0.01       95.64
         33.8 |        112        0.01       95.65
        33.81 |        103        0.01       95.66
        33.82 |        110        0.01       95.67
        33.83 |        118        0.01       95.68
        33.84 |         62        0.01       95.68
        33.85 |        102        0.01       95.69
        33.86 |        138        0.01       95.71
        33.87 |        161        0.01       95.72
        33.88 |         71        0.01       95.73
        33.89 |         95        0.01       95.73
         33.9 |         87        0.01       95.74
        33.91 |        100        0.01       95.75
        33.92 |         94        0.01       95.76
        33.93 |        123        0.01       95.77
        33.94 |         83        0.01       95.78
        33.95 |        102        0.01       95.79
        33.96 |        150        0.01       95.80
        33.97 |        181        0.02       95.82
        33.98 |         95        0.01       95.83
        33.99 |         74        0.01       95.83
           34 |        107        0.01       95.84
        34.01 |        132        0.01       95.85
        34.02 |        110        0.01       95.86
        34.03 |        145        0.01       95.88
        34.04 |        122        0.01       95.89
        34.05 |        142        0.01       95.90
        34.06 |        124        0.01       95.91
        34.07 |         74        0.01       95.92
        34.08 |        106        0.01       95.93
        34.09 |        113        0.01       95.94
         34.1 |         76        0.01       95.95
        34.11 |        121        0.01       95.96
        34.12 |        145        0.01       95.97
        34.13 |        102        0.01       95.98
        34.14 |        109        0.01       95.99
        34.15 |        175        0.02       96.00
        34.16 |         87        0.01       96.01
        34.17 |        114        0.01       96.02
        34.18 |         91        0.01       96.03
        34.19 |        107        0.01       96.04
         34.2 |        110        0.01       96.05
        34.21 |         93        0.01       96.06
        34.22 |        124        0.01       96.07
        34.23 |        143        0.01       96.08
        34.24 |        121        0.01       96.09
        34.25 |        106        0.01       96.10
        34.26 |         74        0.01       96.11
        34.27 |         74        0.01       96.12
        34.28 |        118        0.01       96.13
        34.29 |        131        0.01       96.14
         34.3 |         70        0.01       96.14
        34.31 |         86        0.01       96.15
        34.32 |         93        0.01       96.16
        34.33 |        118        0.01       96.17
        34.34 |        105        0.01       96.18
        34.35 |         52        0.00       96.19
        34.36 |        117        0.01       96.20
        34.37 |         94        0.01       96.20
        34.38 |        108        0.01       96.21
        34.39 |         91        0.01       96.22
         34.4 |        114        0.01       96.23
        34.41 |        128        0.01       96.24
        34.42 |        155        0.01       96.26
        34.43 |        132        0.01       96.27
        34.44 |        116        0.01       96.28
        34.45 |        128        0.01       96.29
        34.46 |         94        0.01       96.30
        34.47 |         71        0.01       96.31
        34.48 |        138        0.01       96.32
        34.49 |        107        0.01       96.33
         34.5 |         60        0.01       96.33
        34.51 |         52        0.00       96.34
        34.52 |         94        0.01       96.35
        34.53 |        112        0.01       96.36
        34.54 |        107        0.01       96.37
        34.55 |         78        0.01       96.37
        34.56 |         93        0.01       96.38
        34.57 |        116        0.01       96.39
        34.58 |        146        0.01       96.41
        34.59 |         93        0.01       96.41
         34.6 |        117        0.01       96.42
        34.61 |         94        0.01       96.43
        34.62 |        111        0.01       96.44
        34.63 |        101        0.01       96.45
        34.64 |         91        0.01       96.46
        34.65 |        116        0.01       96.47
        34.66 |         72        0.01       96.48
        34.67 |        127        0.01       96.49
        34.68 |        126        0.01       96.50
        34.69 |        113        0.01       96.51
         34.7 |        107        0.01       96.52
        34.71 |         94        0.01       96.53
        34.72 |        124        0.01       96.54
        34.73 |         86        0.01       96.55
        34.74 |         79        0.01       96.55
        34.75 |        112        0.01       96.56
        34.76 |         93        0.01       96.57
        34.77 |        128        0.01       96.58
        34.78 |         57        0.01       96.59
        34.79 |        118        0.01       96.60
         34.8 |         91        0.01       96.61
        34.81 |        107        0.01       96.62
        34.82 |         72        0.01       96.62
        34.83 |        131        0.01       96.64
        34.84 |        110        0.01       96.65
        34.85 |         47        0.00       96.65
        34.86 |        108        0.01       96.66
        34.87 |         70        0.01       96.67
        34.88 |         65        0.01       96.67
        34.89 |        102        0.01       96.68
         34.9 |         66        0.01       96.69
        34.91 |         68        0.01       96.69
        34.92 |        123        0.01       96.70
        34.93 |         92        0.01       96.71
        34.94 |         78        0.01       96.72
        34.95 |        106        0.01       96.73
        34.96 |        128        0.01       96.74
        34.97 |         89        0.01       96.75
        34.98 |         99        0.01       96.76
        34.99 |         76        0.01       96.76
           35 |         83        0.01       96.77
        35.01 |         76        0.01       96.78
        35.02 |         73        0.01       96.79
        35.03 |         85        0.01       96.79
        35.04 |         84        0.01       96.80
        35.05 |         82        0.01       96.81
        35.06 |         65        0.01       96.81
        35.07 |         80        0.01       96.82
        35.08 |         97        0.01       96.83
        35.09 |         76        0.01       96.84
         35.1 |         72        0.01       96.84
        35.11 |         70        0.01       96.85
        35.12 |        108        0.01       96.86
        35.13 |         68        0.01       96.87
        35.14 |         80        0.01       96.87
        35.15 |         86        0.01       96.88
        35.16 |        122        0.01       96.89
        35.17 |         94        0.01       96.90
        35.18 |         82        0.01       96.91
        35.19 |         95        0.01       96.92
         35.2 |        113        0.01       96.93
        35.21 |         46        0.00       96.93
        35.22 |         96        0.01       96.94
        35.23 |         78        0.01       96.95
        35.24 |        109        0.01       96.96
        35.25 |         91        0.01       96.96
        35.26 |        115        0.01       96.97
        35.27 |         95        0.01       96.98
        35.28 |        105        0.01       96.99
        35.29 |         83        0.01       97.00
         35.3 |         98        0.01       97.01
        35.31 |         93        0.01       97.02
        35.32 |         93        0.01       97.03
        35.33 |         92        0.01       97.03
        35.34 |         82        0.01       97.04
        35.35 |         81        0.01       97.05
        35.36 |        116        0.01       97.06
        35.37 |         62        0.01       97.06
        35.38 |        115        0.01       97.07
        35.39 |         80        0.01       97.08
         35.4 |        104        0.01       97.09
        35.41 |        100        0.01       97.10
        35.42 |         98        0.01       97.11
        35.43 |         96        0.01       97.12
        35.44 |         55        0.00       97.12
        35.45 |         76        0.01       97.13
        35.46 |        110        0.01       97.14
        35.47 |        102        0.01       97.15
        35.48 |        132        0.01       97.16
        35.49 |         68        0.01       97.17
         35.5 |         70        0.01       97.17
        35.51 |         76        0.01       97.18
        35.52 |         89        0.01       97.19
        35.53 |         72        0.01       97.19
        35.54 |         75        0.01       97.20
        35.55 |         76        0.01       97.21
        35.56 |        109        0.01       97.22
        35.57 |         95        0.01       97.23
        35.58 |         79        0.01       97.23
        35.59 |         46        0.00       97.24
         35.6 |         82        0.01       97.24
        35.61 |         79        0.01       97.25
        35.62 |         54        0.00       97.26
        35.63 |         86        0.01       97.26
        35.64 |        106        0.01       97.27
        35.65 |         72        0.01       97.28
        35.66 |         85        0.01       97.29
        35.67 |         68        0.01       97.29
        35.68 |         75        0.01       97.30
        35.69 |         64        0.01       97.31
         35.7 |         81        0.01       97.31
        35.71 |         93        0.01       97.32
        35.72 |         68        0.01       97.33
        35.73 |         90        0.01       97.34
        35.74 |         91        0.01       97.34
        35.75 |         63        0.01       97.35
        35.76 |         82        0.01       97.36
        35.77 |        100        0.01       97.37
        35.78 |         91        0.01       97.37
        35.79 |         88        0.01       97.38
         35.8 |         83        0.01       97.39
        35.81 |        101        0.01       97.40
        35.82 |         81        0.01       97.41
        35.83 |         49        0.00       97.41
        35.84 |         78        0.01       97.42
        35.85 |         80        0.01       97.43
        35.86 |         77        0.01       97.43
        35.87 |         63        0.01       97.44
        35.88 |         64        0.01       97.44
        35.89 |         75        0.01       97.45
         35.9 |         48        0.00       97.45
        35.91 |         39        0.00       97.46
        35.92 |         75        0.01       97.46
        35.93 |         96        0.01       97.47
        35.94 |         69        0.01       97.48
        35.95 |         35        0.00       97.48
        35.96 |         88        0.01       97.49
        35.97 |         71        0.01       97.50
        35.98 |        109        0.01       97.51
        35.99 |         82        0.01       97.51
           36 |         81        0.01       97.52
        36.01 |         80        0.01       97.53
        36.02 |         57        0.01       97.53
        36.03 |         72        0.01       97.54
        36.04 |         63        0.01       97.55
        36.05 |         64        0.01       97.55
        36.06 |         66        0.01       97.56
        36.07 |         75        0.01       97.56
        36.08 |         42        0.00       97.57
        36.09 |         70        0.01       97.57
         36.1 |         66        0.01       97.58
        36.11 |         80        0.01       97.59
        36.12 |         64        0.01       97.59
        36.13 |         91        0.01       97.60
        36.14 |         59        0.01       97.61
        36.15 |         54        0.00       97.61
        36.16 |         99        0.01       97.62
        36.17 |         49        0.00       97.63
        36.18 |         61        0.01       97.63
        36.19 |         71        0.01       97.64
         36.2 |         79        0.01       97.64
        36.21 |         57        0.01       97.65
        36.22 |         44        0.00       97.65
        36.23 |         49        0.00       97.66
        36.24 |         46        0.00       97.66
        36.25 |         29        0.00       97.66
        36.26 |         54        0.00       97.67
        36.27 |         36        0.00       97.67
        36.28 |         52        0.00       97.68
        36.29 |         87        0.01       97.69
         36.3 |         80        0.01       97.69
        36.31 |         73        0.01       97.70
        36.32 |         98        0.01       97.71
        36.33 |         72        0.01       97.71
        36.34 |         68        0.01       97.72
        36.35 |         56        0.01       97.73
        36.36 |         62        0.01       97.73
        36.37 |         57        0.01       97.74
        36.38 |         92        0.01       97.74
        36.39 |         61        0.01       97.75
         36.4 |         55        0.00       97.75
        36.41 |         91        0.01       97.76
        36.42 |         61        0.01       97.77
        36.43 |         48        0.00       97.77
        36.44 |         58        0.01       97.78
        36.45 |         73        0.01       97.78
        36.46 |         80        0.01       97.79
        36.47 |         63        0.01       97.80
        36.48 |         82        0.01       97.80
        36.49 |         36        0.00       97.81
         36.5 |         49        0.00       97.81
        36.51 |         67        0.01       97.82
        36.52 |         47        0.00       97.82
        36.53 |         70        0.01       97.83
        36.54 |         66        0.01       97.83
        36.55 |         56        0.01       97.84
        36.56 |         92        0.01       97.85
        36.57 |         46        0.00       97.85
        36.58 |         46        0.00       97.86
        36.59 |         53        0.00       97.86
         36.6 |         52        0.00       97.87
        36.61 |         47        0.00       97.87
        36.62 |         50        0.00       97.87
        36.63 |         79        0.01       97.88
        36.64 |         84        0.01       97.89
        36.65 |         72        0.01       97.90
        36.66 |         52        0.00       97.90
        36.67 |         33        0.00       97.90
        36.68 |         58        0.01       97.91
        36.69 |         45        0.00       97.91
         36.7 |         71        0.01       97.92
        36.71 |         63        0.01       97.92
        36.72 |         76        0.01       97.93
        36.73 |         35        0.00       97.93
        36.74 |         46        0.00       97.94
        36.75 |         27        0.00       97.94
        36.76 |         47        0.00       97.95
        36.77 |         56        0.01       97.95
        36.78 |         62        0.01       97.96
        36.79 |         46        0.00       97.96
         36.8 |         37        0.00       97.96
        36.81 |         38        0.00       97.97
        36.82 |         50        0.00       97.97
        36.83 |         62        0.01       97.98
        36.84 |         51        0.00       97.98
        36.85 |         76        0.01       97.99
        36.86 |         71        0.01       97.99
        36.87 |         64        0.01       98.00
        36.88 |         45        0.00       98.00
        36.89 |         51        0.00       98.01
         36.9 |         41        0.00       98.01
        36.91 |         68        0.01       98.02
        36.92 |         55        0.00       98.02
        36.93 |         35        0.00       98.03
        36.94 |         61        0.01       98.03
        36.95 |         64        0.01       98.04
        36.96 |         40        0.00       98.04
        36.97 |         72        0.01       98.05
        36.98 |         92        0.01       98.06
        36.99 |         78        0.01       98.06
           37 |         67        0.01       98.07
        37.01 |         57        0.01       98.08
        37.02 |         61        0.01       98.08
        37.03 |         55        0.00       98.09
        37.04 |         35        0.00       98.09
        37.05 |         62        0.01       98.09
        37.06 |         75        0.01       98.10
        37.07 |         64        0.01       98.11
        37.08 |         38        0.00       98.11
        37.09 |         77        0.01       98.12
         37.1 |         39        0.00       98.12
        37.11 |         84        0.01       98.13
        37.12 |         56        0.01       98.13
        37.13 |         47        0.00       98.14
        37.14 |         43        0.00       98.14
        37.15 |         71        0.01       98.15
        37.16 |         53        0.00       98.15
        37.17 |         54        0.00       98.16
        37.18 |         46        0.00       98.16
        37.19 |         35        0.00       98.16
         37.2 |         33        0.00       98.17
        37.21 |         40        0.00       98.17
        37.22 |         80        0.01       98.18
        37.23 |         22        0.00       98.18
        37.24 |         33        0.00       98.18
        37.25 |         63        0.01       98.19
        37.26 |         64        0.01       98.19
        37.27 |         43        0.00       98.20
        37.28 |         70        0.01       98.20
        37.29 |         61        0.01       98.21
         37.3 |         48        0.00       98.21
        37.31 |         54        0.00       98.22
        37.32 |         59        0.01       98.22
        37.33 |         67        0.01       98.23
        37.34 |         43        0.00       98.23
        37.35 |         46        0.00       98.24
        37.36 |         53        0.00       98.24
        37.37 |         53        0.00       98.25
        37.38 |         54        0.00       98.25
        37.39 |         33        0.00       98.26
         37.4 |         36        0.00       98.26
        37.41 |         56        0.01       98.26
        37.42 |         61        0.01       98.27
        37.43 |         49        0.00       98.27
        37.44 |         75        0.01       98.28
        37.45 |         58        0.01       98.29
        37.46 |         22        0.00       98.29
        37.47 |         48        0.00       98.29
        37.48 |         55        0.00       98.30
        37.49 |         37        0.00       98.30
         37.5 |         72        0.01       98.31
        37.51 |         19        0.00       98.31
        37.52 |         51        0.00       98.31
        37.53 |         32        0.00       98.32
        37.54 |         32        0.00       98.32
        37.55 |         62        0.01       98.33
        37.56 |         40        0.00       98.33
        37.57 |         45        0.00       98.33
        37.58 |         77        0.01       98.34
        37.59 |         48        0.00       98.34
         37.6 |         47        0.00       98.35
        37.61 |         36        0.00       98.35
        37.62 |         39        0.00       98.36
        37.63 |         43        0.00       98.36
        37.64 |         54        0.00       98.36
        37.65 |         43        0.00       98.37
        37.66 |         37        0.00       98.37
        37.67 |         36        0.00       98.37
        37.68 |         26        0.00       98.38
        37.69 |         41        0.00       98.38
         37.7 |         46        0.00       98.38
        37.71 |         74        0.01       98.39
        37.72 |         40        0.00       98.39
        37.73 |         25        0.00       98.40
        37.74 |         31        0.00       98.40
        37.75 |         49        0.00       98.40
        37.76 |         59        0.01       98.41
        37.77 |         53        0.00       98.41
        37.78 |         44        0.00       98.42
        37.79 |         39        0.00       98.42
         37.8 |         48        0.00       98.43
        37.81 |         33        0.00       98.43
        37.82 |         69        0.01       98.44
        37.83 |         41        0.00       98.44
        37.84 |         62        0.01       98.44
        37.85 |         56        0.01       98.45
        37.86 |         45        0.00       98.45
        37.87 |         54        0.00       98.46
        37.88 |         72        0.01       98.46
        37.89 |         39        0.00       98.47
         37.9 |         44        0.00       98.47
        37.91 |         48        0.00       98.48
        37.92 |         71        0.01       98.48
        37.93 |         58        0.01       98.49
        37.94 |         60        0.01       98.49
        37.95 |         27        0.00       98.50
        37.96 |         36        0.00       98.50
        37.97 |         47        0.00       98.50
        37.98 |         29        0.00       98.51
        37.99 |         38        0.00       98.51
           38 |         25        0.00       98.51
        38.01 |         71        0.01       98.52
        38.02 |         48        0.00       98.52
        38.03 |         20        0.00       98.52
        38.04 |         56        0.01       98.53
        38.05 |         28        0.00       98.53
        38.06 |         41        0.00       98.54
        38.07 |         15        0.00       98.54
        38.08 |         44        0.00       98.54
        38.09 |         55        0.00       98.55
         38.1 |         48        0.00       98.55
        38.11 |         37        0.00       98.55
        38.12 |         42        0.00       98.56
        38.13 |         51        0.00       98.56
        38.14 |         23        0.00       98.56
        38.15 |         27        0.00       98.57
        38.16 |         77        0.01       98.57
        38.17 |         27        0.00       98.58
        38.18 |         42        0.00       98.58
        38.19 |         34        0.00       98.58
         38.2 |         30        0.00       98.59
        38.21 |         31        0.00       98.59
        38.22 |         67        0.01       98.59
        38.23 |         39        0.00       98.60
        38.24 |         27        0.00       98.60
        38.25 |         36        0.00       98.60
        38.26 |         32        0.00       98.61
        38.27 |         20        0.00       98.61
        38.28 |         43        0.00       98.61
        38.29 |         54        0.00       98.62
         38.3 |         28        0.00       98.62
        38.31 |         39        0.00       98.62
        38.32 |         32        0.00       98.63
        38.33 |         34        0.00       98.63
        38.34 |         25        0.00       98.63
        38.35 |         53        0.00       98.64
        38.36 |         26        0.00       98.64
        38.37 |         27        0.00       98.64
        38.38 |         41        0.00       98.64
        38.39 |         35        0.00       98.65
         38.4 |         42        0.00       98.65
        38.41 |         24        0.00       98.65
        38.42 |         44        0.00       98.66
        38.43 |         65        0.01       98.66
        38.44 |         33        0.00       98.67
        38.45 |         31        0.00       98.67
        38.46 |         52        0.00       98.67
        38.47 |         40        0.00       98.68
        38.48 |         33        0.00       98.68
        38.49 |         21        0.00       98.68
         38.5 |         28        0.00       98.68
        38.51 |         44        0.00       98.69
        38.52 |         29        0.00       98.69
        38.53 |         57        0.01       98.70
        38.54 |         35        0.00       98.70
        38.55 |         51        0.00       98.70
        38.56 |         34        0.00       98.71
        38.57 |         22        0.00       98.71
        38.58 |         37        0.00       98.71
        38.59 |         43        0.00       98.72
         38.6 |         31        0.00       98.72
        38.61 |         40        0.00       98.72
        38.62 |         36        0.00       98.73
        38.63 |         46        0.00       98.73
        38.64 |         13        0.00       98.73
        38.65 |         47        0.00       98.74
        38.66 |         35        0.00       98.74
        38.67 |         44        0.00       98.74
        38.68 |         37        0.00       98.75
        38.69 |         33        0.00       98.75
         38.7 |         53        0.00       98.75
        38.71 |         62        0.01       98.76
        38.72 |         42        0.00       98.76
        38.73 |         44        0.00       98.77
        38.74 |         44        0.00       98.77
        38.75 |         25        0.00       98.77
        38.76 |         54        0.00       98.78
        38.77 |         34        0.00       98.78
        38.78 |         51        0.00       98.79
        38.79 |         13        0.00       98.79
         38.8 |         17        0.00       98.79
        38.81 |         49        0.00       98.79
        38.82 |         42        0.00       98.80
        38.83 |         33        0.00       98.80
        38.84 |         20        0.00       98.80
        38.85 |         21        0.00       98.80
        38.86 |         31        0.00       98.81
        38.87 |         35        0.00       98.81
        38.88 |         26        0.00       98.81
        38.89 |         24        0.00       98.81
         38.9 |         37        0.00       98.82
        38.91 |         29        0.00       98.82
        38.92 |         36        0.00       98.82
        38.93 |         33        0.00       98.83
        38.94 |         32        0.00       98.83
        38.95 |         47        0.00       98.83
        38.96 |         27        0.00       98.84
        38.97 |         43        0.00       98.84
        38.98 |         21        0.00       98.84
        38.99 |         27        0.00       98.84
           39 |         27        0.00       98.85
        39.01 |         35        0.00       98.85
        39.02 |         35        0.00       98.85
        39.03 |         39        0.00       98.86
        39.04 |         31        0.00       98.86
        39.05 |         28        0.00       98.86
        39.06 |         17        0.00       98.86
        39.07 |         46        0.00       98.87
        39.08 |         18        0.00       98.87
        39.09 |         32        0.00       98.87
         39.1 |         49        0.00       98.88
        39.11 |         27        0.00       98.88
        39.12 |         41        0.00       98.88
        39.13 |         13        0.00       98.88
        39.14 |         19        0.00       98.88
        39.15 |         36        0.00       98.89
        39.16 |         19        0.00       98.89
        39.17 |         30        0.00       98.89
        39.18 |         29        0.00       98.89
        39.19 |         28        0.00       98.90
         39.2 |         13        0.00       98.90
        39.21 |         48        0.00       98.90
        39.22 |         35        0.00       98.91
        39.23 |         30        0.00       98.91
        39.24 |         27        0.00       98.91
        39.25 |         32        0.00       98.91
        39.26 |         52        0.00       98.92
        39.27 |         10        0.00       98.92
        39.28 |         17        0.00       98.92
        39.29 |         28        0.00       98.92
         39.3 |         27        0.00       98.93
        39.31 |         23        0.00       98.93
        39.32 |         22        0.00       98.93
        39.33 |         51        0.00       98.93
        39.34 |         23        0.00       98.94
        39.35 |         52        0.00       98.94
        39.36 |         29        0.00       98.94
        39.37 |         36        0.00       98.95
        39.38 |         30        0.00       98.95
        39.39 |         37        0.00       98.95
         39.4 |         19        0.00       98.95
        39.41 |         24        0.00       98.96
        39.42 |         34        0.00       98.96
        39.43 |         21        0.00       98.96
        39.44 |         38        0.00       98.97
        39.45 |         21        0.00       98.97
        39.46 |         23        0.00       98.97
        39.47 |         25        0.00       98.97
        39.48 |         11        0.00       98.97
        39.49 |         27        0.00       98.98
         39.5 |         26        0.00       98.98
        39.51 |         10        0.00       98.98
        39.52 |         22        0.00       98.98
        39.53 |         22        0.00       98.98
        39.54 |         39        0.00       98.99
        39.55 |         12        0.00       98.99
        39.56 |         13        0.00       98.99
        39.57 |         17        0.00       98.99
        39.58 |         30        0.00       98.99
        39.59 |         17        0.00       98.99
         39.6 |         34        0.00       99.00
        39.61 |         28        0.00       99.00
        39.62 |         32        0.00       99.00
        39.63 |         29        0.00       99.00
        39.64 |          9        0.00       99.01
        39.65 |         25        0.00       99.01
        39.66 |         19        0.00       99.01
        39.67 |         42        0.00       99.01
        39.68 |         10        0.00       99.01
        39.69 |         23        0.00       99.02
         39.7 |         24        0.00       99.02
        39.71 |         32        0.00       99.02
        39.72 |         31        0.00       99.02
        39.73 |         27        0.00       99.03
        39.74 |         46        0.00       99.03
        39.75 |         21        0.00       99.03
        39.76 |         33        0.00       99.04
        39.77 |         33        0.00       99.04
        39.78 |         33        0.00       99.04
        39.79 |         43        0.00       99.05
         39.8 |         23        0.00       99.05
        39.81 |         23        0.00       99.05
        39.82 |         46        0.00       99.05
        39.83 |         37        0.00       99.06
        39.84 |         26        0.00       99.06
        39.85 |         47        0.00       99.06
        39.86 |         16        0.00       99.07
        39.87 |         32        0.00       99.07
        39.88 |         22        0.00       99.07
        39.89 |         16        0.00       99.07
         39.9 |         17        0.00       99.07
        39.91 |         36        0.00       99.08
        39.92 |         33        0.00       99.08
        39.93 |         24        0.00       99.08
        39.94 |         48        0.00       99.09
        39.95 |         34        0.00       99.09
        39.96 |         38        0.00       99.09
        39.97 |         36        0.00       99.10
        39.98 |         20        0.00       99.10
        39.99 |         28        0.00       99.10
           40 |         30        0.00       99.10
        40.01 |         32        0.00       99.11
        40.02 |         23        0.00       99.11
        40.03 |         26        0.00       99.11
        40.04 |         22        0.00       99.11
        40.05 |         26        0.00       99.11
        40.06 |         24        0.00       99.12
        40.07 |         12        0.00       99.12
        40.08 |         22        0.00       99.12
        40.09 |         16        0.00       99.12
         40.1 |          7        0.00       99.12
        40.11 |         38        0.00       99.12
        40.12 |         30        0.00       99.13
        40.13 |         28        0.00       99.13
        40.14 |         33        0.00       99.13
        40.15 |         31        0.00       99.14
        40.16 |         32        0.00       99.14
        40.17 |         19        0.00       99.14
        40.18 |         29        0.00       99.14
        40.19 |         18        0.00       99.14
         40.2 |         28        0.00       99.15
        40.21 |         20        0.00       99.15
        40.22 |         46        0.00       99.15
        40.23 |         29        0.00       99.16
        40.24 |         21        0.00       99.16
        40.25 |         19        0.00       99.16
        40.26 |         26        0.00       99.16
        40.27 |         40        0.00       99.17
        40.28 |         19        0.00       99.17
        40.29 |         24        0.00       99.17
         40.3 |          2        0.00       99.17
        40.31 |         32        0.00       99.17
        40.32 |         39        0.00       99.18
        40.33 |         43        0.00       99.18
        40.34 |         27        0.00       99.18
        40.35 |         26        0.00       99.18
        40.36 |         33        0.00       99.19
        40.37 |         36        0.00       99.19
        40.38 |         15        0.00       99.19
        40.39 |         27        0.00       99.19
         40.4 |         49        0.00       99.20
        40.41 |         12        0.00       99.20
        40.42 |         12        0.00       99.20
        40.43 |          6        0.00       99.20
        40.44 |         21        0.00       99.20
        40.45 |         15        0.00       99.20
        40.46 |         21        0.00       99.21
        40.47 |         14        0.00       99.21
        40.48 |         13        0.00       99.21
        40.49 |         16        0.00       99.21
         40.5 |         19        0.00       99.21
        40.51 |         36        0.00       99.22
        40.52 |         22        0.00       99.22
        40.53 |          7        0.00       99.22
        40.54 |         42        0.00       99.22
        40.55 |         13        0.00       99.22
        40.56 |         32        0.00       99.23
        40.57 |         47        0.00       99.23
        40.58 |         22        0.00       99.23
        40.59 |         13        0.00       99.23
         40.6 |         40        0.00       99.24
        40.61 |         31        0.00       99.24
        40.62 |         26        0.00       99.24
        40.63 |         17        0.00       99.24
        40.64 |         18        0.00       99.24
        40.65 |         25        0.00       99.25
        40.66 |         26        0.00       99.25
        40.67 |         27        0.00       99.25
        40.68 |         15        0.00       99.25
        40.69 |         18        0.00       99.25
         40.7 |         22        0.00       99.26
        40.71 |         15        0.00       99.26
        40.72 |         18        0.00       99.26
        40.73 |         21        0.00       99.26
        40.74 |         50        0.00       99.27
        40.75 |         23        0.00       99.27
        40.76 |          5        0.00       99.27
        40.77 |         21        0.00       99.27
        40.78 |          6        0.00       99.27
        40.79 |         10        0.00       99.27
         40.8 |         38        0.00       99.28
        40.81 |         27        0.00       99.28
        40.82 |          9        0.00       99.28
        40.83 |         27        0.00       99.28
        40.84 |         12        0.00       99.28
        40.85 |         24        0.00       99.28
        40.86 |         17        0.00       99.29
        40.87 |         26        0.00       99.29
        40.88 |         31        0.00       99.29
        40.89 |         10        0.00       99.29
         40.9 |         21        0.00       99.29
        40.91 |         13        0.00       99.30
        40.92 |         16        0.00       99.30
        40.93 |          3        0.00       99.30
        40.94 |         17        0.00       99.30
        40.95 |         22        0.00       99.30
        40.96 |         20        0.00       99.30
        40.97 |         29        0.00       99.30
        40.98 |         18        0.00       99.31
        40.99 |         17        0.00       99.31
           41 |         17        0.00       99.31
        41.01 |         23        0.00       99.31
        41.02 |         12        0.00       99.31
        41.03 |         28        0.00       99.31
        41.04 |         24        0.00       99.32
        41.05 |          7        0.00       99.32
        41.06 |         20        0.00       99.32
        41.07 |         38        0.00       99.32
        41.08 |         26        0.00       99.33
        41.09 |         20        0.00       99.33
         41.1 |         13        0.00       99.33
        41.11 |          4        0.00       99.33
        41.12 |         28        0.00       99.33
        41.13 |         18        0.00       99.33
        41.14 |         14        0.00       99.33
        41.15 |         16        0.00       99.34
        41.16 |         25        0.00       99.34
        41.17 |         21        0.00       99.34
        41.18 |         21        0.00       99.34
        41.19 |         13        0.00       99.34
         41.2 |         17        0.00       99.34
        41.21 |         33        0.00       99.35
        41.22 |         18        0.00       99.35
        41.23 |         28        0.00       99.35
        41.24 |         15        0.00       99.35
        41.25 |         14        0.00       99.35
        41.26 |         18        0.00       99.36
        41.27 |         20        0.00       99.36
        41.28 |         23        0.00       99.36
        41.29 |         20        0.00       99.36
         41.3 |          7        0.00       99.36
        41.31 |         21        0.00       99.36
        41.32 |         23        0.00       99.37
        41.33 |          7        0.00       99.37
        41.34 |         18        0.00       99.37
        41.35 |         17        0.00       99.37
        41.36 |         15        0.00       99.37
        41.37 |         34        0.00       99.37
        41.38 |         35        0.00       99.38
        41.39 |         16        0.00       99.38
         41.4 |          3        0.00       99.38
        41.41 |         18        0.00       99.38
        41.42 |          7        0.00       99.38
        41.43 |         17        0.00       99.38
        41.44 |         21        0.00       99.38
        41.45 |         13        0.00       99.39
        41.46 |          8        0.00       99.39
        41.47 |         19        0.00       99.39
        41.48 |         26        0.00       99.39
        41.49 |         16        0.00       99.39
         41.5 |         18        0.00       99.39
        41.51 |         24        0.00       99.40
        41.52 |         35        0.00       99.40
        41.53 |         12        0.00       99.40
        41.54 |          8        0.00       99.40
        41.55 |         10        0.00       99.40
        41.56 |         15        0.00       99.40
        41.57 |         16        0.00       99.40
        41.58 |         10        0.00       99.41
        41.59 |         23        0.00       99.41
         41.6 |         27        0.00       99.41
        41.61 |         20        0.00       99.41
        41.62 |         13        0.00       99.41
        41.63 |         20        0.00       99.41
        41.64 |         31        0.00       99.42
        41.65 |         34        0.00       99.42
        41.66 |         18        0.00       99.42
        41.67 |         34        0.00       99.43
        41.68 |          5        0.00       99.43
        41.69 |         14        0.00       99.43
         41.7 |          9        0.00       99.43
        41.71 |         16        0.00       99.43
        41.72 |         13        0.00       99.43
        41.73 |         14        0.00       99.43
        41.74 |         21        0.00       99.43
        41.75 |          8        0.00       99.43
        41.76 |         19        0.00       99.44
        41.77 |         16        0.00       99.44
        41.78 |         17        0.00       99.44
        41.79 |         16        0.00       99.44
         41.8 |         19        0.00       99.44
        41.81 |         11        0.00       99.44
        41.82 |          9        0.00       99.44
        41.83 |          8        0.00       99.44
        41.84 |         20        0.00       99.45
        41.85 |         23        0.00       99.45
        41.86 |         17        0.00       99.45
        41.87 |         13        0.00       99.45
        41.88 |         15        0.00       99.45
        41.89 |         11        0.00       99.45
         41.9 |         17        0.00       99.45
        41.91 |         25        0.00       99.46
        41.92 |          8        0.00       99.46
        41.93 |          1        0.00       99.46
        41.94 |         32        0.00       99.46
        41.95 |         11        0.00       99.46
        41.96 |          7        0.00       99.46
        41.97 |         21        0.00       99.46
        41.98 |         29        0.00       99.47
        41.99 |         18        0.00       99.47
           42 |          9        0.00       99.47
        42.01 |          5        0.00       99.47
        42.02 |         14        0.00       99.47
        42.03 |         14        0.00       99.47
        42.04 |         13        0.00       99.47
        42.05 |          5        0.00       99.47
        42.06 |         39        0.00       99.48
        42.07 |         23        0.00       99.48
        42.08 |         31        0.00       99.48
        42.09 |         21        0.00       99.48
         42.1 |         17        0.00       99.49
        42.11 |         27        0.00       99.49
        42.12 |         23        0.00       99.49
        42.13 |         14        0.00       99.49
        42.14 |         27        0.00       99.49
        42.15 |         37        0.00       99.50
        42.16 |         15        0.00       99.50
        42.17 |         20        0.00       99.50
        42.18 |         16        0.00       99.50
        42.19 |         40        0.00       99.51
         42.2 |         16        0.00       99.51
        42.21 |          3        0.00       99.51
        42.22 |         31        0.00       99.51
        42.23 |          8        0.00       99.51
        42.24 |         13        0.00       99.51
        42.25 |         12        0.00       99.51
        42.26 |         11        0.00       99.51
        42.27 |          7        0.00       99.51
        42.28 |         11        0.00       99.52
        42.29 |         19        0.00       99.52
         42.3 |         12        0.00       99.52
        42.31 |         20        0.00       99.52
        42.32 |          8        0.00       99.52
        42.33 |         14        0.00       99.52
        42.34 |         11        0.00       99.52
        42.35 |         11        0.00       99.52
        42.36 |          6        0.00       99.52
        42.38 |         21        0.00       99.53
        42.39 |         27        0.00       99.53
         42.4 |         10        0.00       99.53
        42.41 |         22        0.00       99.53
        42.42 |         10        0.00       99.53
        42.43 |         19        0.00       99.53
        42.44 |          7        0.00       99.54
        42.45 |          9        0.00       99.54
        42.46 |         14        0.00       99.54
        42.47 |          7        0.00       99.54
        42.48 |         20        0.00       99.54
        42.49 |          2        0.00       99.54
         42.5 |         23        0.00       99.54
        42.51 |          8        0.00       99.54
        42.52 |         20        0.00       99.54
        42.53 |         12        0.00       99.55
        42.54 |          7        0.00       99.55
        42.55 |         12        0.00       99.55
        42.56 |         13        0.00       99.55
        42.57 |         21        0.00       99.55
        42.58 |         11        0.00       99.55
        42.59 |         22        0.00       99.55
         42.6 |         17        0.00       99.55
        42.61 |         23        0.00       99.56
        42.62 |         19        0.00       99.56
        42.63 |         24        0.00       99.56
        42.64 |         14        0.00       99.56
        42.65 |         13        0.00       99.56
        42.66 |         22        0.00       99.56
        42.67 |         31        0.00       99.57
        42.68 |         11        0.00       99.57
        42.69 |          6        0.00       99.57
         42.7 |          4        0.00       99.57
        42.71 |          5        0.00       99.57
        42.72 |         11        0.00       99.57
        42.73 |          5        0.00       99.57
        42.74 |          5        0.00       99.57
        42.75 |         10        0.00       99.57
        42.76 |         14        0.00       99.57
        42.77 |          6        0.00       99.57
        42.78 |          5        0.00       99.58
        42.79 |         10        0.00       99.58
         42.8 |         10        0.00       99.58
        42.81 |          5        0.00       99.58
        42.82 |          5        0.00       99.58
        42.83 |         12        0.00       99.58
        42.84 |         35        0.00       99.58
        42.85 |          5        0.00       99.58
        42.86 |         18        0.00       99.58
        42.87 |         17        0.00       99.59
        42.88 |         12        0.00       99.59
         42.9 |         12        0.00       99.59
        42.91 |          9        0.00       99.59
        42.92 |         14        0.00       99.59
        42.93 |         10        0.00       99.59
        42.94 |         20        0.00       99.59
        42.95 |         11        0.00       99.59
        42.96 |          7        0.00       99.59
        42.97 |          5        0.00       99.59
        42.98 |          4        0.00       99.60
        42.99 |          6        0.00       99.60
           43 |         16        0.00       99.60
        43.01 |         10        0.00       99.60
        43.02 |          3        0.00       99.60
        43.03 |          6        0.00       99.60
        43.04 |         16        0.00       99.60
        43.05 |          3        0.00       99.60
        43.06 |          4        0.00       99.60
        43.07 |          9        0.00       99.60
        43.08 |          7        0.00       99.60
        43.09 |          8        0.00       99.60
         43.1 |         14        0.00       99.60
        43.11 |         15        0.00       99.61
        43.12 |         13        0.00       99.61
        43.13 |          2        0.00       99.61
        43.14 |         22        0.00       99.61
        43.15 |          5        0.00       99.61
        43.16 |         21        0.00       99.61
        43.17 |          6        0.00       99.61
        43.18 |          8        0.00       99.61
        43.19 |          5        0.00       99.61
         43.2 |         12        0.00       99.61
        43.21 |         10        0.00       99.61
        43.22 |         11        0.00       99.62
        43.23 |         18        0.00       99.62
        43.24 |          1        0.00       99.62
        43.25 |         13        0.00       99.62
        43.26 |          2        0.00       99.62
        43.27 |         16        0.00       99.62
        43.28 |         23        0.00       99.62
        43.29 |         11        0.00       99.62
         43.3 |          9        0.00       99.62
        43.31 |         12        0.00       99.63
        43.32 |         11        0.00       99.63
        43.33 |          3        0.00       99.63
        43.34 |          5        0.00       99.63
        43.35 |          5        0.00       99.63
        43.36 |          7        0.00       99.63
        43.37 |          6        0.00       99.63
        43.38 |         11        0.00       99.63
        43.39 |          5        0.00       99.63
         43.4 |         24        0.00       99.63
        43.41 |          6        0.00       99.63
        43.42 |         12        0.00       99.63
        43.43 |         12        0.00       99.63
        43.44 |         23        0.00       99.64
        43.45 |          6        0.00       99.64
        43.46 |          1        0.00       99.64
        43.47 |          7        0.00       99.64
        43.48 |          2        0.00       99.64
        43.49 |         15        0.00       99.64
         43.5 |          6        0.00       99.64
        43.51 |         14        0.00       99.64
        43.52 |         34        0.00       99.64
        43.53 |         13        0.00       99.65
        43.54 |         10        0.00       99.65
        43.55 |          1        0.00       99.65
        43.56 |         30        0.00       99.65
        43.57 |         15        0.00       99.65
        43.58 |          8        0.00       99.65
        43.59 |          7        0.00       99.65
         43.6 |          8        0.00       99.65
        43.61 |         11        0.00       99.65
        43.62 |         18        0.00       99.66
        43.63 |          1        0.00       99.66
        43.64 |         22        0.00       99.66
        43.66 |         17        0.00       99.66
        43.67 |          4        0.00       99.66
        43.68 |         13        0.00       99.66
        43.69 |         10        0.00       99.66
         43.7 |          8        0.00       99.66
        43.71 |          5        0.00       99.66
        43.72 |          9        0.00       99.66
        43.73 |         11        0.00       99.66
        43.74 |         17        0.00       99.67
        43.75 |         10        0.00       99.67
        43.76 |          8        0.00       99.67
        43.77 |         14        0.00       99.67
        43.79 |          5        0.00       99.67
         43.8 |         14        0.00       99.67
        43.81 |          6        0.00       99.67
        43.82 |          5        0.00       99.67
        43.83 |          5        0.00       99.67
        43.84 |          6        0.00       99.67
        43.85 |         19        0.00       99.67
        43.86 |         10        0.00       99.68
        43.87 |         11        0.00       99.68
        43.88 |          4        0.00       99.68
        43.89 |          7        0.00       99.68
         43.9 |         12        0.00       99.68
        43.91 |          6        0.00       99.68
        43.92 |          5        0.00       99.68
        43.93 |         10        0.00       99.68
        43.94 |         14        0.00       99.68
        43.95 |          1        0.00       99.68
        43.96 |          5        0.00       99.68
        43.97 |         13        0.00       99.68
        43.98 |         10        0.00       99.68
           44 |          4        0.00       99.68
        44.01 |         13        0.00       99.69
        44.03 |          8        0.00       99.69
        44.04 |         10        0.00       99.69
        44.05 |         17        0.00       99.69
        44.06 |         15        0.00       99.69
        44.07 |          6        0.00       99.69
        44.08 |         10        0.00       99.69
        44.09 |          7        0.00       99.69
         44.1 |          9        0.00       99.69
        44.11 |          2        0.00       99.69
        44.12 |          7        0.00       99.69
        44.13 |         18        0.00       99.70
        44.14 |         14        0.00       99.70
        44.15 |          5        0.00       99.70
        44.16 |          4        0.00       99.70
        44.17 |          3        0.00       99.70
        44.18 |         12        0.00       99.70
        44.19 |          9        0.00       99.70
         44.2 |          2        0.00       99.70
        44.21 |          9        0.00       99.70
        44.22 |          9        0.00       99.70
        44.23 |          8        0.00       99.70
        44.24 |          2        0.00       99.70
        44.25 |          3        0.00       99.70
        44.26 |         15        0.00       99.70
        44.28 |          9        0.00       99.70
        44.29 |          7        0.00       99.71
         44.3 |         10        0.00       99.71
        44.31 |          5        0.00       99.71
        44.32 |          5        0.00       99.71
        44.33 |          5        0.00       99.71
        44.34 |         19        0.00       99.71
        44.35 |          4        0.00       99.71
        44.36 |          8        0.00       99.71
        44.37 |          4        0.00       99.71
        44.39 |          9        0.00       99.71
         44.4 |          4        0.00       99.71
        44.41 |         17        0.00       99.71
        44.42 |         10        0.00       99.71
        44.43 |          9        0.00       99.72
        44.44 |          7        0.00       99.72
        44.45 |         10        0.00       99.72
        44.46 |          4        0.00       99.72
        44.47 |         19        0.00       99.72
        44.48 |         17        0.00       99.72
        44.49 |          3        0.00       99.72
         44.5 |          9        0.00       99.72
        44.51 |          6        0.00       99.72
        44.52 |          3        0.00       99.72
        44.53 |         18        0.00       99.72
        44.56 |          5        0.00       99.72
        44.57 |         19        0.00       99.73
        44.58 |          3        0.00       99.73
        44.59 |          9        0.00       99.73
         44.6 |          4        0.00       99.73
        44.61 |          7        0.00       99.73
        44.62 |         13        0.00       99.73
        44.63 |         16        0.00       99.73
        44.64 |         15        0.00       99.73
        44.65 |          1        0.00       99.73
        44.66 |         18        0.00       99.73
        44.67 |         13        0.00       99.73
        44.69 |          5        0.00       99.74
         44.7 |          4        0.00       99.74
        44.71 |         10        0.00       99.74
        44.72 |          2        0.00       99.74
        44.73 |          2        0.00       99.74
        44.74 |          5        0.00       99.74
        44.75 |         19        0.00       99.74
        44.76 |         12        0.00       99.74
        44.78 |          8        0.00       99.74
        44.79 |          4        0.00       99.74
         44.8 |         18        0.00       99.74
        44.81 |          9        0.00       99.74
        44.82 |         10        0.00       99.74
        44.83 |         12        0.00       99.75
        44.84 |         11        0.00       99.75
        44.85 |         13        0.00       99.75
        44.86 |          6        0.00       99.75
        44.87 |          4        0.00       99.75
        44.88 |         20        0.00       99.75
         44.9 |          9        0.00       99.75
        44.91 |         14        0.00       99.75
        44.92 |          7        0.00       99.75
        44.93 |          6        0.00       99.75
        44.94 |         13        0.00       99.76
        44.95 |         16        0.00       99.76
        44.96 |          6        0.00       99.76
        44.97 |         12        0.00       99.76
        44.99 |          2        0.00       99.76
           45 |          7        0.00       99.76
        45.02 |          8        0.00       99.76
        45.03 |         10        0.00       99.76
        45.04 |          3        0.00       99.76
        45.05 |          3        0.00       99.76
        45.06 |          3        0.00       99.76
        45.07 |          3        0.00       99.76
        45.08 |          6        0.00       99.76
        45.09 |         15        0.00       99.76
         45.1 |          6        0.00       99.76
        45.11 |         11        0.00       99.77
        45.13 |          5        0.00       99.77
        45.14 |         14        0.00       99.77
        45.15 |          6        0.00       99.77
        45.16 |          3        0.00       99.77
        45.17 |          4        0.00       99.77
        45.18 |         12        0.00       99.77
        45.19 |         13        0.00       99.77
         45.2 |         15        0.00       99.77
        45.21 |          8        0.00       99.77
        45.22 |          5        0.00       99.77
        45.24 |          3        0.00       99.77
        45.26 |          5        0.00       99.77
        45.27 |         10        0.00       99.77
        45.28 |         12        0.00       99.78
        45.29 |          6        0.00       99.78
         45.3 |          8        0.00       99.78
        45.31 |         19        0.00       99.78
        45.32 |          3        0.00       99.78
        45.33 |         17        0.00       99.78
        45.34 |          7        0.00       99.78
        45.35 |         12        0.00       99.78
        45.36 |         11        0.00       99.78
        45.38 |          4        0.00       99.78
         45.4 |          5        0.00       99.78
        45.41 |          8        0.00       99.78
        45.42 |          3        0.00       99.78
        45.43 |         14        0.00       99.79
        45.44 |          4        0.00       99.79
        45.45 |          5        0.00       99.79
        45.46 |          8        0.00       99.79
        45.47 |          8        0.00       99.79
        45.48 |          6        0.00       99.79
        45.49 |          2        0.00       99.79
         45.5 |          3        0.00       99.79
        45.51 |          3        0.00       99.79
        45.53 |          7        0.00       99.79
        45.54 |          6        0.00       99.79
        45.55 |          2        0.00       99.79
        45.56 |         21        0.00       99.79
        45.57 |         13        0.00       99.79
        45.58 |          6        0.00       99.79
        45.59 |          2        0.00       99.79
         45.6 |          3        0.00       99.79
        45.61 |          6        0.00       99.80
        45.62 |          5        0.00       99.80
        45.63 |          2        0.00       99.80
        45.64 |          3        0.00       99.80
        45.67 |          4        0.00       99.80
        45.69 |          3        0.00       99.80
         45.7 |          4        0.00       99.80
        45.71 |         12        0.00       99.80
        45.72 |         12        0.00       99.80
        45.73 |         16        0.00       99.80
        45.74 |          1        0.00       99.80
        45.75 |          8        0.00       99.80
        45.76 |          4        0.00       99.80
        45.77 |          6        0.00       99.80
        45.78 |          5        0.00       99.80
        45.79 |          8        0.00       99.80
         45.8 |          5        0.00       99.80
        45.81 |          5        0.00       99.80
        45.82 |         17        0.00       99.81
        45.83 |          9        0.00       99.81
        45.84 |         15        0.00       99.81
        45.85 |          3        0.00       99.81
        45.86 |          3        0.00       99.81
         45.9 |         18        0.00       99.81
        45.91 |         20        0.00       99.81
        45.92 |          5        0.00       99.81
        45.93 |          5        0.00       99.81
        45.94 |          5        0.00       99.81
        45.95 |          6        0.00       99.81
        45.97 |          5        0.00       99.81
        45.98 |          6        0.00       99.82
        45.99 |          6        0.00       99.82
           46 |          7        0.00       99.82
        46.01 |          7        0.00       99.82
        46.02 |          3        0.00       99.82
        46.03 |          8        0.00       99.82
        46.05 |          5        0.00       99.82
        46.06 |          2        0.00       99.82
        46.07 |          6        0.00       99.82
        46.08 |          5        0.00       99.82
        46.09 |          1        0.00       99.82
        46.11 |          8        0.00       99.82
        46.12 |          3        0.00       99.82
        46.13 |          9        0.00       99.82
        46.14 |          8        0.00       99.82
        46.15 |          9        0.00       99.82
        46.16 |          2        0.00       99.82
        46.17 |          1        0.00       99.82
        46.18 |         10        0.00       99.82
        46.19 |         11        0.00       99.83
         46.2 |          1        0.00       99.83
        46.21 |         10        0.00       99.83
        46.22 |         12        0.00       99.83
        46.23 |          8        0.00       99.83
        46.26 |          8        0.00       99.83
        46.28 |         15        0.00       99.83
        46.29 |          8        0.00       99.83
         46.3 |          8        0.00       99.83
        46.31 |          3        0.00       99.83
        46.32 |          9        0.00       99.83
        46.33 |          8        0.00       99.83
        46.34 |          2        0.00       99.83
        46.35 |          3        0.00       99.83
        46.37 |         17        0.00       99.84
        46.38 |          5        0.00       99.84
        46.39 |          3        0.00       99.84
        46.41 |         12        0.00       99.84
        46.42 |          1        0.00       99.84
        46.43 |          4        0.00       99.84
        46.44 |          6        0.00       99.84
        46.47 |         10        0.00       99.84
        46.49 |          4        0.00       99.84
         46.5 |          3        0.00       99.84
        46.51 |         10        0.00       99.84
        46.52 |          4        0.00       99.84
        46.54 |         14        0.00       99.84
        46.55 |          7        0.00       99.84
        46.57 |         10        0.00       99.84
        46.59 |          3        0.00       99.84
         46.6 |          3        0.00       99.84
        46.61 |          2        0.00       99.84
        46.62 |          1        0.00       99.84
        46.63 |          3        0.00       99.84
        46.64 |          5        0.00       99.85
        46.65 |          1        0.00       99.85
        46.66 |          4        0.00       99.85
        46.67 |          5        0.00       99.85
        46.68 |         11        0.00       99.85
        46.69 |          8        0.00       99.85
         46.7 |          4        0.00       99.85
        46.71 |          1        0.00       99.85
        46.72 |          6        0.00       99.85
        46.74 |          3        0.00       99.85
        46.75 |          2        0.00       99.85
        46.77 |          6        0.00       99.85
        46.78 |          4        0.00       99.85
        46.79 |          1        0.00       99.85
         46.8 |          8        0.00       99.85
        46.81 |         11        0.00       99.85
        46.86 |          6        0.00       99.85
        46.87 |          8        0.00       99.85
        46.88 |          4        0.00       99.85
        46.89 |          6        0.00       99.85
         46.9 |          6        0.00       99.85
        46.91 |          3        0.00       99.85
        46.92 |          1        0.00       99.85
        46.93 |          6        0.00       99.86
        46.94 |          9        0.00       99.86
        46.95 |          3        0.00       99.86
        46.96 |          4        0.00       99.86
        46.97 |         11        0.00       99.86
        46.98 |          2        0.00       99.86
           47 |          1        0.00       99.86
        47.01 |          8        0.00       99.86
        47.03 |          8        0.00       99.86
        47.05 |          2        0.00       99.86
        47.06 |         11        0.00       99.86
        47.07 |          8        0.00       99.86
        47.11 |          2        0.00       99.86
        47.13 |         10        0.00       99.86
        47.14 |          6        0.00       99.86
        47.15 |          9        0.00       99.86
        47.16 |          6        0.00       99.86
        47.17 |          2        0.00       99.86
        47.18 |          3        0.00       99.86
        47.19 |          7        0.00       99.87
         47.2 |          2        0.00       99.87
        47.21 |          6        0.00       99.87
        47.23 |         22        0.00       99.87
        47.24 |          1        0.00       99.87
        47.25 |         11        0.00       99.87
        47.26 |          7        0.00       99.87
        47.27 |          4        0.00       99.87
        47.29 |          3        0.00       99.87
         47.3 |          3        0.00       99.87
        47.33 |          3        0.00       99.87
        47.34 |          4        0.00       99.87
        47.35 |          4        0.00       99.87
        47.36 |          4        0.00       99.87
        47.37 |          4        0.00       99.87
        47.38 |          2        0.00       99.87
        47.39 |          3        0.00       99.87
         47.4 |          8        0.00       99.87
        47.41 |          5        0.00       99.87
        47.42 |          6        0.00       99.87
        47.43 |          1        0.00       99.87
        47.46 |          9        0.00       99.88
        47.47 |         12        0.00       99.88
         47.5 |          4        0.00       99.88
        47.51 |          4        0.00       99.88
        47.52 |          7        0.00       99.88
        47.53 |          1        0.00       99.88
        47.54 |          7        0.00       99.88
        47.55 |          2        0.00       99.88
        47.56 |          4        0.00       99.88
         47.6 |          6        0.00       99.88
        47.61 |          3        0.00       99.88
        47.62 |          3        0.00       99.88
        47.63 |          4        0.00       99.88
        47.64 |          7        0.00       99.88
        47.66 |          5        0.00       99.88
        47.67 |          5        0.00       99.88
        47.68 |          1        0.00       99.88
         47.7 |          2        0.00       99.88
        47.73 |          4        0.00       99.88
        47.75 |          4        0.00       99.88
        47.76 |          3        0.00       99.88
        47.77 |          4        0.00       99.88
        47.78 |          4        0.00       99.88
        47.79 |          8        0.00       99.88
         47.8 |          3        0.00       99.89
        47.81 |          2        0.00       99.89
        47.82 |          2        0.00       99.89
        47.85 |          2        0.00       99.89
        47.86 |          8        0.00       99.89
        47.87 |          3        0.00       99.89
        47.89 |          2        0.00       99.89
        47.91 |          4        0.00       99.89
        47.92 |          1        0.00       99.89
        47.93 |          4        0.00       99.89
        47.96 |          2        0.00       99.89
        47.97 |          3        0.00       99.89
        47.98 |          2        0.00       99.89
        47.99 |          4        0.00       99.89
        48.01 |          3        0.00       99.89
        48.02 |          2        0.00       99.89
        48.05 |          2        0.00       99.89
        48.06 |          5        0.00       99.89
        48.07 |          7        0.00       99.89
        48.08 |          1        0.00       99.89
        48.09 |          1        0.00       99.89
         48.1 |          1        0.00       99.89
        48.11 |          4        0.00       99.89
        48.13 |          2        0.00       99.89
        48.15 |          2        0.00       99.89
        48.17 |          2        0.00       99.89
        48.18 |          6        0.00       99.89
        48.21 |          4        0.00       99.89
        48.23 |          5        0.00       99.89
        48.24 |          6        0.00       99.89
        48.31 |          4        0.00       99.89
        48.32 |          4        0.00       99.89
        48.33 |          2        0.00       99.89
        48.34 |          1        0.00       99.89
        48.35 |          2        0.00       99.89
        48.36 |          5        0.00       99.90
        48.37 |          9        0.00       99.90
        48.38 |          3        0.00       99.90
        48.39 |          4        0.00       99.90
         48.4 |          4        0.00       99.90
        48.41 |          3        0.00       99.90
        48.42 |          2        0.00       99.90
        48.47 |          1        0.00       99.90
        48.48 |         11        0.00       99.90
         48.5 |          1        0.00       99.90
        48.54 |          5        0.00       99.90
        48.55 |          9        0.00       99.90
        48.56 |          4        0.00       99.90
        48.57 |          5        0.00       99.90
        48.63 |          4        0.00       99.90
        48.64 |          2        0.00       99.90
        48.65 |          1        0.00       99.90
        48.66 |          6        0.00       99.90
        48.67 |          9        0.00       99.90
        48.68 |          5        0.00       99.90
        48.69 |          2        0.00       99.90
         48.7 |          4        0.00       99.90
        48.72 |          2        0.00       99.90
        48.74 |          5        0.00       99.90
        48.76 |          8        0.00       99.90
        48.77 |          5        0.00       99.91
        48.78 |          2        0.00       99.91
         48.8 |          2        0.00       99.91
        48.81 |          4        0.00       99.91
        48.82 |         12        0.00       99.91
        48.84 |          1        0.00       99.91
        48.85 |          4        0.00       99.91
        48.86 |          4        0.00       99.91
        48.88 |          1        0.00       99.91
        48.89 |          7        0.00       99.91
         48.9 |          2        0.00       99.91
        48.91 |          5        0.00       99.91
        48.92 |          2        0.00       99.91
        48.94 |          5        0.00       99.91
        48.96 |          1        0.00       99.91
        48.98 |          7        0.00       99.91
        49.01 |          5        0.00       99.91
        49.02 |          6        0.00       99.91
        49.07 |          4        0.00       99.91
        49.08 |          6        0.00       99.91
        49.09 |          1        0.00       99.91
         49.1 |          1        0.00       99.91
        49.11 |          3        0.00       99.91
        49.12 |          9        0.00       99.91
        49.13 |          2        0.00       99.91
        49.15 |          1        0.00       99.91
        49.16 |          2        0.00       99.91
        49.19 |          2        0.00       99.91
         49.2 |          2        0.00       99.91
        49.23 |          1        0.00       99.91
        49.24 |          6        0.00       99.92
        49.26 |          3        0.00       99.92
        49.27 |          3        0.00       99.92
        49.29 |         13        0.00       99.92
        49.31 |          3        0.00       99.92
        49.33 |          4        0.00       99.92
        49.34 |          1        0.00       99.92
        49.35 |          1        0.00       99.92
        49.37 |          2        0.00       99.92
        49.38 |          6        0.00       99.92
         49.4 |          2        0.00       99.92
        49.41 |          3        0.00       99.92
        49.45 |          4        0.00       99.92
        49.47 |          4        0.00       99.92
        49.48 |          6        0.00       99.92
        49.49 |          2        0.00       99.92
         49.5 |          2        0.00       99.92
        49.52 |          3        0.00       99.92
        49.53 |          2        0.00       99.92
        49.54 |          5        0.00       99.92
        49.56 |          3        0.00       99.92
        49.59 |          7        0.00       99.92
         49.6 |          2        0.00       99.92
        49.61 |          5        0.00       99.92
        49.65 |          3        0.00       99.92
        49.66 |          2        0.00       99.92
        49.69 |          2        0.00       99.92
        49.71 |          3        0.00       99.92
        49.76 |          1        0.00       99.92
        49.77 |          6        0.00       99.92
        49.79 |          2        0.00       99.92
        49.83 |          3        0.00       99.93
        49.84 |         11        0.00       99.93
        49.88 |          7        0.00       99.93
        49.89 |          3        0.00       99.93
         49.9 |          1        0.00       99.93
        49.91 |          6        0.00       99.93
        49.92 |          2        0.00       99.93
        49.97 |          1        0.00       99.93
        49.98 |          2        0.00       99.93
        49.99 |          1        0.00       99.93
           50 |          9        0.00       99.93
        50.01 |          4        0.00       99.93
        50.04 |          5        0.00       99.93
        50.05 |          8        0.00       99.93
        50.07 |          4        0.00       99.93
        50.08 |          5        0.00       99.93
         50.1 |          2        0.00       99.93
        50.11 |          3        0.00       99.93
        50.12 |          3        0.00       99.93
        50.13 |         10        0.00       99.93
        50.14 |          1        0.00       99.93
        50.17 |          4        0.00       99.93
        50.19 |          3        0.00       99.93
         50.2 |          6        0.00       99.93
        50.22 |          5        0.00       99.93
        50.23 |          7        0.00       99.94
        50.24 |          1        0.00       99.94
        50.27 |          2        0.00       99.94
        50.29 |          3        0.00       99.94
         50.3 |          1        0.00       99.94
        50.31 |          5        0.00       99.94
        50.33 |          4        0.00       99.94
        50.34 |          7        0.00       99.94
        50.36 |          4        0.00       99.94
        50.37 |          3        0.00       99.94
        50.38 |          2        0.00       99.94
         50.4 |          3        0.00       99.94
        50.45 |          6        0.00       99.94
        50.49 |          6        0.00       99.94
         50.5 |         10        0.00       99.94
        50.51 |          2        0.00       99.94
        50.52 |          5        0.00       99.94
        50.55 |          2        0.00       99.94
         50.6 |          7        0.00       99.94
        50.61 |          3        0.00       99.94
        50.62 |          4        0.00       99.94
        50.63 |          7        0.00       99.94
        50.65 |          4        0.00       99.94
        50.66 |          3        0.00       99.94
        50.68 |          2        0.00       99.94
        50.69 |          1        0.00       99.94
        50.71 |          2        0.00       99.94
        50.72 |          3        0.00       99.94
        50.73 |          5        0.00       99.94
        50.74 |          5        0.00       99.95
        50.75 |          1        0.00       99.95
        50.76 |          5        0.00       99.95
        50.77 |          4        0.00       99.95
        50.79 |          1        0.00       99.95
        50.81 |          2        0.00       99.95
        50.85 |          3        0.00       99.95
        50.86 |          1        0.00       99.95
        50.87 |          5        0.00       99.95
        50.88 |          2        0.00       99.95
         50.9 |          4        0.00       99.95
        50.97 |          3        0.00       99.95
           51 |          4        0.00       99.95
        51.01 |          4        0.00       99.95
        51.04 |          2        0.00       99.95
        51.06 |          3        0.00       99.95
        51.07 |          6        0.00       99.95
        51.09 |          5        0.00       99.95
        51.11 |          1        0.00       99.95
        51.13 |          2        0.00       99.95
        51.19 |          6        0.00       99.95
        51.21 |          6        0.00       99.95
        51.23 |          5        0.00       99.95
        51.25 |          1        0.00       99.95
        51.26 |          1        0.00       99.95
        51.28 |          1        0.00       99.95
        51.29 |          6        0.00       99.95
        51.32 |          1        0.00       99.95
        51.35 |          2        0.00       99.95
         51.4 |          5        0.00       99.95
        51.41 |          8        0.00       99.95
        51.42 |          7        0.00       99.95
        51.49 |          3        0.00       99.96
        51.51 |          2        0.00       99.96
        51.52 |          2        0.00       99.96
        51.53 |          2        0.00       99.96
        51.55 |          4        0.00       99.96
        51.63 |          3        0.00       99.96
        51.64 |          2        0.00       99.96
        51.65 |          4        0.00       99.96
        51.73 |          2        0.00       99.96
         51.8 |          6        0.00       99.96
        51.86 |          4        0.00       99.96
         51.9 |          6        0.00       99.96
        51.92 |          2        0.00       99.96
        51.97 |          3        0.00       99.96
        51.99 |          1        0.00       99.96
        52.08 |          2        0.00       99.96
        52.11 |          8        0.00       99.96
        52.13 |          1        0.00       99.96
        52.17 |          2        0.00       99.96
        52.21 |          5        0.00       99.96
        52.22 |          3        0.00       99.96
        52.25 |          4        0.00       99.96
        52.31 |          3        0.00       99.96
        52.32 |          3        0.00       99.96
        52.33 |          4        0.00       99.96
        52.35 |          3        0.00       99.96
        52.52 |          2        0.00       99.96
        52.56 |         17        0.00       99.96
        52.64 |          4        0.00       99.96
        52.67 |          1        0.00       99.96
        52.68 |          1        0.00       99.96
         52.7 |          6        0.00       99.97
        52.73 |          2        0.00       99.97
        52.74 |          7        0.00       99.97
        52.79 |          8        0.00       99.97
        52.86 |          5        0.00       99.97
        52.89 |          1        0.00       99.97
         52.9 |          4        0.00       99.97
        52.93 |          2        0.00       99.97
        52.94 |          5        0.00       99.97
        52.97 |          3        0.00       99.97
        52.98 |          5        0.00       99.97
           53 |          1        0.00       99.97
        53.01 |          1        0.00       99.97
        53.07 |          4        0.00       99.97
        53.09 |          2        0.00       99.97
        53.15 |          7        0.00       99.97
        53.21 |          4        0.00       99.97
        53.33 |          2        0.00       99.97
        53.34 |          2        0.00       99.97
        53.36 |          3        0.00       99.97
        53.38 |          4        0.00       99.97
        53.39 |          3        0.00       99.97
        53.42 |          5        0.00       99.97
        53.47 |          3        0.00       99.97
        53.48 |          1        0.00       99.97
        53.56 |          2        0.00       99.97
        53.62 |          2        0.00       99.97
        53.63 |          1        0.00       99.97
        53.73 |          2        0.00       99.97
        53.78 |          3        0.00       99.97
        53.87 |          1        0.00       99.97
        53.88 |          8        0.00       99.97
         53.9 |          2        0.00       99.97
         54.1 |          6        0.00       99.98
        54.12 |          2        0.00       99.98
        54.22 |          1        0.00       99.98
        54.34 |          4        0.00       99.98
        54.37 |          3        0.00       99.98
        54.38 |          8        0.00       99.98
        54.44 |          2        0.00       99.98
        54.47 |          1        0.00       99.98
        54.48 |          1        0.00       99.98
        54.49 |          1        0.00       99.98
         54.5 |          2        0.00       99.98
        54.53 |          2        0.00       99.98
        54.61 |          4        0.00       99.98
        54.63 |          4        0.00       99.98
         54.7 |          3        0.00       99.98
        54.73 |          7        0.00       99.98
        54.85 |          2        0.00       99.98
        54.93 |          6        0.00       99.98
        54.95 |          1        0.00       99.98
           55 |          3        0.00       99.98
        55.24 |          1        0.00       99.98
        55.38 |          1        0.00       99.98
        55.41 |          4        0.00       99.98
        55.43 |          8        0.00       99.98
        55.54 |          6        0.00       99.98
        55.58 |          1        0.00       99.98
        55.62 |          1        0.00       99.98
        55.67 |          2        0.00       99.98
        55.69 |          3        0.00       99.98
        55.84 |          1        0.00       99.98
        55.88 |          3        0.00       99.98
        55.89 |          1        0.00       99.98
        55.97 |          1        0.00       99.98
        56.11 |          2        0.00       99.98
        56.24 |          4        0.00       99.98
         56.3 |          2        0.00       99.98
        56.31 |          2        0.00       99.98
        56.32 |          5        0.00       99.98
         56.5 |          1        0.00       99.98
        56.67 |          1        0.00       99.98
        56.69 |          5        0.00       99.99
        56.83 |          6        0.00       99.99
        56.87 |          3        0.00       99.99
        56.92 |          2        0.00       99.99
        56.95 |          4        0.00       99.99
        56.96 |          4        0.00       99.99
        56.99 |          2        0.00       99.99
        57.02 |          3        0.00       99.99
        57.05 |          6        0.00       99.99
        57.09 |          6        0.00       99.99
        57.12 |          4        0.00       99.99
        57.22 |          5        0.00       99.99
        57.33 |          1        0.00       99.99
        57.36 |          3        0.00       99.99
        57.41 |          4        0.00       99.99
        57.44 |          4        0.00       99.99
        57.54 |          3        0.00       99.99
        57.63 |          2        0.00       99.99
        57.78 |          7        0.00       99.99
        57.85 |          2        0.00       99.99
        58.07 |          1        0.00       99.99
        58.23 |          2        0.00       99.99
        58.29 |          3        0.00       99.99
        58.31 |          5        0.00       99.99
        58.33 |          3        0.00       99.99
        58.43 |          3        0.00       99.99
        58.47 |          3        0.00       99.99
        58.56 |          8        0.00       99.99
         58.6 |          1        0.00       99.99
        58.64 |          1        0.00       99.99
        58.74 |          1        0.00       99.99
         58.8 |          1        0.00       99.99
        59.02 |          3        0.00       99.99
        59.04 |          4        0.00      100.00
        59.14 |          1        0.00      100.00
        59.17 |         17        0.00      100.00
         59.2 |          1        0.00      100.00
        59.35 |          1        0.00      100.00
        59.38 |          2        0.00      100.00
        59.43 |          1        0.00      100.00
        59.56 |          1        0.00      100.00
        59.57 |          4        0.00      100.00
        59.73 |          3        0.00      100.00
        59.78 |          1        0.00      100.00
        59.82 |          2        0.00      100.00
        59.87 |          4        0.00      100.00
        59.88 |          6        0.00      100.00
        59.89 |          5        0.00      100.00
        59.93 |          3        0.00      100.00
        59.98 |          1        0.00      100.00
--------------+-----------------------------------
        Total |  1,111,207      100.00

. sum bmi, d

          BMI ma, not adjusted for pregnancy (v445)
-------------------------------------------------------------
      Percentiles      Smallest
 1%        15.69          12.01
 5%        17.37          12.02
10%        18.32          12.02       Obs             1111207
25%        20.08          12.03       Sum of Wgt.     1111207

50%        22.52                      Mean           23.56864
                        Largest       Std. Dev.      5.012861
75%        26.01          59.93
90%        30.34          59.93       Variance       25.12878
95%        33.25          59.93       Skewness       1.263152
99%        39.62          59.98       Kurtosis       5.532755

. lookfor bmi

              storage  display     value
variable name   type   format      label      variable label
-------------------------------------------------------------------------------------------------------------------------------------------------
bmi             float  %8.0g       v445       BMI ma, not adjusted for pregnancy (v445)
bmi_normal      byte   %9.0g                  18.5<=BMI<25
bmi_low         byte   %9.0g                  BMI<=18.5
bmi_high        byte   %9.0g                  BMI>25
bmi1            float  %9.0g                  BMI ma, excludes pregnant women

. do "/tmp/SD01964.000000"

. reg terminated_preg fert agemay educf_* height bmi1 aiquin i.yearc country2- country46 [pw=sweight]
(sum of wgt is   8.6265e+05)
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  874385
                                                       F(115,874269) = 1968.06
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0533
                                                       Root MSE      =  .41196

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0042898   .0002912    14.73   0.000      .003719    .0048606
      agemay |   .0068316   .0001111    61.50   0.000     .0066139    .0070493
   educf_1_4 |    .018965   .0016304    11.63   0.000     .0157696    .0221605
   educf_5_6 |   .0136942    .001797     7.62   0.000      .010172    .0172163
  educf_7_10 |   .0181312   .0018398     9.86   0.000     .0145252    .0217371
educf_11plus |   .0097771   .0022553     4.34   0.000     .0053567    .0141975
      height |  -.0002589   .0000879    -2.95   0.003    -.0004311   -.0000867
        bmi1 |    .001994   .0001322    15.09   0.000     .0017349    .0022531
      aiquin |   .0043156   .0004325     9.98   0.000     .0034679    .0051633
             |
       yearc |
       1928  |   .7490894   .1900591     3.94   0.000       .37658    1.121599
       1929  |   .0151306   .0022886     6.61   0.000     .0106451    .0196161
       1930  |   .6528348   .2245647     2.91   0.004     .2126955    1.092974
       1931  |   .3702785   .1970879     1.88   0.060    -.0160072    .7565643
       1932  |   .1959857    .109257     1.79   0.073    -.0181543    .4101257
       1933  |   .2991813   .1361499     2.20   0.028      .032332    .5660306
       1934  |   .1981401   .0728071     2.72   0.006     .0554407    .3408396
       1935  |   .2974157   .0787551     3.78   0.000     .1430582    .4517731
       1936  |   .3022326   .0682416     4.43   0.000     .1684812    .4359839
       1937  |    .246688   .0494664     4.99   0.000     .1497354    .3436406
       1938  |    .237265   .0462783     5.13   0.000     .1465612    .3279688
       1939  |   .2528921   .0468682     5.40   0.000      .161032    .3447523
       1940  |    .207296   .0317895     6.52   0.000     .1449897    .2696023
       1941  |   .2003873   .0340174     5.89   0.000     .1337144    .2670601
       1942  |   .2083535   .0296797     7.02   0.000     .1501824    .2665247
       1943  |   .2052043   .0274184     7.48   0.000     .1514651    .2589435
       1944  |   .2052115   .0251886     8.15   0.000     .1558427    .2545802
       1945  |   .2026964    .022939     8.84   0.000     .1577367     .247656
       1946  |   .1551068   .0196862     7.88   0.000     .1165226     .193691
       1947  |   .2084967   .0199873    10.43   0.000     .1693222    .2476711
       1948  |   .1752409   .0169275    10.35   0.000     .1420636    .2084183
       1949  |   .1754156   .0175121    10.02   0.000     .1410924    .2097387
       1950  |   .1555105   .0137469    11.31   0.000     .1285671     .182454
       1951  |    .166503   .0126263    13.19   0.000     .1417558    .1912501
       1952  |   .1459699   .0116989    12.48   0.000     .1230405    .1688993
       1953  |   .2529257   .0908393     2.78   0.005     .0748837    .4309676
       1962  |   .4069927   .2815636     1.45   0.148    -.1448624    .9588479
       1963  |   .3663299   .1276155     2.87   0.004     .1162077    .6164521
       1964  |   .3008417   .1017846     2.96   0.003     .1013474    .5003361
       1965  |   .4064211   .0690285     5.89   0.000     .2711276    .5417147
       1966  |   .4136527   .0492984     8.39   0.000     .3170293     .510276
       1967  |   .3581461   .0411594     8.70   0.000     .2774751    .4388172
       1968  |   .2637004    .022701    11.62   0.000     .2192072    .3081936
       1969  |   .3529314   .0251405    14.04   0.000     .3036567     .402206
       1970  |   .2925807   .0180952    16.17   0.000     .2571146    .3280467
       1971  |   .3017031   .0160707    18.77   0.000      .270205    .3332012
       1972  |   .3131407   .0145323    21.55   0.000     .2846579    .3416235
       1973  |   .3031432   .0108216    28.01   0.000     .2819333    .3243532
       1974  |   .2865371    .010838    26.44   0.000      .265295    .3077791
       1975  |   .2951897   .0090315    32.68   0.000     .2774883     .312891
       1976  |   .2849529   .0079407    35.89   0.000     .2693893    .3005164
       1977  |    .284092   .0077297    36.75   0.000     .2689421     .299242
       1978  |   .2830259   .0069101    40.96   0.000     .2694823    .2965695
       1979  |   .2841464   .0066391    42.80   0.000      .271134    .2971588
       1980  |   .2699082   .0060747    44.43   0.000      .258002    .2818143
       1981  |   .2801541    .006057    46.25   0.000     .2682826    .2920256
       1982  |   .2658683   .0057304    46.40   0.000      .254637    .2770996
       1983  |   .2634471   .0055928    47.10   0.000     .2524853    .2744088
       1984  |   .2582119    .005477    47.14   0.000     .2474771    .2689467
       1985  |    .258254    .005381    47.99   0.000     .2477073    .2688006
       1986  |   .2491666   .0052998    47.01   0.000     .2387792    .2595541
       1987  |   .2433453   .0052544    46.31   0.000     .2330468    .2536438
       1988  |   .2391233   .0051872    46.10   0.000     .2289565      .24929
       1989  |   .2388829   .0052303    45.67   0.000     .2286317    .2491342
       1990  |    .227869   .0051574    44.18   0.000     .2177607    .2379774
       1991  |    .221384   .0051981    42.59   0.000     .2111959    .2315721
       1992  |   .2127939    .005176    41.11   0.000     .2026491    .2229386
       1993  |   .2077104   .0051963    39.97   0.000     .1975257     .217895
       1994  |   .2003642   .0051917    38.59   0.000     .1901886    .2105398
       1995  |    .197959   .0052244    37.89   0.000     .1877194    .2081986
       1996  |   .1883252   .0052527    35.85   0.000       .17803    .1986204
       1997  |    .180793   .0053077    34.06   0.000     .1703902    .1911958
       1998  |   .1734178   .0053296    32.54   0.000     .1629719    .1838636
       1999  |   .1677992   .0054318    30.89   0.000      .157153    .1784455
       2000  |   .1566806   .0054894    28.54   0.000     .1459216    .1674396
       2001  |   .1606483   .0058047    27.68   0.000     .1492713    .1720252
       2002  |     .15058     .00592    25.44   0.000      .138977    .1621831
       2003  |    .144972   .0059211    24.48   0.000     .1333668    .1565772
       2004  |    .140091   .0064324    21.78   0.000     .1274837    .1526984
       2005  |   .1199689   .0083807    14.31   0.000     .1035429    .1363949
       2006  |   .1086697   .0239936     4.53   0.000      .061643    .1556964
             |
    country2 |  -.4947273   .0055959   -88.41   0.000    -.5056951   -.4837595
    country3 |  -.5040726   .0068918   -73.14   0.000    -.5175804   -.4905649
    country4 |  -.5579971   .0058588   -95.24   0.000    -.5694802    -.546514
    country5 |  -.5767182    .005633  -102.38   0.000    -.5877587   -.5656777
    country6 |  -.5884415   .0065842   -89.37   0.000    -.6013462   -.5755368
    country7 |  -.4760036   .0068695   -69.29   0.000    -.4894676   -.4625397
    country8 |  -.5939993   .0071246   -83.37   0.000    -.6079634   -.5800353
    country9 |    -.52718   .0052296  -100.81   0.000    -.5374299     -.51693
   country10 |          0  (omitted)
   country11 |  -.4311781   .0081629   -52.82   0.000    -.4471772   -.4151791
   country12 |          0  (omitted)
   country13 |  -.5318071   .0110363   -48.19   0.000    -.5534379   -.5101763
   country14 |  -.5315342   .0049437  -107.52   0.000    -.5412237   -.5218447
   country15 |  -.5878588   .0062261   -94.42   0.000    -.6000619   -.5756558
   country16 |  -.5896383   .0073765   -79.94   0.000     -.604096   -.5751807
   country17 |  -.6053153    .006975   -86.78   0.000     -.618986   -.5916446
   country18 |  -.5513031   .0056469   -97.63   0.000     -.562371   -.5402353
   country19 |  -.5617743   .0049626  -113.20   0.000    -.5715008   -.5520479
   country20 |          0  (omitted)
   country21 |  -.1884535   .0092084   -20.47   0.000    -.2065016   -.1704054
   country22 |  -.6466102   .0054809  -117.97   0.000    -.6573527   -.6358677
   country23 |  -.6707494   .0071771   -93.46   0.000    -.6848163   -.6566826
   country24 |   -.640716   .0059371  -107.92   0.000    -.6523526   -.6290795
   country25 |  -.6321445   .0052789  -119.75   0.000    -.6424909   -.6217981
   country26 |    -.54978   .0057045   -96.38   0.000    -.5609606   -.5385995
   country27 |  -.5566137   .0054553  -102.03   0.000     -.567306   -.5459214
   country28 |  -.6009068   .0060234   -99.76   0.000    -.6127125    -.589101
   country29 |          0  (omitted)
   country30 |  -.5624124   .0060609   -92.79   0.000    -.5742916   -.5505333
   country31 |  -.5807141   .0052813  -109.96   0.000    -.5910652   -.5703629
   country32 |          0  (omitted)
   country33 |   -.599146   .0060975   -98.26   0.000     -.611097    -.587195
   country34 |          0  (omitted)
   country35 |  -.6046744   .0051782  -116.77   0.000    -.6148236   -.5945253
   country36 |          0  (omitted)
   country37 |  -.5867804   .0055633  -105.47   0.000    -.5976842   -.5758765
   country38 |  -.4406881   .0094036   -46.86   0.000    -.4591189   -.4222573
   country39 |          0  (omitted)
   country40 |   -.547373   .0062691   -87.31   0.000    -.5596602   -.5350857
   country41 |          0  (omitted)
   country42 |   -.413069   .0072497   -56.98   0.000    -.4272783   -.3988597
   country43 |  -.5235854   .0067799   -77.23   0.000    -.5368738    -.510297
   country44 |          0  (omitted)
   country45 |  -.5516632   .0063075   -87.46   0.000    -.5640257   -.5393007
   country46 |  -.6712759   .0058184  -115.37   0.000    -.6826797   -.6598721
       _cons |   .3563272   .0163957    21.73   0.000     .3241922    .3884622
------------------------------------------------------------------------------

. outreg2 fert agemay educf_* height bmi1 aiquin using $Base/Results/TwinPredict/pregterm_predict, excel replace 2aster
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout

. *reg twind100 $twinpredict_i [pw=sweight]
. *outreg2 agemay educf_* height bmi poor1 using $Base/Results/TwinPredict/twinpredict_table2, excel append 2aster
. *test educf_0=educf_1_4=educf_5_6=educf_7_10=height=bmi=poor1=0
. 
. *gen income_status="LOWINCOME" if incstat==1
. *replace income_status="LOWERMIDDLE" if incstat==2
. *replace income_status="UPPERMIDDLE" if incstat==3
. 
. foreach incstat in LOWINCOME LOWERMIDDLE UPPERMIDDLE{
  2.         reg terminated_preg fert agemay educf_* height bmi1 aiquin yearc country2- country46 [pw=sweight] if income_status=="`incstat'"
  3.         outreg2 fert agemay educf_* height bmi1 aiquin using $Base/Results/TwinPredict/pregterm_predict, excel append 2aster
  4.         *reg twind100 $twinpredict_i [pw=sweight] if income_status=="`incstat'"
.         *outreg2 agemay educf_* height bmi poor1 using $Base/Results/TwinPredict/twinpredict_table2, excel append 2aster
. }
(sum of wgt is   3.1450e+05)
note: country4 omitted because of collinearity
note: country7 omitted because of collinearity
note: country8 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country11 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country14 omitted because of collinearity
note: country15 omitted because of collinearity
note: country18 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country23 omitted because of collinearity
note: country27 omitted because of collinearity
note: country29 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country35 omitted because of collinearity
note: country36 omitted because of collinearity
note: country38 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity

Linear regression                                      Number of obs =  309989
                                                       F( 26,309962) =  271.07
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0281
                                                       Root MSE      =  .39296

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0042046    .000421     9.99   0.000     .0033793    .0050298
      agemay |    .005618   .0001681    33.43   0.000     .0052886    .0059475
   educf_1_4 |   .0136569   .0024576     5.56   0.000     .0088401    .0184736
   educf_5_6 |   .0069803   .0029818     2.34   0.019     .0011361    .0128245
  educf_7_10 |   .0067302   .0029169     2.31   0.021     .0010132    .0124473
educf_11plus |   -.000805   .0051097    -0.16   0.875    -.0108198    .0092099
      height |  -.0003559   .0001389    -2.56   0.010    -.0006282   -.0000837
        bmi1 |   .0023457     .00027     8.69   0.000     .0018165    .0028749
      aiquin |   .0024692   .0006608     3.74   0.000      .001174    .0037643
       yearc |  -.0031688   .0001097   -28.88   0.000    -.0033838   -.0029538
    country2 |   .1139561   .0060321    18.89   0.000     .1021335    .1257788
    country3 |   .1032818   .0070631    14.62   0.000     .0894384    .1171252
    country4 |          0  (omitted)
    country5 |   .0337909   .0057712     5.86   0.000     .0224796    .0451023
    country6 |   .0328639   .0070166     4.68   0.000     .0191116    .0466161
    country7 |          0  (omitted)
    country8 |          0  (omitted)
    country9 |          0  (omitted)
   country10 |          0  (omitted)
   country11 |          0  (omitted)
   country12 |          0  (omitted)
   country13 |          0  (omitted)
   country14 |          0  (omitted)
   country15 |          0  (omitted)
   country16 |   .0072609   .0074241     0.98   0.328    -.0072901    .0218119
   country17 |   .0136823   .0071759     1.91   0.057    -.0003823    .0277468
   country18 |          0  (omitted)
   country19 |          0  (omitted)
   country20 |          0  (omitted)
   country21 |          0  (omitted)
   country22 |  -.0325956   .0060313    -5.40   0.000    -.0444168   -.0207744
   country23 |          0  (omitted)
   country24 |   -.031227   .0063458    -4.92   0.000    -.0436646   -.0187894
   country25 |  -.0254398   .0056253    -4.52   0.000    -.0364653   -.0144144
   country26 |   .0622594   .0058448    10.65   0.000     .0508038     .073715
   country27 |          0  (omitted)
   country28 |   .0009891   .0062496     0.16   0.874      -.01126    .0132382
   country29 |          0  (omitted)
   country30 |  -.0068351   .0065044    -1.05   0.293    -.0195836    .0059133
   country31 |          0  (omitted)
   country32 |          0  (omitted)
   country33 |          0  (omitted)
   country34 |          0  (omitted)
   country35 |          0  (omitted)
   country36 |          0  (omitted)
   country37 |   .0254661   .0059175     4.30   0.000     .0138681    .0370642
   country38 |          0  (omitted)
   country39 |          0  (omitted)
   country40 |   .0562127   .0066304     8.48   0.000     .0432174     .069208
   country41 |          0  (omitted)
   country42 |          0  (omitted)
   country43 |    .088138    .007067    12.47   0.000     .0742868    .1019892
   country44 |          0  (omitted)
   country45 |          0  (omitted)
   country46 |    -.04772   .0064708    -7.37   0.000    -.0604027   -.0350374
       _cons |    6.31525   .2207766    28.60   0.000     5.882534    6.747966
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout
(sum of wgt is   4.2478e+05)
note: country2 omitted because of collinearity
note: country3 omitted because of collinearity
note: country5 omitted because of collinearity
note: country6 omitted because of collinearity
note: country8 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country16 omitted because of collinearity
note: country17 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country22 omitted because of collinearity
note: country24 omitted because of collinearity
note: country25 omitted because of collinearity
note: country26 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country35 omitted because of collinearity
note: country36 omitted because of collinearity
note: country37 omitted because of collinearity
note: country39 omitted because of collinearity
note: country40 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country43 omitted because of collinearity
note: country44 omitted because of collinearity
note: country46 omitted because of collinearity

Linear regression                                      Number of obs =  434611
                                                       F( 23,434587) = 1123.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0573
                                                       Root MSE      =  .42194

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0096795   .0004145    23.35   0.000      .008867     .010492
      agemay |   .0065023   .0001585    41.01   0.000     .0061916    .0068131
   educf_1_4 |   .0264676   .0024518    10.80   0.000     .0216622     .031273
   educf_5_6 |   .0178021   .0025681     6.93   0.000     .0127686    .0228355
  educf_7_10 |   .0214201   .0026029     8.23   0.000     .0163186    .0265217
educf_11plus |   .0070652   .0029016     2.43   0.015      .001378    .0127523
      height |  -.0006967    .000124    -5.62   0.000    -.0009398   -.0004536
        bmi1 |   .0014704   .0001674     8.78   0.000     .0011422    .0017985
      aiquin |   .0071836   .0006314    11.38   0.000      .005946    .0084212
       yearc |  -.0044283    .000131   -33.82   0.000     -.004685   -.0041717
    country2 |          0  (omitted)
    country3 |          0  (omitted)
    country4 |  -.5815951   .0060332   -96.40   0.000    -.5934199   -.5697702
    country5 |          0  (omitted)
    country6 |          0  (omitted)
    country7 |  -.4998116   .0070279   -71.12   0.000    -.5135861   -.4860371
    country8 |          0  (omitted)
    country9 |          0  (omitted)
   country10 |          0  (omitted)
   country11 |  -.4571143   .0082718   -55.26   0.000    -.4733269   -.4409018
   country12 |          0  (omitted)
   country13 |          0  (omitted)
   country14 |  -.5428651   .0050822  -106.82   0.000     -.552826   -.5329041
   country15 |  -.6079677   .0063736   -95.39   0.000    -.6204597   -.5954757
   country16 |          0  (omitted)
   country17 |          0  (omitted)
   country18 |  -.5788306   .0058736   -98.55   0.000    -.5903426   -.5673186
   country19 |  -.5757215   .0051347  -112.12   0.000    -.5857853   -.5656577
   country20 |          0  (omitted)
   country21 |          0  (omitted)
   country22 |          0  (omitted)
   country23 |  -.6892418   .0072842   -94.62   0.000    -.7035186    -.674965
   country24 |          0  (omitted)
   country25 |          0  (omitted)
   country26 |          0  (omitted)
   country27 |  -.5717236   .0056247  -101.64   0.000     -.582748   -.5606993
   country28 |          0  (omitted)
   country29 |          0  (omitted)
   country30 |          0  (omitted)
   country31 |  -.5984562   .0054211  -110.39   0.000    -.6090813   -.5878311
   country32 |          0  (omitted)
   country33 |  -.6233512   .0062888   -99.12   0.000    -.6356771   -.6110253
   country34 |          0  (omitted)
   country35 |          0  (omitted)
   country36 |          0  (omitted)
   country37 |          0  (omitted)
   country38 |  -.4664743   .0095885   -48.65   0.000    -.4852674   -.4476811
   country39 |          0  (omitted)
   country40 |          0  (omitted)
   country41 |          0  (omitted)
   country42 |          0  (omitted)
   country43 |          0  (omitted)
   country44 |          0  (omitted)
   country45 |  -.5789199   .0064726   -89.44   0.000     -.591606   -.5662338
   country46 |          0  (omitted)
       _cons |   9.460551   .2614595    36.18   0.000     8.948098    9.973004
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout
(sum of wgt is   1.2336e+05)
note: country2 omitted because of collinearity
note: country3 omitted because of collinearity
note: country4 omitted because of collinearity
note: country5 omitted because of collinearity
note: country6 omitted because of collinearity
note: country7 omitted because of collinearity
note: country8 omitted because of collinearity
note: country10 omitted because of collinearity
note: country11 omitted because of collinearity
note: country12 omitted because of collinearity
note: country14 omitted because of collinearity
note: country15 omitted because of collinearity
note: country16 omitted because of collinearity
note: country17 omitted because of collinearity
note: country18 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country22 omitted because of collinearity
note: country23 omitted because of collinearity
note: country24 omitted because of collinearity
note: country25 omitted because of collinearity
note: country26 omitted because of collinearity
note: country27 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country37 omitted because of collinearity
note: country38 omitted because of collinearity
note: country39 omitted because of collinearity
note: country40 omitted because of collinearity
note: country41 omitted because of collinearity
note: country43 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity
note: country46 omitted because of collinearity

Linear regression                                      Number of obs =  129785
                                                       F( 14,129770) =  433.31
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0624
                                                       Root MSE      =  .42535

------------------------------------------------------------------------------
             |               Robust
terminated~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0059784   .0008632     6.93   0.000     .0042866    .0076702
      agemay |   .0065845   .0003089    21.31   0.000     .0059791      .00719
   educf_1_4 |   .0398695   .0054605     7.30   0.000     .0291671    .0505719
   educf_5_6 |   .0452761   .0055089     8.22   0.000     .0344789    .0560734
  educf_7_10 |   .0589314   .0062656     9.41   0.000      .046651    .0712118
educf_11plus |   .0555676   .0065731     8.45   0.000     .0426845    .0684507
      height |   .0020409   .0002711     7.53   0.000     .0015096    .0025723
        bmi1 |   .0044994   .0003603    12.49   0.000     .0037932    .0052055
      aiquin |   .0067401   .0013086     5.15   0.000     .0041754    .0093049
       yearc |  -.0060861   .0002943   -20.68   0.000     -.006663   -.0055092
    country2 |          0  (omitted)
    country3 |          0  (omitted)
    country4 |          0  (omitted)
    country5 |          0  (omitted)
    country6 |          0  (omitted)
    country7 |          0  (omitted)
    country8 |          0  (omitted)
    country9 |  -.3159285   .0090662   -34.85   0.000     -.333698   -.2981589
   country10 |          0  (omitted)
   country11 |          0  (omitted)
   country12 |          0  (omitted)
   country13 |  -.3177376   .0129811   -24.48   0.000    -.3431804   -.2922949
   country14 |          0  (omitted)
   country15 |          0  (omitted)
   country16 |          0  (omitted)
   country17 |          0  (omitted)
   country18 |          0  (omitted)
   country19 |          0  (omitted)
   country20 |          0  (omitted)
   country21 |          0  (omitted)
   country22 |          0  (omitted)
   country23 |          0  (omitted)
   country24 |          0  (omitted)
   country25 |          0  (omitted)
   country26 |          0  (omitted)
   country27 |          0  (omitted)
   country28 |          0  (omitted)
   country29 |          0  (omitted)
   country30 |          0  (omitted)
   country31 |          0  (omitted)
   country32 |          0  (omitted)
   country33 |          0  (omitted)
   country34 |          0  (omitted)
   country35 |   -.383815   .0090542   -42.39   0.000    -.4015611   -.3660689
   country36 |          0  (omitted)
   country37 |          0  (omitted)
   country38 |          0  (omitted)
   country39 |          0  (omitted)
   country40 |          0  (omitted)
   country41 |          0  (omitted)
   country42 |  -.1949096   .0104986   -18.57   0.000    -.2154867   -.1743325
   country43 |          0  (omitted)
   country44 |          0  (omitted)
   country45 |          0  (omitted)
   country46 |          0  (omitted)
       _cons |   12.02019   .5866783    20.49   0.000     10.87031    13.17007
------------------------------------------------------------------------------
~/investigacion/Activa/Twins/Results/TwinPredict/pregterm_predict.xml
dir : seeout

. 
end of do-file

. tab terminated_preg

 ever had a |
 terminated |
      preg. |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |    721,331       76.40       76.40
        yes |    222,812       23.60      100.00
------------+-----------------------------------
      Total |    944,143      100.00

. tab terminated_preg, nolab

 ever had a |
 terminated |
      preg. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    721,331       76.40       76.40
          1 |    222,812       23.60      100.00
------------+-----------------------------------
      Total |    944,143      100.00

. bys terminated_preg sum bmi1
: required
r(100);

. bys terminated_preg: sum bmi1

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = no

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    668271    23.57223    5.102294      12.02      59.93

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = yes

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    207671    24.42753    5.540875      12.08      59.87

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    151197    22.33937    3.929696      12.01      59.98


. bys terminated_preg: sum bmi

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = no

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         bmi |    719577    23.57962    5.040928      12.02      59.93

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = yes

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         bmi |    222320    24.42808    5.492542      12.08      59.87

-------------------------------------------------------------------------------------------------------------------------------------------------
-> terminated_preg = .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         bmi |    169310    22.39345    3.867981      12.01      59.98


. count
1114015

. bys caseid2: gen m_term_preg=max(terminated_preg)
invalid syntax
r(198);

. bys caseid2: egen m_term_preg=max(terminated_preg)
(169872 missing values generated)

. tab m_t

m_term_preg |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    721,331       76.40       76.40
          1 |    222,812       23.60      100.00
------------+-----------------------------------
      Total |    944,143      100.00

. bys m_term: sum bmi1

-------------------------------------------------------------------------------------------------------------------------------------------------
-> m_term_preg = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    668271    23.57223    5.102294      12.02      59.93

-------------------------------------------------------------------------------------------------------------------------------------------------
-> m_term_preg = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    207671    24.42753    5.540875      12.08      59.87

-------------------------------------------------------------------------------------------------------------------------------------------------
-> m_term_preg = .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        bmi1 |    151197    22.33937    3.929696      12.01      59.98


. br

. sort caseid2

. br

. order fert

. order bmi height

. bys caseid2, sort yearc
: required
r(100);

. bys caseid2: sort yearc
sort may not be combined with by
r(190);

. sort caseid2 yearc

. bys caseid2: egen firstbirthyear=min(yearc)

. tab firstbirth

firstbirthy |
        ear |      Freq.     Percent        Cum.
------------+-----------------------------------
       1924 |          2        0.00        0.00
       1928 |         13        0.00        0.00
       1929 |         19        0.00        0.00
       1930 |         17        0.00        0.00
       1931 |         36        0.00        0.01
       1932 |         73        0.01        0.01
       1933 |         65        0.01        0.02
       1934 |        109        0.01        0.03
       1935 |        121        0.01        0.04
       1936 |        168        0.02        0.06
       1937 |        254        0.02        0.08
       1938 |        289        0.03        0.10
       1939 |        224        0.02        0.12
       1940 |        440        0.04        0.16
       1941 |        339        0.03        0.19
       1942 |        363        0.03        0.23
       1943 |        421        0.04        0.27
       1944 |        398        0.04        0.30
       1945 |        509        0.05        0.35
       1946 |        449        0.04        0.39
       1947 |        563        0.05        0.44
       1948 |        580        0.05        0.49
       1949 |        478        0.04        0.53
       1950 |        483        0.04        0.58
       1951 |        367        0.03        0.61
       1952 |        358        0.03        0.64
       1953 |          6        0.00        0.64
       1959 |          5        0.00        0.64
       1961 |         28        0.00        0.64
       1962 |         69        0.01        0.65
       1963 |        115        0.01        0.66
       1964 |        281        0.03        0.69
       1965 |        401        0.04        0.72
       1966 |        826        0.07        0.80
       1967 |      1,036        0.09        0.89
       1968 |      1,932        0.17        1.06
       1969 |      2,157        0.19        1.26
       1970 |      3,809        0.34        1.60
       1971 |      4,893        0.44        2.04
       1972 |      7,092        0.64        2.67
       1973 |     10,236        0.92        3.59
       1974 |     11,764        1.06        4.65
       1975 |     15,709        1.41        6.06
       1976 |     19,101        1.71        7.77
       1977 |     22,153        1.99        9.76
       1978 |     27,583        2.48       12.24
       1979 |     31,161        2.80       15.04
       1980 |     38,820        3.48       18.52
       1981 |     39,810        3.57       22.09
       1982 |     46,302        4.16       26.25
       1983 |     48,484        4.35       30.60
       1984 |     50,872        4.57       35.17
       1985 |     54,494        4.89       40.06
       1986 |     56,461        5.07       45.13
       1987 |     55,514        4.98       50.11
       1988 |     58,024        5.21       55.32
       1989 |     53,795        4.83       60.15
       1990 |     55,477        4.98       65.13
       1991 |     50,805        4.56       69.69
       1992 |     47,996        4.31       74.00
       1993 |     45,149        4.05       78.05
       1994 |     41,686        3.74       81.79
       1995 |     38,817        3.48       85.28
       1996 |     34,710        3.12       88.39
       1997 |     30,151        2.71       91.10
       1998 |     25,439        2.28       93.38
       1999 |     20,560        1.85       95.23
       2000 |     17,029        1.53       96.76
       2001 |     11,712        1.05       97.81
       2002 |      9,431        0.85       98.66
       2003 |      8,142        0.73       99.39
       2004 |      5,009        0.45       99.84
       2005 |      1,736        0.16       99.99
       2006 |         95        0.01      100.00
------------+-----------------------------------
      Total |  1,114,015      100.00

. count
1114015

. bys caseid2: egen lastbirthyear=max(yearc)

. tab lastbir

lastbirthye |
         ar |      Freq.     Percent        Cum.
------------+-----------------------------------
       1928 |          1        0.00        0.00
       1935 |          3        0.00        0.00
       1936 |          3        0.00        0.00
       1937 |          1        0.00        0.00
       1938 |          3        0.00        0.00
       1940 |          5        0.00        0.00
       1941 |          5        0.00        0.00
       1942 |         16        0.00        0.00
       1943 |         21        0.00        0.01
       1944 |         15        0.00        0.01
       1945 |         37        0.00        0.01
       1946 |         50        0.00        0.01
       1947 |         95        0.01        0.02
       1948 |        117        0.01        0.03
       1949 |        196        0.02        0.05
       1950 |      1,599        0.14        0.19
       1951 |      2,469        0.22        0.42
       1952 |      2,451        0.22        0.64
       1953 |         57        0.01        0.64
       1963 |          4        0.00        0.64
       1964 |          7        0.00        0.64
       1965 |          9        0.00        0.64
       1966 |         24        0.00        0.65
       1967 |         31        0.00        0.65
       1968 |         89        0.01        0.66
       1969 |         80        0.01        0.66
       1970 |        141        0.01        0.68
       1971 |        192        0.02        0.69
       1972 |        315        0.03        0.72
       1973 |        540        0.05        0.77
       1974 |        641        0.06        0.83
       1975 |        847        0.08        0.90
       1976 |      1,301        0.12        1.02
       1977 |      1,447        0.13        1.15
       1978 |      2,106        0.19        1.34
       1979 |      2,497        0.22        1.56
       1980 |      3,944        0.35        1.92
       1981 |      4,326        0.39        2.31
       1982 |      6,017        0.54        2.85
       1983 |      7,404        0.66        3.51
       1984 |      9,193        0.83        4.34
       1985 |     10,535        0.95        5.28
       1986 |     13,779        1.24        6.52
       1987 |     17,589        1.58        8.10
       1988 |     26,179        2.35       10.45
       1989 |     32,967        2.96       13.41
       1990 |     45,501        4.08       17.49
       1991 |     56,464        5.07       22.56
       1992 |     61,640        5.53       28.09
       1993 |     58,929        5.29       33.38
       1994 |     71,418        6.41       39.79
       1995 |     79,916        7.17       46.97
       1996 |     83,783        7.52       54.49
       1997 |     82,892        7.44       61.93
       1998 |     81,617        7.33       69.25
       1999 |     72,511        6.51       75.76
       2000 |     65,821        5.91       81.67
       2001 |     48,982        4.40       86.07
       2002 |     52,051        4.67       90.74
       2003 |     55,113        4.95       95.69
       2004 |     35,116        3.15       98.84
       2005 |     12,278        1.10       99.94
       2006 |        635        0.06      100.00
------------+-----------------------------------
      Total |  1,114,015      100.00

. do "/tmp/SD01964.000000"

. reg terminated_preg fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth country2- country46 [pw=sweight]
(sum of wgt is   8.6265e+05)
note: 2006.lastbirthyear omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  874385
                                                       F(174,874208) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0525
                                                       Root MSE      =  .41214

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
          fert |   .0034534   .0003462     9.97   0.000     .0027748    .0041319
        agemay |   .0040346   .0001011    39.89   0.000     .0038363    .0042328
     educf_1_4 |   .0185202   .0016315    11.35   0.000     .0153225    .0217178
     educf_5_6 |   .0132624   .0017986     7.37   0.000     .0097371    .0167876
    educf_7_10 |    .018026   .0018418     9.79   0.000     .0144162    .0216358
  educf_11plus |   .0164191   .0022619     7.26   0.000     .0119858    .0208523
        height |  -.0002889   .0000879    -3.29   0.001    -.0004612   -.0001166
          bmi1 |    .002204   .0001323    16.66   0.000     .0019447    .0024633
        aiquin |   .0050622   .0004334    11.68   0.000     .0042127    .0059117
               |
firstbirthyear |
         1928  |   .6074201   .1729457     3.51   0.000     .2684522     .946388
         1929  |   .0239908   .0383461     0.63   0.532    -.0511664    .0991479
         1930  |   .4775089   .1368109     3.49   0.000      .209364    .7456538
         1931  |   .1939382   .0921883     2.10   0.035     .0132522    .3746242
         1932  |   .1786322   .0609795     2.93   0.003     .0591143      .29815
         1933  |   .1569167   .0611113     2.57   0.010     .0371405    .2766929
         1934  |   .1543403   .0486791     3.17   0.002     .0589309    .2497496
         1935  |   .2960159   .0566469     5.23   0.000     .1849899    .4070419
         1936  |   .3429107   .0542815     6.32   0.000     .2365208    .4493005
         1937  |   .3243498   .0482863     6.72   0.000     .2297101    .4189894
         1938  |   .2202785   .0455752     4.83   0.000     .1309526    .3096045
         1939  |   .3265049   .0505251     6.46   0.000     .2274774    .4255324
         1940  |   .2593699   .0438393     5.92   0.000     .1734464    .3452935
         1941  |   .2518666   .0449367     5.60   0.000     .1637922     .339941
         1942  |    .215238   .0429999     5.01   0.000     .1309596    .2995164
         1943  |   .2579815   .0439613     5.87   0.000     .1718188    .3441442
         1944  |   .2188876   .0430372     5.09   0.000     .1345361    .3032391
         1945  |   .2602913   .0430978     6.04   0.000      .175821    .3447616
         1946  |   .2106963   .0431093     4.89   0.000     .1262035    .2951892
         1947  |   .2510589   .0423255     5.93   0.000     .1681024    .3340155
         1948  |   .2164468   .0416335     5.20   0.000     .1348465    .2980472
         1949  |   .2696917   .0440863     6.12   0.000      .183284    .3560994
         1950  |    .201474   .0418916     4.81   0.000     .1193679      .28358
         1951  |   .1800718   .0437366     4.12   0.000     .0943496     .265794
         1952  |   .1836876   .0429387     4.28   0.000     .0995292    .2678461
         1953  |   .1722124   .1645892     1.05   0.295     -.150377    .4948018
         1962  |  -.0120974   .2011304    -0.06   0.952    -.4063062    .3821115
         1963  |  -.1107403   .1848188    -0.60   0.549    -.4729791    .2514984
         1964  |  -.0682267    .181417    -0.38   0.707     -.423798    .2873446
         1965  |  -.0545742   .1772086    -0.31   0.758    -.4018971    .2927487
         1966  |   .0149154   .1758581     0.08   0.932    -.3297606    .3595914
         1967  |   -.030561    .175363    -0.17   0.862    -.3742665    .3131446
         1968  |  -.1496098   .1745263    -0.86   0.391    -.4916755     .192456
         1969  |  -.0276874   .1746161    -0.16   0.874    -.3699291    .3145543
         1970  |  -.1181767   .1743302    -0.68   0.498     -.459858    .2235046
         1971  |  -.0883157    .174287    -0.51   0.612    -.4299123     .253281
         1972  |   -.085944   .1742402    -0.49   0.622    -.4274491     .255561
         1973  |  -.0992113   .1741291    -0.57   0.569    -.4404986    .2420759
         1974  |  -.1218614   .1741176    -0.70   0.484    -.4631261    .2194033
         1975  |   -.128723     .17409    -0.74   0.460    -.4699337    .2124876
         1976  |   -.118882   .1740772    -0.68   0.495    -.4600674    .2223035
         1977  |  -.1254544   .1740734    -0.72   0.471    -.4666326    .2157237
         1978  |  -.1309906   .1740621    -0.75   0.452    -.4721464    .2101653
         1979  |  -.1251672   .1740573    -0.72   0.472    -.4663136    .2159793
         1980  |  -.1322116   .1740505    -0.76   0.447    -.4733447    .2089216
         1981  |  -.1301282   .1740521    -0.75   0.455    -.4712644     .211008
         1982  |  -.1351277   .1740485    -0.78   0.438    -.4762569    .2060015
         1983  |  -.1384403    .174046    -0.80   0.426    -.4795646     .202684
         1984  |  -.1404504   .1740472    -0.81   0.420    -.4815771    .2006762
         1985  |  -.1504969   .1740465    -0.86   0.387    -.4916223    .1906285
         1986  |  -.1572268    .174047    -0.90   0.366    -.4983533    .1838996
         1987  |   -.161461   .1740476    -0.93   0.354    -.5025885    .1796666
         1988  |  -.1607073   .1740468    -0.92   0.356    -.5018333    .1804187
         1989  |  -.1669875   .1740493    -0.96   0.337    -.5081183    .1741433
         1990  |  -.1811316   .1740519    -1.04   0.298    -.5222674    .1600043
         1991  |  -.1857123   .1740541    -1.07   0.286    -.5268526     .155428
         1992  |   -.190103   .1740555    -1.09   0.275     -.531246    .1510401
         1993  |  -.1979754   .1740576    -1.14   0.255    -.5391225    .1431718
         1994  |  -.2011435   .1740614    -1.16   0.248     -.542298     .140011
         1995  |  -.2092285    .174062    -1.20   0.229    -.5503843    .1319273
         1996  |  -.2191426   .1740649    -1.26   0.208     -.560304    .1220188
         1997  |   -.224175   .1740737    -1.29   0.198    -.5653535    .1170036
         1998  |  -.2347528   .1740729    -1.35   0.177    -.5759298    .1064242
         1999  |   -.232332   .1740812    -1.33   0.182    -.5735254    .1088613
         2000  |  -.2469397   .1740822    -1.42   0.156     -.588135    .0942556
         2001  |  -.2446932   .1741024    -1.41   0.160    -.5859281    .0965417
         2002  |  -.2609768   .1741037    -1.50   0.134    -.6022142    .0802606
         2003  |   -.269882   .1741189    -1.55   0.121    -.6111492    .0713853
         2004  |  -.2851808   .1741803    -1.64   0.102    -.6265683    .0562067
         2005  |  -.2754411   .1744577    -1.58   0.114    -.6173725    .0664902
         2006  |  -.2988993   .1760468    -1.70   0.090    -.6439452    .0461466
               |
 lastbirthyear |
         1935  |   .4204828   .1881473     2.23   0.025     .0517204    .7892453
         1936  |   .0050279   .0069464     0.72   0.469    -.0085869    .0186427
         1937  |  -.7386953   .1710398    -4.32   0.000    -1.073928    -.403463
         1938  |   .1648976   .2925669     0.56   0.573    -.4085237    .7383189
         1940  |  -.5011784   .2217112    -2.26   0.024     -.935725   -.0666318
         1941  |   .1593428   .2350992     0.68   0.498    -.3014438    .6201294
         1942  |  -.1104899   .2119858    -0.52   0.602     -.525975    .3049951
         1943  |  -.4050112   .1985183    -2.04   0.041    -.7941005    -.015922
         1944  |  -.4149341   .1977644    -2.10   0.036    -.8025458   -.0273224
         1945  |  -.5040793   .1823407    -2.76   0.006     -.861461   -.1466977
         1946  |  -.4907447   .1786537    -2.75   0.006       -.8409   -.1405895
         1947  |  -.5195415    .173022    -3.00   0.003    -.8586588   -.1804243
         1948  |  -.4544125   .1736961    -2.62   0.009    -.7948511    -.113974
         1949  |  -.4970302   .1712129    -2.90   0.004    -.8326017   -.1614587
         1950  |  -.4472358   .1689246    -2.65   0.008    -.7783225   -.1161491
         1951  |  -.4380494   .1684083    -2.60   0.009     -.768124   -.1079749
         1952  |  -.4589653   .1688245    -2.72   0.007    -.7898557   -.1280748
         1953  |  -.3686045   .1799387    -2.05   0.041    -.7212783   -.0159307
         1963  |   .1512949   .2966261     0.51   0.610    -.4300824    .7326722
         1964  |   -.325439   .0640775    -5.08   0.000    -.4510287   -.1998494
         1965  |   .1858431   .1759378     1.06   0.291    -.1589892    .5306754
         1966  |  -.0459515   .1168295    -0.39   0.694    -.2749334    .1830304
         1967  |  -.1589929   .0813734    -1.95   0.051    -.3184822    .0004963
         1968  |  -.0528701   .0504736    -1.05   0.295    -.1517968    .0460565
         1969  |  -.1445392   .0509151    -2.84   0.005     -.244331   -.0447474
         1970  |  -.0498695   .0451751    -1.10   0.270    -.1384112    .0386722
         1971  |  -.1017239   .0372287    -2.73   0.006    -.1746909   -.0287569
         1972  |  -.0598095   .0322426    -1.85   0.064    -.1230038    .0033848
         1973  |  -.0330746   .0291627    -1.13   0.257    -.0902325    .0240834
         1974  |  -.0407796   .0305573    -1.33   0.182    -.1006709    .0191118
         1975  |  -.0359354   .0253978    -1.41   0.157    -.0857143    .0138435
         1976  |  -.0614542   .0231102    -2.66   0.008    -.1067494   -.0161589
         1977  |  -.0266095   .0231228    -1.15   0.250    -.0719294    .0187104
         1978  |   -.047287   .0217804    -2.17   0.030    -.0899759   -.0045981
         1979  |  -.0466119   .0217109    -2.15   0.032    -.0891646   -.0040592
         1980  |   -.011795   .0207326    -0.57   0.569    -.0524303    .0288402
         1981  |  -.0130821   .0206912    -0.63   0.527    -.0536362     .027472
         1982  |  -.0121377   .0201969    -0.60   0.548     -.051723    .0274475
         1983  |  -.0142304   .0200912    -0.71   0.479    -.0536085    .0251476
         1984  |   -.017655   .0197687    -0.89   0.372    -.0564011    .0210911
         1985  |  -.0053799    .019709    -0.27   0.785    -.0440089    .0332491
         1986  |  -.0137559   .0195149    -0.70   0.481    -.0520044    .0244925
         1987  |  -.0036316   .0194052    -0.19   0.852    -.0416651    .0344019
         1988  |  -.0150733   .0192629    -0.78   0.434    -.0528279    .0226814
         1989  |  -.0056912   .0192112    -0.30   0.767    -.0433446    .0319622
         1990  |   .0011494   .0191336     0.06   0.952    -.0363518    .0386506
         1991  |   .0032945   .0190904     0.17   0.863    -.0341221    .0407111
         1992  |   .0012409   .0190418     0.07   0.948    -.0360805    .0385622
         1993  |   .0051954   .0190367     0.27   0.785     -.032116    .0425067
         1994  |  -.0004361   .0189937    -0.02   0.982    -.0376631    .0367908
         1995  |   .0074095   .0189762     0.39   0.696    -.0297832    .0446021
         1996  |   .0010445   .0189583     0.06   0.956    -.0361131     .038202
         1997  |   .0002252    .018944     0.01   0.991    -.0369044    .0373549
         1998  |   .0004262   .0189282     0.02   0.982    -.0366724    .0375249
         1999  |  -.0043099   .0189213    -0.23   0.820     -.041395    .0327752
         2000  |  -.0110216    .018911    -0.58   0.560    -.0480867    .0260434
         2001  |   .0006515   .0189422     0.03   0.973    -.0364746    .0377776
         2002  |   .0020917   .0189103     0.11   0.912     -.034972    .0391553
         2003  |   .0033339   .0188951     0.18   0.860    -.0336999    .0403677
         2004  |    .008881   .0189681     0.47   0.640    -.0282959    .0460579
         2005  |  -.0083524    .019202    -0.43   0.664    -.0459877     .029283
         2006  |          0  (omitted)
               |
      country2 |  -.5103529   .0056141   -90.91   0.000    -.5213562   -.4993495
      country3 |  -.5072356   .0069537   -72.95   0.000    -.5208645   -.4936066
      country4 |   -.566606   .0058959   -96.10   0.000    -.5781618   -.5550503
      country5 |  -.5835939   .0056931  -102.51   0.000    -.5947522   -.5724357
      country6 |  -.5904809   .0066104   -89.33   0.000     -.603437   -.5775247
      country7 |  -.4860081   .0069015   -70.42   0.000    -.4995347   -.4724814
      country8 |  -.6104231   .0072053   -84.72   0.000    -.6245452   -.5963009
      country9 |   -.534918    .005253  -101.83   0.000    -.5452136   -.5246224
     country10 |          0  (omitted)
     country11 |  -.4392795   .0082314   -53.37   0.000    -.4554129   -.4231462
     country12 |          0  (omitted)
     country13 |  -.5310689   .0110831   -47.92   0.000    -.5527914   -.5093464
     country14 |  -.5401056   .0049759  -108.54   0.000    -.5498583    -.530353
     country15 |  -.5937497   .0062749   -94.62   0.000    -.6060483   -.5814511
     country16 |  -.6005358   .0074452   -80.66   0.000    -.6151281   -.5859435
     country17 |   -.605499   .0070236   -86.21   0.000     -.619265    -.591733
     country18 |  -.5615803   .0057305   -98.00   0.000    -.5728119   -.5503487
     country19 |  -.5652023   .0049601  -113.95   0.000     -.574924   -.5554807
     country20 |          0  (omitted)
     country21 |  -.1811468   .0092375   -19.61   0.000    -.1992519   -.1630417
     country22 |  -.6580736   .0055149  -119.33   0.000    -.6688827   -.6472645
     country23 |  -.6822685   .0072352   -94.30   0.000    -.6964493   -.6680877
     country24 |  -.6491004   .0059764  -108.61   0.000     -.660814   -.6373868
     country25 |  -.6408142    .005321  -120.43   0.000    -.6512431   -.6303853
     country26 |  -.5564109   .0057488   -96.79   0.000    -.5676784   -.5451434
     country27 |  -.5610838   .0055084  -101.86   0.000    -.5718801   -.5502875
     country28 |  -.6107869   .0060822  -100.42   0.000    -.6227079   -.5988659
     country29 |          0  (omitted)
     country30 |   -.566166   .0060943   -92.90   0.000    -.5781107   -.5542213
     country31 |  -.5880109   .0053005  -110.94   0.000    -.5983997   -.5776221
     country32 |          0  (omitted)
     country33 |  -.6104246   .0061382   -99.45   0.000    -.6224553   -.5983939
     country34 |          0  (omitted)
     country35 |  -.6100819   .0052159  -116.96   0.000     -.620305   -.5998588
     country36 |          0  (omitted)
     country37 |  -.5899106    .005617  -105.02   0.000    -.6009198   -.5789014
     country38 |  -.4507522   .0094391   -47.75   0.000    -.4692525   -.4322518
     country39 |          0  (omitted)
     country40 |  -.5593836    .006345   -88.16   0.000    -.5718196   -.5469475
     country41 |          0  (omitted)
     country42 |  -.4209118   .0072847   -57.78   0.000    -.4351895    -.406634
     country43 |  -.5297511   .0068297   -77.57   0.000    -.5431371   -.5163651
     country44 |          0  (omitted)
     country45 |  -.5611784   .0063635   -88.19   0.000    -.5736506   -.5487061
     country46 |  -.6784794    .005871  -115.56   0.000    -.6899863   -.6669724
         _cons |    .819518   .1736826     4.72   0.000     .4791059     1.15993
--------------------------------------------------------------------------------

. 
end of do-file

. tab aiquin

asset index |
  quintiles |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    243,527       21.89       21.89
          2 |    236,884       21.30       43.19
          3 |    229,511       20.63       63.82
          4 |    213,694       19.21       83.04
          5 |    188,685       16.96      100.00
------------+-----------------------------------
      Total |  1,112,301      100.00

. bys aiquin: sum edulevel

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |    242649    .4311042    .6200153          0          3

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = 2

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |    236126     .513929    .6785145          0          3

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = 3

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |    228849    .5975032    .7403585          0          3

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = 4

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |    213151    .6987394    .8066369          0          3

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = 5

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |    188305    .8564138    .8922709          0          3

--------------------------------------------------------------------------------------------------------------------------------
-> aiquin = .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    edulevel |      1706     .440211    .6051594          0          3


. tab urban

    type of |
   place of |
  residence |      Freq.     Percent        Cum.
------------+-----------------------------------
      urban |    385,219       34.58       34.58
      rural |    728,796       65.42      100.00
------------+-----------------------------------
      Total |  1,114,015      100.00

. do "/tmp/SD01964.000000"

. reg terminated_preg urban fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth country2- country46 [pw=sweight]
(sum of wgt is   8.6265e+05)
note: 2006.lastbirthyear omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  874385
                                                       F(175,874207) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0528
                                                       Root MSE      =  .41208

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         urban |  -.0198131   .0013981   -14.17   0.000    -.0225532   -.0170729
          fert |   .0037866    .000347    10.91   0.000     .0031064    .0044668
        agemay |    .004008   .0001012    39.62   0.000     .0038098    .0042063
     educf_1_4 |   .0184848   .0016314    11.33   0.000     .0152873    .0216822
     educf_5_6 |   .0120497    .001799     6.70   0.000     .0085236    .0155757
    educf_7_10 |   .0156697   .0018468     8.48   0.000     .0120501    .0192893
  educf_11plus |   .0127133   .0022786     5.58   0.000     .0082473    .0171793
        height |  -.0002942   .0000879    -3.35   0.001    -.0004665   -.0001218
          bmi1 |   .0020355   .0001328    15.33   0.000     .0017752    .0022958
        aiquin |   .0023769   .0004743     5.01   0.000     .0014473    .0033066
               |
firstbirthyear |
         1928  |   .6007909   .1727843     3.48   0.001     .2621395    .9394423
         1929  |   .0199272   .0381199     0.52   0.601    -.0547865    .0946408
         1930  |   .4778368   .1367885     3.49   0.000     .2097359    .7459377
         1931  |   .1935826   .0920201     2.10   0.035     .0132263    .3739388
         1932  |    .175395   .0607044     2.89   0.004     .0564164    .2943735
         1933  |   .1547409   .0608589     2.54   0.011     .0354594    .2740225
         1934  |   .1523393   .0485295     3.14   0.002     .0572231    .2474556
         1935  |   .2933276   .0564941     5.19   0.000     .1826011    .4040541
         1936  |   .3404905   .0541054     6.29   0.000     .2344456    .4465353
         1937  |   .3224069   .0480586     6.71   0.000     .2282138    .4166001
         1938  |   .2174787   .0453586     4.79   0.000     .1285772    .3063801
         1939  |   .3235964   .0503551     6.43   0.000     .2249021    .4222908
         1940  |   .2572192   .0436457     5.89   0.000     .1716751    .3427633
         1941  |   .2503718   .0447215     5.60   0.000     .1627191    .3380245
         1942  |   .2134017   .0427755     4.99   0.000     .1295631    .2972404
         1943  |   .2559888   .0437583     5.85   0.000      .170224    .3417537
         1944  |   .2170804   .0428125     5.07   0.000     .1331694    .3009914
         1945  |   .2592477   .0428696     6.05   0.000     .1752247    .3432707
         1946  |   .2094305   .0428944     4.88   0.000     .1253589    .2935021
         1947  |   .2493755   .0421188     5.92   0.000      .166824     .331927
         1948  |   .2151279   .0414056     5.20   0.000     .1339743    .2962814
         1949  |   .2684795   .0438784     6.12   0.000     .1824792    .3544797
         1950  |   .2007167   .0416808     4.82   0.000     .1190238    .2824097
         1951  |   .1793605   .0435282     4.12   0.000     .0940467    .2646742
         1952  |   .1829286   .0427178     4.28   0.000     .0992032     .266654
         1953  |   .1722084   .1644871     1.05   0.295    -.1501807    .4945976
         1962  |  -.0031481   .2008372    -0.02   0.987    -.3967823     .390486
         1963  |  -.0978332   .1847692    -0.53   0.596    -.4599747    .2643083
         1964  |  -.0571366   .1814082    -0.31   0.753    -.4126906    .2984174
         1965  |  -.0465315   .1770658    -0.26   0.793    -.3935746    .3005116
         1966  |   .0249586    .175696     0.14   0.887    -.3193996    .3693169
         1967  |  -.0204001   .1752027    -0.12   0.907    -.3637915    .3229914
         1968  |  -.1392315   .1743651    -0.80   0.425    -.4809813    .2025183
         1969  |  -.0175012   .1744581    -0.10   0.920    -.3594333    .3244309
         1970  |   -.108243   .1741689    -0.62   0.534    -.4496082    .2331222
         1971  |  -.0781931   .1741256    -0.45   0.653    -.4194736    .2630873
         1972  |   -.076365   .1740797    -0.44   0.661    -.4175554    .2648253
         1973  |  -.0893734   .1739683    -0.51   0.607    -.4303455    .2515988
         1974  |  -.1119013   .1739568    -0.64   0.520    -.4528509    .2290483
         1975  |  -.1187179   .1739294    -0.68   0.495    -.4596137    .2221779
         1976  |  -.1087546   .1739165    -0.63   0.532    -.4496251    .2321159
         1977  |  -.1151773   .1739127    -0.66   0.508    -.4560405    .2256858
         1978  |  -.1206001   .1739015    -0.69   0.488    -.4614411     .220241
         1979  |  -.1147335   .1738966    -0.66   0.509    -.4555651    .2260981
         1980  |  -.1215819     .17389    -0.70   0.484    -.4624004    .2192366
         1981  |  -.1195166   .1738914    -0.69   0.492     -.460338    .2213048
         1982  |  -.1244276   .1738879    -0.72   0.474    -.4652421    .2163868
         1983  |  -.1277334   .1738854    -0.73   0.463     -.468543    .2130762
         1984  |   -.129452   .1738868    -0.74   0.457    -.4702643    .2113602
         1985  |  -.1395942   .1738861    -0.80   0.422    -.4804051    .2012168
         1986  |  -.1461314   .1738866    -0.84   0.401    -.4869433    .1946806
         1987  |  -.1504707   .1738872    -0.87   0.387    -.4912839    .1903425
         1988  |  -.1495757   .1738864    -0.86   0.390    -.4903873     .191236
         1989  |  -.1557307    .173889    -0.90   0.370    -.4965474     .185086
         1990  |  -.1697396   .1738917    -0.98   0.329    -.5105615    .1710823
         1991  |  -.1741334   .1738938    -1.00   0.317    -.5149594    .1666927
         1992  |  -.1786978   .1738952    -1.03   0.304    -.5195266     .162131
         1993  |  -.1864284   .1738974    -1.07   0.284    -.5272615    .1544048
         1994  |  -.1896552   .1739011    -1.09   0.275    -.5304956    .1511852
         1995  |  -.1974618   .1739019    -1.14   0.256    -.5383036    .1433801
         1996  |  -.2074134   .1739047    -1.19   0.233    -.5482609    .1334341
         1997  |  -.2124242   .1739135    -1.22   0.222    -.5532889    .1284406
         1998  |  -.2229571   .1739127    -1.28   0.200    -.5638203     .117906
         1999  |  -.2203813   .1739211    -1.27   0.205    -.5612609    .1204983
         2000  |  -.2351395    .173922    -1.35   0.176     -.576021    .1057419
         2001  |  -.2330501   .1739423    -1.34   0.180    -.5739712    .1078711
         2002  |   -.249446   .1739437    -1.43   0.152      -.59037    .0914779
         2003  |  -.2581859    .173959    -1.48   0.138    -.5991398     .082768
         2004  |  -.2735363   .1740203    -1.57   0.116    -.6146104    .0675378
         2005  |   -.264423   .1742971    -1.52   0.129    -.6060395    .0771934
         2006  |  -.2886869   .1759105    -1.64   0.101    -.6334656    .0560919
               |
 lastbirthyear |
         1935  |    .423761   .1880126     2.25   0.024     .0552625    .7922595
         1936  |   .0171042   .0076143     2.25   0.025     .0021804     .032028
         1937  |  -.7299421    .170919    -4.27   0.000    -1.064938   -.3949465
         1938  |   .1768543   .2933205     0.60   0.547    -.3980441    .7517528
         1940  |  -.4911772   .2220401    -2.21   0.027    -.9263683    -.055986
         1941  |   .1731466   .2360773     0.73   0.463     -.289557    .6358502
         1942  |   -.098759   .2120109    -0.47   0.641    -.5142932    .3167753
         1943  |  -.3945224   .1982887    -1.99   0.047    -.7831616   -.0058833
         1944  |  -.4034758   .1975001    -2.04   0.041    -.7905693   -.0163823
         1945  |  -.4968507   .1823589    -2.72   0.006    -.8542681   -.1394334
         1946  |   -.479476   .1785566    -2.69   0.007    -.8294409   -.1295111
         1947  |  -.5095364   .1729518    -2.95   0.003    -.8485161   -.1705566
         1948  |   -.444648   .1735912    -2.56   0.010    -.7848811    -.104415
         1949  |  -.4875028   .1711163    -2.85   0.004    -.8228851   -.1521206
         1950  |  -.4370542   .1688136    -2.59   0.010    -.7679233   -.1061852
         1951  |  -.4278557   .1682981    -2.54   0.011    -.7577144    -.097997
         1952  |  -.4485497   .1687142    -2.66   0.008    -.7792239   -.1178755
         1953  |  -.3591247   .1798868    -2.00   0.046    -.7116968   -.0065525
         1963  |   .1520071   .2948778     0.52   0.606    -.4259435    .7299578
         1964  |  -.3256057   .0640896    -5.08   0.000    -.4512192   -.1999922
         1965  |    .188864   .1746862     1.08   0.280    -.1535152    .5312432
         1966  |  -.0501942   .1167988    -0.43   0.667    -.2791159    .1787276
         1967  |   -.158446   .0812722    -1.95   0.051    -.3177368    .0008449
         1968  |  -.0542425   .0504141    -1.08   0.282    -.1530525    .0445675
         1969  |  -.1455542   .0506825    -2.87   0.004    -.2448902   -.0462183
         1970  |  -.0521825   .0450463    -1.16   0.247    -.1404718    .0361067
         1971  |  -.1041039   .0372147    -2.80   0.005    -.1770435   -.0311643
         1972  |  -.0626177   .0322821    -1.94   0.052    -.1258895    .0006541
         1973  |  -.0353885   .0291333    -1.21   0.224    -.0924888    .0217118
         1974  |  -.0431966   .0304876    -1.42   0.157    -.1029514    .0165582
         1975  |  -.0383736   .0253728    -1.51   0.130    -.0881035    .0113563
         1976  |  -.0642286   .0231072    -2.78   0.005    -.1095179   -.0189394
         1977  |  -.0295221   .0231197    -1.28   0.202    -.0748359    .0157917
         1978  |  -.0500044   .0217718    -2.30   0.022    -.0926764   -.0073323
         1979  |  -.0495642   .0217035    -2.28   0.022    -.0921023    -.007026
         1980  |  -.0148508   .0207282    -0.72   0.474    -.0554773    .0257758
         1981  |   -.015839   .0206843    -0.77   0.444    -.0563795    .0247015
         1982  |  -.0146873   .0201909    -0.73   0.467    -.0542608    .0248862
         1983  |  -.0175841   .0200835    -0.88   0.381    -.0569471    .0217788
         1984  |  -.0208231   .0197613    -1.05   0.292    -.0595547    .0179084
         1985  |  -.0083947   .0197017    -0.43   0.670    -.0470094      .03022
         1986  |  -.0166467   .0195087    -0.85   0.393     -.054883    .0215897
         1987  |   -.006717   .0193995    -0.35   0.729    -.0447395    .0313054
         1988  |  -.0182085    .019257    -0.95   0.344    -.0559515    .0195345
         1989  |  -.0087038   .0192049    -0.45   0.650    -.0463447    .0289371
         1990  |  -.0019953    .019128    -0.10   0.917    -.0394855    .0354948
         1991  |   .0002921   .0190847     0.02   0.988    -.0371133    .0376975
         1992  |  -.0018893   .0190362    -0.10   0.921    -.0391995     .035421
         1993  |   .0020993   .0190307     0.11   0.912    -.0352002    .0393987
         1994  |  -.0034407   .0189881    -0.18   0.856    -.0406568    .0337754
         1995  |   .0043791   .0189703     0.23   0.817    -.0328019    .0415602
         1996  |  -.0019295    .018952    -0.10   0.919    -.0390749    .0352159
         1997  |  -.0028177   .0189379    -0.15   0.882    -.0399353    .0342998
         1998  |  -.0025666    .018922    -0.14   0.892    -.0396531      .03452
         1999  |  -.0072511   .0189154    -0.38   0.701    -.0443248    .0298225
         2000  |  -.0137536   .0189048    -0.73   0.467    -.0508064    .0232991
         2001  |  -.0020977   .0189367    -0.11   0.912     -.039213    .0350176
         2002  |  -.0007721   .0189041    -0.04   0.967    -.0378235    .0362793
         2003  |    .000743   .0188891     0.04   0.969    -.0362791     .037765
         2004  |   .0064924   .0189625     0.34   0.732    -.0306735    .0436583
         2005  |  -.0101936   .0191969    -0.53   0.595    -.0478188    .0274316
         2006  |          0  (omitted)
               |
      country2 |  -.5080778   .0056156   -90.48   0.000    -.5190841   -.4970715
      country3 |  -.5077756   .0069589   -72.97   0.000    -.5214148   -.4941365
      country4 |  -.5706006   .0058999   -96.71   0.000    -.5821643   -.5590369
      country5 |  -.5810154   .0056964  -102.00   0.000    -.5921801   -.5698508
      country6 |  -.5869272   .0066145   -88.73   0.000    -.5998914   -.5739629
      country7 |  -.4869524    .006902   -70.55   0.000      -.50048   -.4734247
      country8 |  -.6100933   .0072087   -84.63   0.000    -.6242222   -.5959644
      country9 |  -.5395769   .0052688  -102.41   0.000    -.5499037   -.5292502
     country10 |          0  (omitted)
     country11 |  -.4422938   .0082431   -53.66   0.000      -.45845   -.4261377
     country12 |          0  (omitted)
     country13 |  -.5331581   .0110978   -48.04   0.000    -.5549094   -.5114067
     country14 |  -.5391258   .0049795  -108.27   0.000    -.5488855   -.5293661
     country15 |  -.5925525   .0062803   -94.35   0.000    -.6048617   -.5802434
     country16 |    -.60013    .007444   -80.62   0.000    -.6147201     -.58554
     country17 |  -.6048736   .0070314   -86.03   0.000    -.6186548   -.5910923
     country18 |  -.5621586    .005735   -98.02   0.000    -.5733991   -.5509181
     country19 |  -.5640082    .004963  -113.64   0.000    -.5737356   -.5542808
     country20 |          0  (omitted)
     country21 |   -.180169    .009225   -19.53   0.000    -.1982497   -.1620883
     country22 |  -.6537413   .0055219  -118.39   0.000    -.6645641   -.6429186
     country23 |  -.6763016   .0072445   -93.35   0.000    -.6905007   -.6621026
     country24 |  -.6480399   .0059767  -108.43   0.000     -.659754   -.6363258
     country25 |  -.6369079   .0053281  -119.54   0.000    -.6473508   -.6264649
     country26 |  -.5550178   .0057522   -96.49   0.000    -.5662918   -.5437437
     country27 |  -.5634212   .0055138  -102.18   0.000    -.5742281   -.5526142
     country28 |  -.6115601   .0060821  -100.55   0.000    -.6234808   -.5996394
     country29 |          0  (omitted)
     country30 |  -.5621753   .0060998   -92.16   0.000    -.5741306   -.5502199
     country31 |  -.5904185    .005308  -111.23   0.000    -.6008219   -.5800151
     country32 |          0  (omitted)
     country33 |  -.6095822   .0061414   -99.26   0.000    -.6216192   -.5975452
     country34 |          0  (omitted)
     country35 |  -.6128774   .0052217  -117.37   0.000    -.6231118   -.6026429
     country36 |          0  (omitted)
     country37 |   -.586404   .0056216  -104.31   0.000    -.5974222   -.5753858
     country38 |  -.4525078   .0094427   -47.92   0.000    -.4710151   -.4340005
     country39 |          0  (omitted)
     country40 |   -.556798   .0063503   -87.68   0.000    -.5692444   -.5443517
     country41 |          0  (omitted)
     country42 |   -.424817   .0072913   -58.26   0.000    -.4391076   -.4105264
     country43 |  -.5259885   .0068313   -77.00   0.000    -.5393777   -.5125993
     country44 |          0  (omitted)
     country45 |  -.5606674   .0063691   -88.03   0.000    -.5731506   -.5481842
     country46 |  -.6752175   .0058783  -114.87   0.000    -.6867388   -.6636962
         _cons |   .8563329   .1735434     4.93   0.000     .5161937    1.196472
--------------------------------------------------------------------------------

. 
end of do-file

. lookfor attend

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------
enrolment       byte   %8.0g       hv121      member attended school during current school year
p_attendence    byte   %9.0g                  
s_attendence    byte   %9.0g                  
attendance      float  %9.0g                  

. tab place
variable place not found
r(111);

. tab m15

   place of delivery |      Freq.     Percent        Cum.
---------------------+-----------------------------------
    respondents home |    178,100       47.78       47.78
          other home |     14,513        3.89       51.67
                  13 |      5,137        1.38       53.05
                  14 |          4        0.00       53.05
            hospital |     81,817       21.95       75.00
      delivery house |     33,412        8.96       83.96
                 fap |     13,149        3.53       87.49
                  24 |      4,801        1.29       88.78
                  25 |      2,127        0.57       89.35
        other public |        749        0.20       89.55
                  27 |      1,629        0.44       89.99
                  28 |         41        0.01       90.00
                  29 |        192        0.05       90.05
 private hosp/clinic |     20,722        5.56       95.61
                  32 |      8,106        2.17       97.78
                  33 |      2,269        0.61       98.39
                  34 |        577        0.15       98.54
                  35 |        218        0.06       98.60
other private medica |        540        0.14       98.75
                  37 |         60        0.02       98.76
                  38 |          8        0.00       98.77
                  41 |      2,236        0.60       99.37
                  42 |         97        0.03       99.39
                  43 |         14        0.00       99.40
                  44 |          3        0.00       99.40
                  46 |         81        0.02       99.42
                  51 |        261        0.07       99.49
                  66 |          3        0.00       99.49
               other |      1,814        0.49       99.98
                  98 |         90        0.02      100.00
---------------------+-----------------------------------
               Total |    372,770      100.00

. tab m15, nolab

   place of |
   delivery |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |    178,100       47.78       47.78
         12 |     14,513        3.89       51.67
         13 |      5,137        1.38       53.05
         14 |          4        0.00       53.05
         21 |     81,817       21.95       75.00
         22 |     33,412        8.96       83.96
         23 |     13,149        3.53       87.49
         24 |      4,801        1.29       88.78
         25 |      2,127        0.57       89.35
         26 |        749        0.20       89.55
         27 |      1,629        0.44       89.99
         28 |         41        0.01       90.00
         29 |        192        0.05       90.05
         31 |     20,722        5.56       95.61
         32 |      8,106        2.17       97.78
         33 |      2,269        0.61       98.39
         34 |        577        0.15       98.54
         35 |        218        0.06       98.60
         36 |        540        0.14       98.75
         37 |         60        0.02       98.76
         38 |          8        0.00       98.77
         41 |      2,236        0.60       99.37
         42 |         97        0.03       99.39
         43 |         14        0.00       99.40
         44 |          3        0.00       99.40
         46 |         81        0.02       99.42
         51 |        261        0.07       99.49
         66 |          3        0.00       99.49
         96 |      1,814        0.49       99.98
         98 |         90        0.02      100.00
------------+-----------------------------------
      Total |    372,770      100.00

. gen homedelivery=(m15<20)

. gen attendedbirth=(m15>20)

. tab attend
attend ambiguous abbreviation
r(111);

. tab attendedbi

attendedbir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    197,754       17.75       17.75
          1 |    916,261       82.25      100.00
------------+-----------------------------------
      Total |  1,114,015      100.00

. drop attendedbirth

. gen attendedbirth=1 if m15>20
(197754 missing values generated)

. replace attendedbirth=0 if m15>20
(916261 real changes made)

. drop attendedbirt

. gen attendedbirth=1 if m15>20
(197754 missing values generated)

. replace attendedbirth=0 if m15<20
(197754 real changes made)

. drop attendedbirt

. gen attendedbirth=1 if m15>20 & m15!=.
(938999 missing values generated)

. replace attendedbirth=0 if m15<20
(197754 real changes made)

. tab attendedb

attendedbir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    197,754       53.05       53.05
          1 |    175,016       46.95      100.00
------------+-----------------------------------
      Total |    372,770      100.00

. do "/tmp/SD01964.000000"

. reg terminated_preg urban attendedbirth fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth country2- country46 [p
> w=sweight]
(sum of wgt is   2.6686e+05)
note: 2006.lastbirthyear omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  269680
                                                       F(141,269538) =  348.56
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0482
                                                       Root MSE      =  .37845

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         urban |  -.0145535   .0023731    -6.13   0.000    -.0192047   -.0099023
 attendedbirth |   .0147021   .0021268     6.91   0.000     .0105337    .0188704
          fert |  -.0016288   .0007205    -2.26   0.024     -.003041   -.0002167
        agemay |   .0086615   .0002178    39.77   0.000     .0082346    .0090884
     educf_1_4 |   .0060629   .0027365     2.22   0.027     .0006994    .0114264
     educf_5_6 |  -.0029013   .0029627    -0.98   0.327    -.0087081    .0029054
    educf_7_10 |   .0000117   .0030061     0.00   0.997    -.0058801    .0059035
  educf_11plus |  -.0176461   .0036986    -4.77   0.000    -.0248953   -.0103969
        height |   -.000123   .0001453    -0.85   0.397    -.0004078    .0001618
          bmi1 |   .0018221   .0002519     7.23   0.000     .0013283    .0023159
        aiquin |   .0002852   .0007909     0.36   0.718    -.0012649    .0018353
               |
firstbirthyear |
         1928  |   .4677167   .3100752     1.51   0.131    -.1400221    1.075456
         1929  |   .0187344   .0039197     4.78   0.000     .0110518    .0264169
         1930  |    .460768   .3174215     1.45   0.147    -.1613695    1.082906
         1931  |   .3652825   .2555742     1.43   0.153    -.1356361     .866201
         1932  |   .2609724   .1243756     2.10   0.036     .0171995    .5047452
         1933  |   .1731177   .1017885     1.70   0.089    -.0263851    .3726204
         1934  |   .2012206   .0694419     2.90   0.004     .0651164    .3373249
         1935  |   .4309234   .1144051     3.77   0.000     .2066926    .6551543
         1936  |    .373504   .0781969     4.78   0.000     .2202402    .5267678
         1937  |    .396251   .0654345     6.06   0.000     .2680011    .5245009
         1938  |   .2901287   .0537033     5.40   0.000     .1848716    .3953858
         1939  |    .425759   .0697972     6.10   0.000     .2889584    .5625595
         1940  |   .3338361    .044214     7.55   0.000     .2471779    .4204944
         1941  |   .3535188   .0486233     7.27   0.000     .2582185    .4488192
         1942  |   .2667972   .0360089     7.41   0.000     .1962208    .3373737
         1943  |   .3498878   .0442582     7.91   0.000     .2631429    .4366326
         1944  |   .2908541    .036386     7.99   0.000     .2195384    .3621697
         1945  |   .3380735   .0352844     9.58   0.000     .2689171    .4072299
         1946  |   .3113655   .0350412     8.89   0.000     .2426856    .3800453
         1947  |   .3345605   .0302268    11.07   0.000     .2753167    .3938042
         1948  |   .3276411   .0276842    11.83   0.000     .2733808    .3819014
         1949  |   .3865714   .0351707    10.99   0.000     .3176379     .455505
         1950  |   .3152827   .0223223    14.12   0.000     .2715316    .3590338
         1951  |   .2917329   .0296998     9.82   0.000     .2335221    .3499437
         1952  |   .3079539   .0270943    11.37   0.000     .2548498    .3610581
         1953  |   .3226002   .1710743     1.89   0.059    -.0127008    .6579012
         1962  |   .7269146   .2514119     2.89   0.004     .2341541    1.219675
         1963  |   .2363597   .1779616     1.33   0.184    -.1124401    .5851595
         1964  |   .2195086    .133517     1.64   0.100    -.0421811    .4811984
         1965  |   .5561771   .1316571     4.22   0.000     .2981329    .8142214
         1966  |   .5394301    .115327     4.68   0.000     .3133923    .7654679
         1967  |    .555841   .1106099     5.03   0.000     .3390485    .7726334
         1968  |   .3481305   .0958935     3.63   0.000     .1601818    .5360793
         1969  |   .4566388   .0963363     4.74   0.000     .2678223    .6454552
         1970  |   .4223127   .0902336     4.68   0.000     .2454574     .599168
         1971  |   .4622251   .0880263     5.25   0.000      .289696    .6347541
         1972  |    .430093   .0864473     4.98   0.000     .2606586    .5995273
         1973  |   .4792331   .0849695     5.64   0.000     .3126953     .645771
         1974  |   .4118989   .0839587     4.91   0.000     .2473422    .5764557
         1975  |   .3967667   .0832399     4.77   0.000     .2336188    .5599146
         1976  |   .4010538   .0829684     4.83   0.000     .2384381    .5636696
         1977  |   .4291758    .082698     5.19   0.000       .26709    .5912617
         1978  |   .4183216   .0824728     5.07   0.000      .256677    .5799661
         1979  |   .4252679   .0822534     5.17   0.000     .2640534    .5864823
         1980  |   .4312293   .0821048     5.25   0.000     .2703061    .5921524
         1981  |   .4195488   .0820706     5.11   0.000     .2586927    .5804049
         1982  |   .4309543   .0819808     5.26   0.000     .2702742    .5916345
         1983  |   .4196926   .0819165     5.12   0.000     .2591384    .5802468
         1984  |    .427138   .0818914     5.22   0.000     .2666332    .5876429
         1985  |   .4068512   .0818344     4.97   0.000     .2464581    .5672443
         1986  |   .4035913   .0818156     4.93   0.000      .243235    .5639477
         1987  |   .4057569   .0818022     4.96   0.000     .2454268     .566087
         1988  |   .4097456   .0817824     5.01   0.000     .2494542    .5700369
         1989  |   .4066793   .0817852     4.97   0.000     .2463824    .5669761
         1990  |   .3979928   .0817847     4.87   0.000      .237697    .5582886
         1991  |   .3989237   .0817949     4.88   0.000     .2386079    .5592395
         1992  |   .3958566   .0817948     4.84   0.000     .2355409    .5561722
         1993  |    .393248   .0818068     4.81   0.000      .232909    .5535871
         1994  |   .3946341   .0818168     4.82   0.000     .2342753    .5549929
         1995  |   .3897749   .0818238     4.76   0.000     .2294025    .5501473
         1996  |   .3901046   .0818367     4.77   0.000      .229707    .5505023
         1997  |    .387391   .0818834     4.73   0.000     .2269018    .5478801
         1998  |   .3765094   .0818725     4.60   0.000     .2160416    .5369772
         1999  |   .3885572   .0819149     4.74   0.000     .2280062    .5491082
         2000  |   .3771187   .0819265     4.60   0.000      .216545    .5376924
         2001  |   .3834737   .0819666     4.68   0.000     .2228214    .5441259
         2002  |   .3675092   .0819834     4.48   0.000      .206824    .5281943
         2003  |   .3594443   .0820446     4.38   0.000      .198639    .5202496
         2004  |   .3452429    .082243     4.20   0.000     .1840489    .5064369
         2005  |   .3614027   .0828609     4.36   0.000     .1989976    .5238079
         2006  |   .3384766   .0849613     3.98   0.000     .1719548    .5049984
               |
 lastbirthyear |
         1950  |   .0649989   .0775295     0.84   0.402    -.0869568    .2169546
         1951  |   .0679216   .0765928     0.89   0.375    -.0821982    .2180413
         1952  |   .0354774   .0762742     0.47   0.642    -.1140179    .1849727
         1953  |   .1010979   .1135957     0.89   0.373    -.1215467    .3237425
         1986  |  -.0567075   .0692497    -0.82   0.413    -.1924351    .0790201
         1987  |   .0202111   .0360943     0.56   0.576    -.0505327    .0909549
         1988  |   .0457928   .0287095     1.60   0.111     -.010477    .1020627
         1989  |   .0316685   .0272183     1.16   0.245    -.0216787    .0850156
         1990  |   .0059314   .0260571     0.23   0.820    -.0451398    .0570026
         1991  |   .0034067   .0254887     0.13   0.894    -.0465504    .0533637
         1992  |   .0138157   .0252961     0.55   0.585     -.035764    .0633954
         1993  |   .0190988    .025388     0.75   0.452     -.030661    .0688585
         1994  |   .0006318   .0251384     0.03   0.980    -.0486388    .0499025
         1995  |   .0081039    .024997     0.32   0.746    -.0408895    .0570974
         1996  |   .0013579   .0248841     0.05   0.956    -.0474143    .0501301
         1997  |  -.0050459   .0248228    -0.20   0.839     -.053698    .0436061
         1998  |  -.0092309   .0247812    -0.37   0.710    -.0578013    .0393396
         1999  |  -.0074398   .0247167    -0.30   0.763    -.0558838    .0410042
         2000  |  -.0075149    .024679    -0.30   0.761    -.0558851    .0408552
         2001  |   .0016014   .0246719     0.06   0.948    -.0467549    .0499576
         2002  |   .0003304   .0245779     0.01   0.989    -.0478417    .0485025
         2003  |  -.0000954   .0245405    -0.00   0.997     -.048194    .0480033
         2004  |   .0049108   .0246268     0.20   0.842    -.0433571    .0531787
         2005  |  -.0164207   .0247309    -0.66   0.507    -.0648926    .0320512
         2006  |          0  (omitted)
               |
      country2 |  -.3314374    .015116   -21.93   0.000    -.3610643   -.3018105
      country3 |   -.369239   .0159997   -23.08   0.000     -.400598   -.3378801
      country4 |  -.4121659   .0154496   -26.68   0.000    -.4424467   -.3818852
      country5 |  -.4285037   .0150613   -28.45   0.000    -.4580234   -.3989839
      country6 |  -.4283621   .0163784   -26.15   0.000    -.4604632   -.3962609
      country7 |  -.3374993   .0159504   -21.16   0.000    -.3687616    -.306237
      country8 |  -.4355404   .0162651   -26.78   0.000    -.4674195   -.4036612
      country9 |  -.3823234   .0148091   -25.82   0.000    -.4113487    -.353298
     country10 |          0  (omitted)
     country11 |  -.2766002   .0175457   -15.76   0.000    -.3109894   -.2422111
     country12 |          0  (omitted)
     country13 |  -.3649105   .0194569   -18.75   0.000    -.4030454   -.3267755
     country14 |  -.3641391   .0145423   -25.04   0.000    -.3926416   -.3356366
     country15 |  -.4125046   .0154614   -26.68   0.000    -.4428086   -.3822006
     country16 |    -.44033   .0166888   -26.38   0.000    -.4730396   -.4076205
     country17 |  -.4319019   .0159168   -27.14   0.000    -.4630984   -.4007055
     country18 |   -.408115     .01537   -26.55   0.000    -.4382398   -.3779903
     country19 |   -.365712   .0146901   -24.90   0.000    -.3945041   -.3369198
     country20 |          0  (omitted)
     country21 |  -.2087746   .0266143    -7.84   0.000     -.260938   -.1566112
     country22 |   -.475088   .0148481   -32.00   0.000    -.5041898   -.4459862
     country23 |  -.4992579   .0165306   -30.20   0.000    -.5316574   -.4668585
     country24 |   -.456733   .0152925   -29.87   0.000    -.4867058   -.4267602
     country25 |  -.4574524   .0146125   -31.31   0.000    -.4860924   -.4288124
     country26 |  -.3938166    .015014   -26.23   0.000    -.4232436   -.3643897
     country27 |  -.4289729   .0152014   -28.22   0.000    -.4587673   -.3991785
     country28 |  -.4327335   .0154962   -27.93   0.000    -.4631057   -.4023613
     country29 |          0  (omitted)
     country30 |  -.3920972   .0154767   -25.33   0.000    -.4224312   -.3617633
     country31 |  -.4212628   .0147804   -28.50   0.000    -.4502319   -.3922937
     country32 |          0  (omitted)
     country33 |   -.428716   .0154524   -27.74   0.000    -.4590022   -.3984297
     country34 |          0  (omitted)
     country35 |  -.4403367    .014695   -29.97   0.000    -.4691386   -.4115349
     country36 |          0  (omitted)
     country37 |  -.4219712   .0149369   -28.25   0.000     -.451247   -.3926953
     country38 |   -.359875   .0184197   -19.54   0.000    -.3959771    -.323773
     country39 |          0  (omitted)
     country40 |   -.395648   .0155658   -25.42   0.000    -.4261567   -.3651394
     country41 |          0  (omitted)
     country42 |  -.2764903   .0161521   -17.12   0.000    -.3081479   -.2448326
     country43 |  -.3623835   .0158869   -22.81   0.000    -.3935214   -.3312455
     country44 |          0  (omitted)
     country45 |  -.3941686   .0155088   -25.42   0.000    -.4245654   -.3637719
     country46 |  -.4804356   .0152205   -31.57   0.000    -.5102673   -.4506039
         _cons |  -.0372477   .0837072    -0.44   0.656    -.2013114    .1268161
--------------------------------------------------------------------------------

. 
end of do-file

. lookfor educf

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------
educfyrs        byte   %8.0g       v133       years of educ of mother
educf           byte   %8.0g       v149       educational attainment (v149)
educf1          byte   %8.0g                  v149==no education
educf2          byte   %8.0g                  v149==incomplete primary
educf3          byte   %8.0g                  v149==complete primary
educf4          byte   %8.0g                  v149==incomplete secondary
educf5          byte   %8.0g                  v149==complete secondary
educf6          byte   %8.0g                  v149==higher
educfyrs1       byte   %8.0g                  educfyrs== 0.0000
educfyrs2       byte   %8.0g                  educfyrs== 1.0000
educfyrs3       byte   %8.0g                  educfyrs== 2.0000
educfyrs4       byte   %8.0g                  educfyrs== 3.0000
educfyrs5       byte   %8.0g                  educfyrs== 4.0000
educfyrs6       byte   %8.0g                  educfyrs== 5.0000
educfyrs7       byte   %8.0g                  educfyrs== 6.0000
educfyrs8       byte   %8.0g                  educfyrs== 7.0000
educfyrs9       byte   %8.0g                  educfyrs== 8.0000
educfyrs10      byte   %8.0g                  educfyrs== 9.0000
educfyrs11      byte   %8.0g                  educfyrs== 10.0000
educfyrs12      byte   %8.0g                  educfyrs== 11.0000
educfyrs13      byte   %8.0g                  educfyrs== 12.0000
educfyrs14      byte   %8.0g                  educfyrs== 13.0000
educfyrs15      byte   %8.0g                  educfyrs== 14.0000
educfyrs16      byte   %8.0g                  educfyrs== 15.0000
educfyrs17      byte   %8.0g                  educfyrs== 16.0000
educfyrs18      byte   %8.0g                  educfyrs== 17.0000
educfyrs19      byte   %8.0g                  educfyrs== 18.0000
educfyrs20      byte   %8.0g                  educfyrs== 19.0000
educfyrs21      byte   %8.0g                  educfyrs== 20.0000
educfyrs22      byte   %8.0g                  educfyrs== 21.0000
educfyrs23      byte   %8.0g                  educfyrs== 22.0000
educfyrs24      byte   %8.0g                  educfyrs== 23.0000
educfyrs25      byte   %8.0g                  educfyrs== 24.0000
educfyrs26      byte   %8.0g                  educfyrs== 25.0000
educfyrs27      byte   %8.0g                  educfyrs== 26.0000
educfyrs28      byte   %8.0g                  educfyrs== 27.0000
educfyrs_sq     float  %9.0g                  
educf00         float  %9.0g                  
educf_1_4       float  %9.0g                  
educf_5_6       float  %9.0g                  
educf_7_10      float  %9.0g                  
educf_11plus    float  %9.0g                  

. tab terminated

 ever had a |
 terminated |
      preg. |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |    721,331       76.40       76.40
        yes |    222,812       23.60      100.00
------------+-----------------------------------
      Total |    944,143      100.00

. tab country if terminated==.

                      full country name |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                Armenia |      6,985        4.11        4.11
                             Bangladesh |          5        0.00        4.11
                                  Benin |      5,499        3.24        7.35
                                Bolivia |     11,556        6.80       14.15
                           Burkina Faso |      7,487        4.41       18.56
                               Cambodia |          1        0.00       18.56
                               Cameroon |         20        0.01       18.57
                                   Chad |     10,327        6.08       24.65
                               Colombia |          6        0.00       24.66
                                Comoros |      2,324        1.37       26.03
                          Cote D Ivoire |     10,058        5.92       31.95
                      DominicanRepublic |         11        0.01       31.95
                                  Egypt |          1        0.00       31.95
                                  Ghana |      4,525        2.66       34.62
                                 Guinea |      8,364        4.92       39.54
                                  Haiti |          4        0.00       39.54
                               Honduras |         18        0.01       39.55
                                  India |          2        0.00       39.56
                                  Kenya |      9,757        5.74       45.30
                             Madagascar |         16        0.01       45.31
                                 Malawi |      6,319        3.72       49.03
                                   Mali |         29        0.02       49.05
                                Morocco |         11        0.01       49.05
                             Mozambique |      5,783        3.40       52.46
                                Namibia |      3,854        2.27       54.72
                              Nicaragua |         25        0.01       54.74
                                  Niger |     15,019        8.84       63.58
                                Nigeria |         23        0.01       63.59
                                   Peru |          4        0.00       63.60
                                 Rwanda |         47        0.03       63.62
                                Senegal |      8,408        4.95       68.57
                               Tanzania |     20,778       12.23       80.81
                                   Togo |      7,063        4.16       84.96
                                 Uganda |      6,334        3.73       88.69
                                 Zambia |     19,207       11.31      100.00
                               Zimbabwe |          2        0.00      100.00
----------------------------------------+-----------------------------------
                                  Total |    169,872      100.00

. tab country if terminated==1

                      full country name |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                Armenia |      6,798        3.05        3.05
                             Bangladesh |      8,559        3.84        6.89
                                  Benin |      2,618        1.17        8.07
                                Bolivia |      6,512        2.92       10.99
                           Burkina Faso |      6,590        2.96       13.95
                               Cambodia |      2,671        1.20       15.15
                               Cameroon |      3,089        1.39       16.53
                                   Chad |      1,393        0.63       17.16
                               Colombia |     15,101        6.78       23.94
                                CongoBr |      2,650        1.19       25.12
                      DominicanRepublic |      1,173        0.53       25.65
                                  Egypt |     32,479       14.58       40.23
                                  Ghana |      2,492        1.12       41.35
                                 Guinea |      1,061        0.48       41.82
                                  Haiti |      3,750        1.68       43.51
                               Honduras |      7,058        3.17       46.67
                                  India |     32,110       14.41       61.08
                             Kazakhstan |      2,871        1.29       62.37
                                  Kenya |      2,786        1.25       63.62
                                Lesotho |        594        0.27       63.89
                             Madagascar |      2,972        1.33       65.22
                                 Malawi |      5,750        2.58       67.80
                                   Mali |      8,421        3.78       71.58
                                Morocco |      8,018        3.60       75.18
                             Mozambique |      3,181        1.43       76.61
                                  Nepal |      4,499        2.02       78.63
                              Nicaragua |      9,467        4.25       82.88
                                Nigeria |      3,001        1.35       84.23
                                   Peru |     11,959        5.37       89.59
                                 Rwanda |      5,623        2.52       92.12
                                Senegal |      1,766        0.79       92.91
                               Tanzania |      4,077        1.83       94.74
                                 Turkey |      3,823        1.72       96.45
                                 Uganda |      3,088        1.39       97.84
                                 Zambia |      3,110        1.40       99.24
                               Zimbabwe |      1,702        0.76      100.00
----------------------------------------+-----------------------------------
                                  Total |    222,812      100.00

. tab country if terminated==0

                      full country name |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                Armenia |      1,730        0.24        0.24
                             Bangladesh |     22,924        3.18        3.42
                                  Benin |      6,861        0.95        4.37
                                Bolivia |     21,779        3.02        7.39
                           Burkina Faso |     25,587        3.55       10.94
                               Cambodia |      9,108        1.26       12.20
                               Cameroon |      7,003        0.97       13.17
                                   Chad |      7,724        1.07       14.24
                               Colombia |     43,885        6.08       20.32
                                CongoBr |      5,109        0.71       21.03
                      DominicanRepublic |      3,247        0.45       21.48
                                  Egypt |     80,563       11.17       32.65
                                  Ghana |     10,178        1.41       34.06
                                 Guinea |      5,649        0.78       34.84
                                  Haiti |     14,364        1.99       36.84
                               Honduras |     23,833        3.30       40.14
                                  India |    106,464       14.76       54.90
                             Kazakhstan |      1,784        0.25       55.15
                                  Kenya |     17,381        2.41       57.56
                                Lesotho |      4,098        0.57       58.12
                             Madagascar |     17,282        2.40       60.52
                                 Malawi |     35,337        4.90       65.42
                                   Mali |     26,345        3.65       69.07
                                Morocco |     23,351        3.24       72.31
                             Mozambique |     16,121        2.23       74.54
                                  Nepal |     18,048        2.50       77.05
                              Nicaragua |     32,708        4.53       81.58
                                Nigeria |     13,650        1.89       83.47
                                   Peru |     47,251        6.55       90.02
                                 Rwanda |     20,488        2.84       92.86
                                Senegal |      3,934        0.55       93.41
                               Tanzania |     12,465        1.73       95.14
                                 Turkey |      6,028        0.84       95.97
                                 Uganda |      8,713        1.21       97.18
                                 Zambia |     10,096        1.40       98.58
                               Zimbabwe |     10,243        1.42      100.00
----------------------------------------+-----------------------------------
                                  Total |    721,331      100.00

. do "/tmp/SD01964.000000"

. reg terminated_preg urban attendedbirth fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth anemia country2- count
> ry46 [pw=sweight]
(sum of wgt is   5.8303e+04)
note: country2 omitted because of collinearity
note: country8 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country22 omitted because of collinearity
note: country27 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity
note: country46 omitted because of collinearity

Linear regression                                      Number of obs =   58824
                                                       F( 79, 58743) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0670
                                                       Root MSE      =  .38127

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         urban |   -.004712   .0050411    -0.93   0.350    -.0145926    .0051687
 attendedbirth |   .0077375   .0044502     1.74   0.082    -.0009849    .0164599
          fert |  -.0011135   .0015347    -0.73   0.468    -.0041214    .0018945
        agemay |    .009301   .0004661    19.96   0.000     .0083875    .0102146
     educf_1_4 |   .0150497   .0059845     2.51   0.012     .0033201    .0267793
     educf_5_6 |  -.0059537   .0062612    -0.95   0.342    -.0182258    .0063183
    educf_7_10 |   .0247492   .0066759     3.71   0.000     .0116645     .037834
  educf_11plus |  -.0146436   .0080204    -1.83   0.068    -.0303635    .0010763
        height |  -.0006499   .0003084    -2.11   0.035    -.0012544   -.0000454
          bmi1 |   .0027897   .0005351     5.21   0.000     .0017408    .0038385
        aiquin |   .0029792   .0016528     1.80   0.071    -.0002603    .0062186
               |
firstbirthyear |
         1970  |  -1.113786   .0201918   -55.16   0.000    -1.153363    -1.07421
         1971  |  -1.030372   .0222736   -46.26   0.000    -1.074028   -.9867154
         1972  |   -.727618   .1751593    -4.15   0.000    -1.070931    -.384305
         1973  |  -.6805343   .1350732    -5.04   0.000    -.9452784   -.4157903
         1974  |  -.7567705   .0983392    -7.70   0.000    -.9495159   -.5640252
         1975  |  -.7856686   .0819023    -9.59   0.000    -.9461975   -.6251397
         1976  |  -.6879192    .067257   -10.23   0.000    -.8197432   -.5560952
         1977  |  -.5995901   .0718626    -8.34   0.000     -.740441   -.4587392
         1978  |  -.6644964   .0490426   -13.55   0.000    -.7606202   -.5683727
         1979  |  -.6368611   .0410645   -15.51   0.000    -.7173478   -.5563744
         1980  |    -.63287   .0353338   -17.91   0.000    -.7021245   -.5636156
         1981  |  -.6629097    .034627   -19.14   0.000    -.7307789   -.5950406
         1982  |  -.6247569   .0279418   -22.36   0.000    -.6795229   -.5699909
         1983  |  -.6117178   .0279182   -21.91   0.000    -.6664377    -.556998
         1984  |  -.6489556   .0228993   -28.34   0.000    -.6938383   -.6040729
         1985  |  -.6733803   .0205063   -32.84   0.000    -.7135727   -.6331879
         1986  |  -.6554526   .0199897   -32.79   0.000    -.6946325   -.6162727
         1987  |  -.6194995   .0201609   -30.73   0.000    -.6590149   -.5799841
         1988  |  -.6755921    .018685   -36.16   0.000    -.7122147   -.6389694
         1989  |  -.6345715   .0187034   -33.93   0.000    -.6712302   -.5979128
         1990  |  -.6513558   .0185007   -35.21   0.000    -.6876171   -.6150944
         1991  |  -.6213434   .0190562   -32.61   0.000    -.6586936   -.5839932
         1992  |   -.647392    .018903   -34.25   0.000     -.684442    -.610342
         1993  |  -.6514575   .0186211   -34.98   0.000    -.6879549   -.6149601
         1994  |  -.6470628   .0186117   -34.77   0.000    -.6835419   -.6105838
         1995  |  -.6457477   .0188479   -34.26   0.000    -.6826897   -.6088056
         1996  |   -.654216   .0188772   -34.66   0.000    -.6912155   -.6172166
         1997  |  -.6526989   .0194317   -33.59   0.000    -.6907852   -.6146126
         1998  |  -.6759591   .0198605   -34.04   0.000    -.7148856   -.6370325
         1999  |  -.6539687   .0194002   -33.71   0.000    -.6919931   -.6159442
         2000  |  -.6862061   .0201706   -34.02   0.000    -.7257406   -.6466716
         2001  |  -.6591706   .0210622   -31.30   0.000    -.7004527   -.6178885
         2002  |  -.6691958   .0217026   -30.83   0.000     -.711733   -.6266586
         2003  |   -.683008   .0217794   -31.36   0.000    -.7256956   -.6403204
         2004  |   -.687621   .0225791   -30.45   0.000    -.7318761   -.6433658
         2005  |  -.6717468   .0262112   -25.63   0.000    -.7231208   -.6203728
         2006  |  -.7031149   .0473843   -14.84   0.000    -.7959883   -.6102415
               |
 lastbirthyear |
         1996  |   .0103705   .0272091     0.38   0.703    -.0429596    .0637005
         1997  |  -.0331468   .0258815    -1.28   0.200    -.0838746     .017581
         1998  |   -.055937   .0250626    -2.23   0.026    -.1050598   -.0068141
         1999  |  -.0704366    .024341    -2.89   0.004    -.1181452   -.0227281
         2000  |  -.0751439   .0245798    -3.06   0.002    -.1233204   -.0269674
         2001  |  -.0716911   .0253139    -2.83   0.005    -.1213065   -.0220757
         2002  |  -.0866144   .0252948    -3.42   0.001    -.1361922   -.0370365
         2003  |  -.0847218   .0251915    -3.36   0.001    -.1340973   -.0353463
         2004  |  -.0846667   .0253262    -3.34   0.001    -.1343062   -.0350272
         2005  |  -.1044499   .0260436    -4.01   0.000    -.1554956   -.0534043
         2006  |  -.0851729    .035129    -2.42   0.015    -.1540259   -.0163198
               |
        anemia |  -.0026142   .0028264    -0.92   0.355    -.0081539    .0029254
      country2 |          0  (omitted)
      country3 |  -.3355734   .0183877   -18.25   0.000    -.3716133   -.2995334
      country4 |   -.385857   .0182756   -21.11   0.000    -.4216773   -.3500368
      country5 |  -.4131215   .0184757   -22.36   0.000     -.449334    -.376909
      country6 |  -.4398924   .0185853   -23.67   0.000    -.4763196   -.4034651
      country7 |   -.306844   .0182584   -16.81   0.000    -.3426305   -.2710575
      country8 |          0  (omitted)
      country9 |          0  (omitted)
     country10 |          0  (omitted)
     country11 |  -.2329544   .0214877   -10.84   0.000    -.2750703   -.1908385
     country12 |          0  (omitted)
     country13 |          0  (omitted)
     country14 |  -.3529017      .0157   -22.48   0.000    -.3836737   -.3221297
     country15 |  -.3811559   .0180753   -21.09   0.000    -.4165836   -.3457281
     country16 |  -.3981181   .0186759   -21.32   0.000     -.434723   -.3615131
     country17 |  -.4475296   .0197643   -22.64   0.000    -.4862678   -.4087914
     country18 |  -.3687002   .0171653   -21.48   0.000    -.4023442   -.3350562
     country19 |          0  (omitted)
     country20 |          0  (omitted)
     country21 |          0  (omitted)
     country22 |          0  (omitted)
     country23 |  -.4678358    .018123   -25.81   0.000    -.5033569   -.4323147
     country24 |   -.358649   .0217918   -16.46   0.000    -.4013611   -.3159369
     country25 |  -.4139643   .0183757   -22.53   0.000    -.4499808   -.3779477
     country26 |  -.3904793   .0178555   -21.87   0.000    -.4254761   -.3554825
     country27 |          0  (omitted)
     country28 |          0  (omitted)
     country29 |          0  (omitted)
     country30 |          0  (omitted)
     country31 |          0  (omitted)
     country32 |          0  (omitted)
     country33 |          0  (omitted)
     country34 |          0  (omitted)
     country35 |  -.4225904   .0184628   -22.89   0.000    -.4587775   -.3864033
     country36 |          0  (omitted)
     country37 |  -.3694972    .017968   -20.56   0.000    -.4047146   -.3342798
     country38 |  -.3200998   .0201974   -15.85   0.000    -.3596869   -.2805128
     country39 |          0  (omitted)
     country40 |  -.3658343   .0171157   -21.37   0.000    -.3993811   -.3322875
     country41 |          0  (omitted)
     country42 |          0  (omitted)
     country43 |  -.3474587   .0164658   -21.10   0.000    -.3797316   -.3151857
     country44 |          0  (omitted)
     country45 |          0  (omitted)
     country46 |          0  (omitted)
         _cons |   1.079169   .0632127    17.07   0.000      .955272    1.203066
--------------------------------------------------------------------------------

. 
end of do-file

. sum v437

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        v437 |   1112241    573.9093    141.1026         31       9063

. sum height

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      height |   1114015    155.8335     7.13672         80      230.5

. order anemia attendedbirth terminated

. br

. sort caseid2

. do "/tmp/SD01964.000000"

. reg terminated_preg urban attendedbirth fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth anemia country2- count
> ry46 mort15 [pw=sweight]
(sum of wgt is   5.8303e+04)
note: country2 omitted because of collinearity
note: country8 omitted because of collinearity
note: country9 omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country13 omitted because of collinearity
note: country19 omitted because of collinearity
note: country20 omitted because of collinearity
note: country21 omitted because of collinearity
note: country22 omitted because of collinearity
note: country27 omitted because of collinearity
note: country28 omitted because of collinearity
note: country29 omitted because of collinearity
note: country30 omitted because of collinearity
note: country31 omitted because of collinearity
note: country32 omitted because of collinearity
note: country33 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country42 omitted because of collinearity
note: country44 omitted because of collinearity
note: country45 omitted because of collinearity
note: country46 omitted because of collinearity
note: mort15 omitted because of collinearity

Linear regression                                      Number of obs =   58824
                                                       F( 79, 58743) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0670
                                                       Root MSE      =  .38127

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         urban |   -.004712   .0050411    -0.93   0.350    -.0145926    .0051687
 attendedbirth |   .0077375   .0044502     1.74   0.082    -.0009849    .0164599
          fert |  -.0011135   .0015347    -0.73   0.468    -.0041214    .0018945
        agemay |    .009301   .0004661    19.96   0.000     .0083875    .0102146
     educf_1_4 |   .0150497   .0059845     2.51   0.012     .0033201    .0267793
     educf_5_6 |  -.0059537   .0062612    -0.95   0.342    -.0182258    .0063183
    educf_7_10 |   .0247492   .0066759     3.71   0.000     .0116645     .037834
  educf_11plus |  -.0146436   .0080204    -1.83   0.068    -.0303635    .0010763
        height |  -.0006499   .0003084    -2.11   0.035    -.0012544   -.0000454
          bmi1 |   .0027897   .0005351     5.21   0.000     .0017408    .0038385
        aiquin |   .0029792   .0016528     1.80   0.071    -.0002603    .0062186
               |
firstbirthyear |
         1970  |  -1.113786   .0201918   -55.16   0.000    -1.153363    -1.07421
         1971  |  -1.030372   .0222736   -46.26   0.000    -1.074028   -.9867154
         1972  |   -.727618   .1751593    -4.15   0.000    -1.070931    -.384305
         1973  |  -.6805343   .1350732    -5.04   0.000    -.9452784   -.4157903
         1974  |  -.7567705   .0983392    -7.70   0.000    -.9495159   -.5640252
         1975  |  -.7856686   .0819023    -9.59   0.000    -.9461975   -.6251397
         1976  |  -.6879192    .067257   -10.23   0.000    -.8197432   -.5560952
         1977  |  -.5995901   .0718626    -8.34   0.000     -.740441   -.4587392
         1978  |  -.6644964   .0490426   -13.55   0.000    -.7606202   -.5683727
         1979  |  -.6368611   .0410645   -15.51   0.000    -.7173478   -.5563744
         1980  |    -.63287   .0353338   -17.91   0.000    -.7021245   -.5636156
         1981  |  -.6629097    .034627   -19.14   0.000    -.7307789   -.5950406
         1982  |  -.6247569   .0279418   -22.36   0.000    -.6795229   -.5699909
         1983  |  -.6117178   .0279182   -21.91   0.000    -.6664377    -.556998
         1984  |  -.6489556   .0228993   -28.34   0.000    -.6938383   -.6040729
         1985  |  -.6733803   .0205063   -32.84   0.000    -.7135727   -.6331879
         1986  |  -.6554526   .0199897   -32.79   0.000    -.6946325   -.6162727
         1987  |  -.6194995   .0201609   -30.73   0.000    -.6590149   -.5799841
         1988  |  -.6755921    .018685   -36.16   0.000    -.7122147   -.6389694
         1989  |  -.6345715   .0187034   -33.93   0.000    -.6712302   -.5979128
         1990  |  -.6513558   .0185007   -35.21   0.000    -.6876171   -.6150944
         1991  |  -.6213434   .0190562   -32.61   0.000    -.6586936   -.5839932
         1992  |   -.647392    .018903   -34.25   0.000     -.684442    -.610342
         1993  |  -.6514575   .0186211   -34.98   0.000    -.6879549   -.6149601
         1994  |  -.6470628   .0186117   -34.77   0.000    -.6835419   -.6105838
         1995  |  -.6457477   .0188479   -34.26   0.000    -.6826898   -.6088056
         1996  |   -.654216   .0188772   -34.66   0.000    -.6912155   -.6172165
         1997  |  -.6526989   .0194317   -33.59   0.000    -.6907852   -.6146126
         1998  |  -.6759591   .0198605   -34.04   0.000    -.7148856   -.6370325
         1999  |  -.6539687   .0194002   -33.71   0.000    -.6919931   -.6159442
         2000  |  -.6862061   .0201706   -34.02   0.000    -.7257406   -.6466716
         2001  |  -.6591706   .0210622   -31.30   0.000    -.7004527   -.6178885
         2002  |  -.6691958   .0217026   -30.83   0.000     -.711733   -.6266586
         2003  |   -.683008   .0217794   -31.36   0.000    -.7256956   -.6403204
         2004  |   -.687621   .0225791   -30.45   0.000    -.7318761   -.6433658
         2005  |  -.6717468   .0262112   -25.63   0.000    -.7231208   -.6203728
         2006  |  -.7031149   .0473843   -14.84   0.000    -.7959883   -.6102415
               |
 lastbirthyear |
         1996  |   .0103705   .0272091     0.38   0.703    -.0429596    .0637005
         1997  |  -.0331468   .0258815    -1.28   0.200    -.0838746     .017581
         1998  |   -.055937   .0250626    -2.23   0.026    -.1050598   -.0068141
         1999  |  -.0704366    .024341    -2.89   0.004    -.1181452   -.0227281
         2000  |  -.0751439   .0245798    -3.06   0.002    -.1233204   -.0269674
         2001  |  -.0716911   .0253139    -2.83   0.005    -.1213065   -.0220757
         2002  |  -.0866144   .0252948    -3.42   0.001    -.1361922   -.0370365
         2003  |  -.0847218   .0251915    -3.36   0.001    -.1340973   -.0353463
         2004  |  -.0846667   .0253262    -3.34   0.001    -.1343062   -.0350272
         2005  |  -.1044499   .0260436    -4.01   0.000    -.1554956   -.0534043
         2006  |  -.0851729    .035129    -2.42   0.015    -.1540259   -.0163198
               |
        anemia |  -.0026142   .0028264    -0.92   0.355    -.0081539    .0029254
      country2 |          0  (omitted)
      country3 |  -.3355734   .0183877   -18.25   0.000    -.3716133   -.2995334
      country4 |   -.385857   .0182756   -21.11   0.000    -.4216773   -.3500368
      country5 |  -.4131215   .0184757   -22.36   0.000     -.449334    -.376909
      country6 |  -.4398924   .0185853   -23.67   0.000    -.4763196   -.4034651
      country7 |   -.306844   .0182584   -16.81   0.000    -.3426305   -.2710575
      country8 |          0  (omitted)
      country9 |          0  (omitted)
     country10 |          0  (omitted)
     country11 |  -.2329544   .0214877   -10.84   0.000    -.2750703   -.1908385
     country12 |          0  (omitted)
     country13 |          0  (omitted)
     country14 |  -.3529017      .0157   -22.48   0.000    -.3836737   -.3221297
     country15 |  -.3811559   .0180753   -21.09   0.000    -.4165836   -.3457281
     country16 |  -.3981181   .0186759   -21.32   0.000     -.434723   -.3615131
     country17 |  -.4475296   .0197643   -22.64   0.000    -.4862678   -.4087914
     country18 |  -.3687002   .0171653   -21.48   0.000    -.4023442   -.3350562
     country19 |          0  (omitted)
     country20 |          0  (omitted)
     country21 |          0  (omitted)
     country22 |          0  (omitted)
     country23 |  -.4678358    .018123   -25.81   0.000    -.5033569   -.4323147
     country24 |   -.358649   .0217918   -16.46   0.000    -.4013611   -.3159369
     country25 |  -.4139643   .0183757   -22.53   0.000    -.4499808   -.3779477
     country26 |  -.3904793   .0178555   -21.87   0.000    -.4254761   -.3554825
     country27 |          0  (omitted)
     country28 |          0  (omitted)
     country29 |          0  (omitted)
     country30 |          0  (omitted)
     country31 |          0  (omitted)
     country32 |          0  (omitted)
     country33 |          0  (omitted)
     country34 |          0  (omitted)
     country35 |  -.4225904   .0184628   -22.89   0.000    -.4587775   -.3864033
     country36 |          0  (omitted)
     country37 |  -.3694972    .017968   -20.56   0.000    -.4047146   -.3342798
     country38 |  -.3200998   .0201974   -15.85   0.000    -.3596869   -.2805128
     country39 |          0  (omitted)
     country40 |  -.3658343   .0171157   -21.37   0.000    -.3993811   -.3322875
     country41 |          0  (omitted)
     country42 |          0  (omitted)
     country43 |  -.3474587   .0164658   -21.10   0.000    -.3797316   -.3151857
     country44 |          0  (omitted)
     country45 |          0  (omitted)
     country46 |          0  (omitted)
        mort15 |          0  (omitted)
         _cons |   1.079169   .0632127    17.07   0.000      .955272    1.203066
--------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD01964.000000"

. reg terminated_preg urban fert agemay educf_* height bmi1 aiquin i.firstbirth i.lastbirth country2- country46 mort15 [pw=sweig
> ht]
(sum of wgt is   8.6265e+05)
note: 2006.lastbirthyear omitted because of collinearity
note: country10 omitted because of collinearity
note: country12 omitted because of collinearity
note: country20 omitted because of collinearity
note: country29 omitted because of collinearity
note: country32 omitted because of collinearity
note: country34 omitted because of collinearity
note: country36 omitted because of collinearity
note: country39 omitted because of collinearity
note: country41 omitted because of collinearity
note: country44 omitted because of collinearity

Linear regression                                      Number of obs =  874385
                                                       F(178,874206) =       .
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0528
                                                       Root MSE      =  .41208

--------------------------------------------------------------------------------
               |               Robust
terminated_p~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         urban |  -.0198136   .0013981   -14.17   0.000    -.0225538   -.0170735
          fert |   .0037865    .000347    10.91   0.000     .0031063    .0044667
        agemay |   .0040081   .0001012    39.62   0.000     .0038098    .0042063
     educf_1_4 |   .0184847   .0016314    11.33   0.000     .0152873    .0216822
     educf_5_6 |     .01205    .001799     6.70   0.000      .008524     .015576
    educf_7_10 |   .0156698   .0018468     8.49   0.000     .0120502    .0192894
  educf_11plus |   .0127132   .0022786     5.58   0.000     .0082472    .0171792
        height |   -.000294   .0000879    -3.34   0.001    -.0004664   -.0001217
          bmi1 |   .0020354   .0001328    15.32   0.000     .0017751    .0022957
        aiquin |   .0023769   .0004743     5.01   0.000     .0014472    .0033065
               |
firstbirthyear |
         1928  |   .6007922   .1727845     3.48   0.001     .2621403     .939444
         1929  |   .0199288   .0381201     0.52   0.601    -.0547854     .094643
         1930  |   .4778389   .1367886     3.49   0.000     .2097377    .7459401
         1931  |   .1935836   .0920202     2.10   0.035      .013227    .3739401
         1932  |   .1753958   .0607046     2.89   0.004     .0564169    .2943748
         1933  |   .1547424   .0608591     2.54   0.011     .0354605    .2740243
         1934  |   .1523401   .0485298     3.14   0.002     .0572234    .2474568
         1935  |   .2933287   .0564943     5.19   0.000     .1826017    .4040557
         1936  |   .3404917   .0541057     6.29   0.000     .2344464     .446537
         1937  |   .3224081   .0480588     6.71   0.000     .2282145    .4166017
         1938  |   .2174799   .0453589     4.79   0.000     .1285781    .3063818
         1939  |   .3235974   .0503553     6.43   0.000     .2249026    .4222922
         1940  |   .2572204   .0436459     5.89   0.000     .1716759     .342765
         1941  |   .2503728   .0447218     5.60   0.000     .1627197     .338026
         1942  |   .2134028   .0427758     4.99   0.000     .1295637     .297242
         1943  |   .2559898   .0437586     5.85   0.000     .1702245    .3417551
         1944  |   .2170815   .0428127     5.07   0.000       .13317     .300993
         1945  |   .2592489   .0428699     6.05   0.000     .1752254    .3432724
         1946  |   .2094315   .0428947     4.88   0.000     .1253594    .2935036
         1947  |   .2493765   .0421191     5.92   0.000     .1668245    .3319285
         1948  |   .2151288   .0414059     5.20   0.000     .1339747    .2962829
         1949  |   .2684804   .0438787     6.12   0.000     .1824797    .3544811
         1950  |   .2007178    .041681     4.82   0.000     .1190243    .2824112
         1951  |   .1793613   .0435284     4.12   0.000     .0940471    .2646756
         1952  |   .1829295    .042718     4.28   0.000     .0992036    .2666554
         1953  |   .1722086   .1644873     1.05   0.295     -.150181    .4945981
         1962  |  -.0031474   .2008375    -0.02   0.987    -.3967821    .3904873
         1963  |  -.0978326   .1847695    -0.53   0.596    -.4599747    .2643095
         1964  |  -.0571353   .1814085    -0.31   0.753      -.41269    .2984193
         1965  |  -.0465312   .1770661    -0.26   0.793    -.3935749    .3005125
         1966  |   .0249595   .1756963     0.14   0.887    -.3193994    .3693183
         1967  |  -.0203994    .175203    -0.12   0.907    -.3637915    .3229927
         1968  |  -.1392307   .1743654    -0.80   0.425    -.4809812    .2025197
         1969  |  -.0175006   .1744584    -0.10   0.920    -.3594333    .3244321
         1970  |  -.1082425   .1741692    -0.62   0.534    -.4496084    .2331233
         1971  |  -.0781927    .174126    -0.45   0.653    -.4194738    .2630883
         1972  |  -.0763643     .17408    -0.44   0.661    -.4175552    .2648266
         1973  |  -.0893728   .1739687    -0.51   0.607    -.4303456       .2516
         1974  |  -.1119008   .1739571    -0.64   0.520     -.452851    .2290494
         1975  |  -.1187173   .1739297    -0.68   0.495    -.4596138    .2221791
         1976  |  -.1087541   .1739168    -0.63   0.532    -.4496252     .232117
         1977  |  -.1151768   .1739131    -0.66   0.508    -.4560406     .225687
         1978  |  -.1205995   .1739018    -0.69   0.488    -.4614412    .2202422
         1979  |  -.1147361   .1738969    -0.66   0.509    -.4555683    .2260961
         1980  |  -.1215814   .1738903    -0.70   0.484    -.4624005    .2192378
         1981  |  -.1195161   .1738917    -0.69   0.492     -.460338    .2213059
         1982  |  -.1244271   .1738882    -0.72   0.474    -.4652421     .216388
         1983  |  -.1277328   .1738857    -0.73   0.463     -.468543    .2130774
         1984  |  -.1294515   .1738871    -0.74   0.457    -.4702644    .2113613
         1985  |  -.1395957   .1738864    -0.80   0.422    -.4804073    .2012158
         1986  |  -.1461309   .1738869    -0.84   0.401    -.4869434    .1946817
         1987  |  -.1504702   .1738876    -0.87   0.387    -.4912841    .1903436
         1988  |  -.1495752   .1738867    -0.86   0.390    -.4903874    .1912371
         1989  |  -.1557302   .1738893    -0.90   0.370    -.4965475    .1850871
         1990  |  -.1697399    .173892    -0.98   0.329    -.5105625    .1710826
         1991  |   -.174133   .1738941    -1.00   0.317    -.5149597    .1666937
         1992  |  -.1786988   .1738955    -1.03   0.304    -.5195282    .1621307
         1993  |  -.1864284   .1738977    -1.07   0.284    -.5272621    .1544054
         1994  |   -.189655   .1739014    -1.09   0.275     -.530496    .1511861
         1995  |  -.1974615   .1739022    -1.14   0.256    -.5383039     .143381
         1996  |  -.2074132    .173905    -1.19   0.233    -.5482613    .1334349
         1997  |  -.2124241   .1739139    -1.22   0.222    -.5532895    .1284412
         1998  |  -.2229566    .173913    -1.28   0.200    -.5638204    .1179071
         1999  |  -.2203814   .1739214    -1.27   0.205    -.5612616    .1204989
         2000  |  -.2351397   .1739224    -1.35   0.176    -.5760217    .1057424
         2001  |  -.2330499   .1739426    -1.34   0.180    -.5739717    .1078719
         2002  |  -.2494463    .173944    -1.43   0.152    -.5903708    .0914783
         2003  |  -.2581861   .1739593    -1.48   0.138    -.5991406    .0827684
         2004  |  -.2735365   .1740206    -1.57   0.116    -.6146112    .0675381
         2005  |  -.2644234   .1742974    -1.52   0.129    -.6060404    .0771937
         2006  |  -.2886874   .1759108    -1.64   0.101    -.6334668    .0560919
               |
 lastbirthyear |
         1935  |   .4237589   .1880128     2.25   0.024       .05526    .7922578
         1936  |   .0171029   .0076155     2.25   0.025     .0021768    .0320291
         1937  |  -.7299427   .1709192    -4.27   0.000    -1.064939   -.3949468
         1938  |   .1768532   .2933207     0.60   0.547    -.3980456     .751752
         1940  |  -.4911782   .2220403    -2.21   0.027    -.9263698   -.0559866
         1941  |   .1731454   .2360775     0.73   0.463    -.2895586    .6358494
         1942  |    -.09876   .2120111    -0.47   0.641    -.5142947    .3167746
         1943  |  -.3945237   .1982889    -1.99   0.047    -.7831633   -.0058841
         1944  |  -.4034769   .1975003    -2.04   0.041    -.7905709    -.016383
         1945  |  -.4968518   .1823591    -2.72   0.006    -.8542696    -.139434
         1946  |  -.4794768   .1785567    -2.69   0.007    -.8294421   -.1295115
         1947  |  -.5095376    .172952    -2.95   0.003    -.8485177   -.1705574
         1948  |   -.444649   .1735914    -2.56   0.010    -.7848824   -.1044155
         1949  |  -.4875039   .1711165    -2.85   0.004    -.8228866   -.1521212
         1950  |  -.4370554   .1688138    -2.59   0.010    -.7679249    -.106186
         1951  |  -.4278569   .1682983    -2.54   0.011     -.757716   -.0979979
         1952  |  -.4485508   .1687144    -2.66   0.008    -.7792254   -.1178762
         1953  |  -.3591254    .179887    -2.00   0.046    -.7116978   -.0065529
         1963  |   .1520075   .2948776     0.52   0.606    -.4259429    .7299578
         1964  |  -.3256053   .0640896    -5.08   0.000    -.4512188   -.1999918
         1965  |   .1888642   .1746862     1.08   0.280     -.153515    .5312434
         1966  |   -.050194   .1167988    -0.43   0.667    -.2791157    .1787278
         1967  |  -.1584457   .0812723    -1.95   0.051    -.3177367    .0008454
         1968  |  -.0542421   .0504142    -1.08   0.282    -.1530522     .044568
         1969  |   -.145554   .0506825    -2.87   0.004    -.2448899   -.0462181
         1970  |  -.0521823   .0450463    -1.16   0.247    -.1404716    .0361071
         1971  |  -.1041035   .0372147    -2.80   0.005    -.1770432   -.0311639
         1972  |  -.0626176   .0322821    -1.94   0.052    -.1258894    .0006543
         1973  |  -.0353884   .0291333    -1.21   0.224    -.0924887    .0217119
         1974  |  -.0431964   .0304877    -1.42   0.157    -.1029512    .0165585
         1975  |  -.0383735   .0253728    -1.51   0.130    -.0881034    .0113564
         1976  |  -.0642285   .0231072    -2.78   0.005    -.1095177   -.0189392
         1977  |  -.0295221   .0231197    -1.28   0.202    -.0748359    .0157917
         1978  |  -.0500044   .0217718    -2.30   0.022    -.0926765   -.0073323
         1979  |   -.049563   .0217035    -2.28   0.022    -.0921012   -.0070249
         1980  |  -.0148507   .0207282    -0.72   0.474    -.0554773    .0257758
         1981  |  -.0158386   .0206843    -0.77   0.444    -.0563792    .0247019
         1982  |  -.0146871   .0201909    -0.73   0.467    -.0542607    .0248865
         1983  |  -.0175839   .0200835    -0.88   0.381    -.0569469     .021779
         1984  |   -.020823   .0197614    -1.05   0.292    -.0595546    .0179086
         1985  |  -.0083943   .0197017    -0.43   0.670     -.047009    .0302204
         1986  |  -.0166465   .0195087    -0.85   0.393    -.0548829    .0215898
         1987  |  -.0067169   .0193995    -0.35   0.729    -.0447393    .0313056
         1988  |  -.0182084    .019257    -0.95   0.344    -.0559515    .0195346
         1989  |  -.0087037   .0192049    -0.45   0.650    -.0463446    .0289372
         1990  |  -.0019952    .019128    -0.10   0.917    -.0394854     .035495
         1991  |   .0002921   .0190847     0.02   0.988    -.0371134    .0376975
         1992  |  -.0018892   .0190362    -0.10   0.921    -.0391995    .0354211
         1993  |   .0020977   .0190307     0.11   0.912    -.0352018    .0393971
         1994  |  -.0034409   .0189881    -0.18   0.856     -.040657    .0337752
         1995  |   .0043785   .0189703     0.23   0.817    -.0328026    .0415596
         1996  |  -.0019294   .0189521    -0.10   0.919    -.0390748     .035216
         1997  |  -.0028175   .0189379    -0.15   0.882    -.0399351    .0343001
         1998  |  -.0025677    .018922    -0.14   0.892    -.0396543    .0345189
         1999  |   -.007251   .0189155    -0.38   0.701    -.0443247    .0298227
         2000  |  -.0137534   .0189048    -0.73   0.467    -.0508062    .0232994
         2001  |  -.0020983   .0189367    -0.11   0.912    -.0392136     .035017
         2002  |  -.0007718   .0189041    -0.04   0.967    -.0378232    .0362796
         2003  |   .0007431   .0188891     0.04   0.969     -.036279    .0377651
         2004  |   .0064923   .0189625     0.34   0.732    -.0306737    .0436582
         2005  |  -.0101937   .0191969    -0.53   0.595     -.047819    .0274315
         2006  |          0  (omitted)
               |
      country2 |  -.5080771   .0056156   -90.48   0.000    -.5190834   -.4970708
      country3 |  -.5077758   .0069589   -72.97   0.000     -.521415   -.4941367
      country4 |  -.5705996      .0059   -96.71   0.000    -.5821633   -.5590359
      country5 |  -.5810163   .0056964  -102.00   0.000     -.592181   -.5698516
      country6 |  -.5869266   .0066145   -88.73   0.000    -.5998909   -.5739624
      country7 |  -.4869529    .006902   -70.55   0.000    -.5004806   -.4734253
      country8 |  -.6100942   .0072087   -84.63   0.000    -.6242231   -.5959653
      country9 |  -.5395766   .0052688  -102.41   0.000    -.5499033   -.5292499
     country10 |          0  (omitted)
     country11 |  -.4422942   .0082431   -53.66   0.000    -.4584503    -.426138
     country12 |          0  (omitted)
     country13 |  -.5331583   .0110978   -48.04   0.000    -.5549097    -.511407
     country14 |  -.5391253   .0049795  -108.27   0.000     -.548885   -.5293656
     country15 |  -.5925528   .0062803   -94.35   0.000     -.604862   -.5802437
     country16 |  -.6001304    .007444   -80.62   0.000    -.6147204   -.5855403
     country17 |  -.6048737   .0070314   -86.02   0.000     -.618655   -.5910924
     country18 |  -.5621576   .0057351   -98.02   0.000    -.5733982   -.5509171
     country19 |  -.5640083    .004963  -113.64   0.000    -.5737357   -.5542809
     country20 |          0  (omitted)
     country21 |  -.1801693    .009225   -19.53   0.000      -.19825   -.1620885
     country22 |  -.6537427   .0055219  -118.39   0.000    -.6645655   -.6429199
     country23 |  -.6763013   .0072445   -93.35   0.000    -.6905004   -.6621023
     country24 |  -.6480397   .0059767  -108.43   0.000    -.6597539   -.6363256
     country25 |  -.6369078   .0053281  -119.54   0.000    -.6473507   -.6264648
     country26 |  -.5550209   .0057522   -96.49   0.000    -.5662951   -.5437467
     country27 |  -.5634212   .0055138  -102.18   0.000    -.5742282   -.5526143
     country28 |  -.6115601   .0060821  -100.55   0.000    -.6234808   -.5996393
     country29 |          0  (omitted)
     country30 |  -.5621745   .0060998   -92.16   0.000    -.5741299   -.5502192
     country31 |  -.5904177    .005308  -111.23   0.000    -.6008212   -.5800143
     country32 |          0  (omitted)
     country33 |  -.6095883   .0061416   -99.26   0.000    -.6216256   -.5975509
     country34 |          0  (omitted)
     country35 |  -.6128762   .0052217  -117.37   0.000    -.6231106   -.6026417
     country36 |          0  (omitted)
     country37 |  -.5864043   .0056216  -104.31   0.000    -.5974225   -.5753861
     country38 |  -.4525087   .0094427   -47.92   0.000     -.471016   -.4340013
     country39 |          0  (omitted)
     country40 |  -.5567981   .0063503   -87.68   0.000    -.5692445   -.5443518
     country41 |          0  (omitted)
     country42 |  -.4248165   .0072913   -58.26   0.000    -.4391072   -.4105259
     country43 |  -.5259889   .0068313   -77.00   0.000    -.5393781   -.5125997
     country44 |          0  (omitted)
     country45 |  -.5606677   .0063691   -88.03   0.000    -.5731509   -.5481845
     country46 |  -.6752176   .0058783  -114.87   0.000    -.6867389   -.6636963
        mort15 |   .0423761   .2165934     0.20   0.845    -.3821398     .466892
         _cons |   .8563136   .1735437     4.93   0.000     .5161737    1.196454
--------------------------------------------------------------------------------

. 
end of do-file

. use $Data/Twins/DHS_Base, clear

. clear all

. cd
/home/damiancclarke

. cd computacion/StataPrograms/Plugins
/home/damiancclarke/computacion/StataPrograms/Plugins

. ls

total 8
drwxrwxr-x 3 damiancclarke damiancclarke 4096 sep  2 22:28 regression/
drwxrwxr-x 2 damiancclarke damiancclarke 4096 ago 30 12:23 Test/

. cd regression
/home/damiancclarke/computacion/StataPrograms/Plugins/regression

. ls

total 128
-rw-rw-r-- 1 damiancclarke damiancclarke   588 ago 30 13:57 regession_input.do
-rw-rw-r-- 1 damiancclarke damiancclarke  8940 ago 29 17:58 regression.c
-rw-rw-r-- 1 damiancclarke damiancclarke  8962 ago 29 17:01 regression.c~
-rwxrwxr-x 1 damiancclarke damiancclarke 16936 ago 29 16:11 regression_input*
-rw-rw-r-- 1 damiancclarke damiancclarke  9462 sep  1 23:49 regression_input1.c
-rw-rw-r-- 1 damiancclarke damiancclarke  9618 sep  1 23:49 regression_input1.c~
-rw-rw-r-- 1 damiancclarke damiancclarke  8738 sep  2 22:28 regression_input.c
-rw-rw-r-- 1 damiancclarke damiancclarke  8741 sep  2 04:08 regression_input.c~
-rwxrwxr-x 1 damiancclarke damiancclarke 16662 sep  2 04:06 regression_input.plugin*
-rw-rw-r-- 1 damiancclarke damiancclarke   199 ago 28 21:09 stplugin.c
-rw-rw-r-- 1 damiancclarke damiancclarke  5701 ago 28 21:09 stplugin.h

. set obs 100
obs was 0, now 100

. gen y=runiform()

. gen x1=1

. gen x2=rnormal()

. gen x3=rnormal()

. doedit

. count
  100

. return list

scalars:
                  r(N) =  100

. h syntax

. cd .
/home/damiancclarke/computacion/StataPrograms/Plugins/regression

. program "/home/damiancclarke/computacion/StataPrograms/Plugins/regression/regression_input", plugin
"/home/damiancclarke/computacion/StataPrograms/Plugins/regression/regression_input invalid name
r(198);

. local i=2

. dis local
local not found
r(111);

. dis "`i'"
2

. return list

scalars:
                  r(N) =  100

. ereturn list

. sreturn list

macros:
         s(width_col1) : "15"
              s(width) : "80"

. do "/home/damiancclarke/computacion/StataPrograms/Plugins/regression/regresion_input.ado"

. global plugin_loc "/home/damiancclarke/computacion/StataPrograms/Plugins/regression/"

. cd $plugin_loc
/home/damiancclarke/computacion/StataPrograms/Plugins/regression

. 
. 
. program parallelregres
  1.         version 9.2
  2.         syntax varlist
  3.         
.         tokenize `varlist'
  4.         local y `1'
  5.         macro shift
  6.         local x `*'
  7.         
. *       local i = 1
. *       while "`1'" != "" {
. *               local x`i' `1'
. *               macro shift
. *               local ++i
. *       }
. 
. plugin call regression_input `x' `y',  
  8. 
. end

. 
. program regression_input, plugin

. 
. 
end of do-file

. parallelregres y x1 x2 x3
