-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/Twins_Setup.txt
  log type:  text
 opened on:  29 May 2014, 11:35:42

. 
. ********************************************************************************
. *** (1) Take necessary variables from BR (mother births) and PR (household me-
. *** mber) The BR dataset has the majority of family and maternal characterist-
. *** ics used in the regressions, however there is no child education variables
. *** in this dataset.  The child education information comes from PR.
. ********************************************************************************
. ***Do in parts as merge of full dataset is impossible with 8gb of RAM
. foreach num of numlist 1(1)7 {
  2.         use $DATA/World_BR_p`num', clear
  3. 
.         keep _cou _year caseid v000-v026 v101 v106 v107 v130 v131 v133 v136 v137 /*
>         */ v149 v150 v151 v152 v190 v191 v201 v202 v203 v204 v205 v206 v207 v208 /*
>         */ v209 v211 v212 v213 v228 v229 v230 v437 v438 v445 v457 v463a v481 v501/*
>         */ v504 v602 v605 v715 v701 v730 bord b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11/*
>         */ b12 b13 b14 b15 b16 v613 v614 m19 m19a v367 v312 v364 m4 m5 m8 m9 m10 /*
>         */ m12 m14 m15 m16 m17 m18 m19 m19a m2a m2b m2n bidx
  4.         
.         cap rename v010 year_birth
  5.         cap rename v012 agemay
  6.         cap rename v106 educlevel_f
  7.         cap rename v130 religion
  8.         cap rename v133 educf
  9.         cap rename v137 kids_under5
 10.         cap rename v140 rural
 11.         cap rename v190 wealth
 12.         cap rename v201 fert
 13.         cap rename v212 agefirstbirth
 14.         cap rename v228 terminated_preg
 15.         cap rename v437 weightk
 16.         cap rename v438 height
 17.         cap rename v445 bmi
 18.         cap rename v367 wanted_last_child
 19.         cap rename v312 contracep_method
 20.         cap rename v364 contracep_intent
 21.         cap rename b0 twin
 22.         cap rename b2 child_yob
 23.         cap rename b3 child_dob
 24.         cap rename b4 sex
 25.         cap rename b5 child_alive
 26.         cap rename b8 age 
 27.         cap rename b11 birthspacing
 28.         cap rename v715 educp
 29.         cap rename v701 educp_level
 30.         cap rename m14 antenatal
 31.         cap rename m2a prenate_doc
 32.         cap rename m2b prenate_nurse
 33.         cap rename m2n prenate_none
 34.         
.         replace age=floor(v007-child_yob+(v006-b1/12)) if age==.
 35. 
.         cap drop if _cou=="Cameroon" & _year=="1991"
 36.         * no v002 recorded.  This could be saved by a split of caseid if desired...
.         
.         **The following lines correct for the fact that we only observe each births'
.         **mothers' relationship to the household head.  In this way, if the mother 
.         **is the wife, the birth must be the child of the household head.
.         gen relationship=3 if v150==1|v150==2|v150==9
 37.         replace relationship=5 if v150==3|v150==4|v150==11
 38.         replace relationship=8 if v150==6|v150==7
 39.         replace relationship=10 if v150==8|v150==10|v150==12|v150==5
 40. 
.         egen id=concat(_cou _year v001 v002)
 41.         bys id relationship age sex (bidx): gen counter=_n
 42.         bys id relationship age sex counter: gen tester=_N
 43. 
.         sum tester
 44.         if r(max)!=1 {
 45.                 tab _cou if tester!=1
 46.                 dis as err "Merging error. Check that country id (v001, v002) is correct"
 47.                 exit 2727
 48.         }
 49.         drop tester
 50.         
.         save $TEMP/BR`num', replace
 51. }
(139917 real changes made)
(160524 missing values generated)
(73894 real changes made)
(10271 real changes made)
(28920 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    953688           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR1.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR1.dta saved
(123698 real changes made)
(239965 missing values generated)
(96398 real changes made)
(7596 real changes made)
(47175 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1111913           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR2.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR2.dta saved
(96080 real changes made)
(174447 missing values generated)
(131355 real changes made)
(12565 real changes made)
(26450 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    800833           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR3.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR3.dta saved
(176905 real changes made)
(293330 missing values generated)
(103013 real changes made)
(8266 real changes made)
(36792 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1512325           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR4.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR4.dta saved
(161145 real changes made)
(185507 missing values generated)
(81325 real changes made)
(6349 real changes made)
(36191 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    963337           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR5.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR5.dta saved
(117864 real changes made)
(227575 missing values generated)
(81341 real changes made)
(3564 real changes made)
(42377 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    898484           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR6.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR6.dta saved
(58299 real changes made)
(107017 missing values generated)
(36005 real changes made)
(2200 real changes made)
(15511 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    456817           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR7.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR7.dta saved

. 
. 
. foreach num of numlist 1(1)7 {
  2.         use $DATA/World_PR_p`num', clear
  3. 
.         keep _cou _year hhid hvidx hv000-hv003 hv101 hv104 hv105 hv106 hv121 hv122/*
>         */ hv123 hv129 hv108
  4. 
.         cap rename hv101 relationship
  5.         cap rename hv104 sex
  6.         cap rename hv105 age
  7.         cap rename hv106 educlevel
  8.         cap rename hv121 attend_year
  9.         cap rename hv129 attend
 10.         cap rename hv108 educ
 11.         rename hv001 v001
 12.         rename hv002 v002
 13.         rename hv003 v003
 14.         egen id=concat(_cou _year v001 v002)
 15. 
.         bys id relationship age sex (hvidx): gen counter=_n
 16.         bys id relationship age sex counter: gen tester=_N
 17. 
.         sum tester
 18.         if r(max)!=1 {
 19.                 tab _cou if tester!=1
 20.                 dis as err "Merging error. Check that country id (v001, v002) is correct"
 21.                 exit 2727
 22.         }
 23.         drop tester
 24.         save $TEMP/PR`num', replace
 25. }

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1613820           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR1.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR1.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1939546           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR2.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR2.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1566367           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR3.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR3.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   2633767           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR4.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR4.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   2198952           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR5.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR5.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |   1519532           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR6.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR6.dta saved

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      tester |    813996           1           0          1          1
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR7.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR7.dta saved

. 
. ***Merge PR and BR (still in parts)
. foreach num of numlist 1(1)7 {
  2.         use $TEMP/PR`num'
  3.         merge 1:1 id relationship age sex counter using $TEMP/BR`num'
  4.         keep if _merge==3|_merge==2 //updated Apr 24, 2013
  5.         save $TEMP/c`num', replace
  6.         clear
  7.         rm "$TEMP/PR`num'.dta"
  8.         rm "$TEMP/BR`num'.dta"
  9. }
relationship was byte now float
(label LABH already defined)
(label LABG already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,444,182
        from master                 1,052,157  (_merge==1)
        from using                    392,025  (_merge==2)

    matched                           561,663  (_merge==3)
    -----------------------------------------
(1052157 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c1.dta not found)
file ~/investigacion/Activa/Twins/Temp/c1.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,784,997
        from master                 1,306,315  (_merge==1)
        from using                    478,682  (_merge==2)

    matched                           633,231  (_merge==3)
    -----------------------------------------
(1306315 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c2.dta not found)
file ~/investigacion/Activa/Twins/Temp/c2.dta saved
relationship was byte now float
(label LABI already defined)
(label LABE already defined)
(label LABD already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,408,190
        from master                 1,086,862  (_merge==1)
        from using                    321,328  (_merge==2)

    matched                           479,505  (_merge==3)
    -----------------------------------------
(1086862 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c3.dta not found)
file ~/investigacion/Activa/Twins/Temp/c3.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,332,424
        from master                 1,726,933  (_merge==1)
        from using                    605,491  (_merge==2)

    matched                           906,834  (_merge==3)
    -----------------------------------------
(1726933 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c4.dta not found)
file ~/investigacion/Activa/Twins/Temp/c4.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,161,267
        from master                 1,698,441  (_merge==1)
        from using                    462,826  (_merge==2)

    matched                           500,511  (_merge==3)
    -----------------------------------------
(1698441 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c5.dta not found)
file ~/investigacion/Activa/Twins/Temp/c5.dta saved
v001 was int now long
v003 was byte now int
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,454,158
        from master                 1,037,603  (_merge==1)
        from using                    416,555  (_merge==2)

    matched                           481,929  (_merge==3)
    -----------------------------------------
(1037603 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c6.dta not found)
file ~/investigacion/Activa/Twins/Temp/c6.dta saved
_cou was str10 now str19
relationship was byte now float
id was str20 now str29

    Result                           # of obs.
    -----------------------------------------
    not matched                       790,567
        from master                   573,873  (_merge==1)
        from using                    216,694  (_merge==2)

    matched                           240,123  (_merge==3)
    -----------------------------------------
(573873 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/c7.dta not found)
file ~/investigacion/Activa/Twins/Temp/c7.dta saved

. 
. 
. use $TEMP/c1

. append using $TEMP/c2 $TEMP/c3 $TEMP/c4 $TEMP/c5 $TEMP/c6 $TEMP/c7
v003 was byte now int
_cou was str12 now str25
id was str22 now str35
(label _merge already defined)
(label m16 already defined)
(label b14 already defined)
(label v013 already defined)
(label LABB already defined)
(label v015 already defined)
(label LABC already defined)
(label v020 already defined)
(label v023 already defined)
(label LABD already defined)
(label LABE already defined)
(label v106 already defined)
(label v130 already defined)
(label v149 already defined)
(label v150 already defined)
(label v152 already defined)
(label v213 already defined)
(label LABN already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v730 already defined)
(label b0 already defined)
(label b6 already defined)
(label b9 already defined)
(label b13 already defined)
(label b16 already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label v190 already defined)
(label hv121 already defined)
(label hv129 already defined)
(label hv101 already defined)
(label hv104 already defined)
(label hv105 already defined)
(label hv106 already defined)
(label hv108 already defined)
(label _merge already defined)
(label m16 already defined)
(label v013 already defined)
(label LABB already defined)
(label v015 already defined)
(label LABC already defined)
(label v020 already defined)
(label LABF already defined)
(label v106 already defined)
(label LABH already defined)
(label v133 already defined)
(label v149 already defined)
(label v150 already defined)
(label v152 already defined)
(label LABK already defined)
(label v190 already defined)
(label LABM already defined)
(label v213 already defined)
(label LABN already defined)
(label LABO already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v730 already defined)
(label b0 already defined)
(label b6 already defined)
(label b9 already defined)
(label b13 already defined)
(label b16 already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label hv121 already defined)
(label hv129 already defined)
(label LABD already defined)
(label LABE already defined)
(label hv101 already defined)
(label hv106 already defined)
(label hv108 already defined)
(label LABI already defined)
(label _merge already defined)
(label m12 already defined)
(label m16 already defined)
(label v481 already defined)
(label b14 already defined)
(label v013 already defined)
(label v015 already defined)
(label v020 already defined)
(label v023 already defined)
(label v101 already defined)
(label v106 already defined)
(label v130 already defined)
(label v131 already defined)
(label v133 already defined)
(label v149 already defined)
(label v150 already defined)
(label v152 already defined)
(label v213 already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v730 already defined)
(label b0 already defined)
(label b6 already defined)
(label b9 already defined)
(label b13 already defined)
(label b16 already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label v190 already defined)
(label hv123 already defined)
(label hv101 already defined)
(label hv104 already defined)
(label hv105 already defined)
(label hv106 already defined)
(label hv108 already defined)
(label hv121 already defined)
(label hv122 already defined)
(label hv129 already defined)
(label _merge already defined)
(label m12 already defined)
(label m16 already defined)
(label LABH already defined)
(label v190 already defined)
(label b16 already defined)
(label v013 already defined)
(label v014 already defined)
(label v015 already defined)
(label v018 already defined)
(label v019 already defined)
(label v020 already defined)
(label v023 already defined)
(label v024 already defined)
(label v025 already defined)
(label v101 already defined)
(label v106 already defined)
(label v130 already defined)
(label v131 already defined)
(label v133 already defined)
(label v149 already defined)
(label v150 already defined)
(label v151 already defined)
(label v213 already defined)
(label v228 already defined)
(label v229 already defined)
(label v230 already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v715 already defined)
(label v730 already defined)
(label b0 already defined)
(label b5 already defined)
(label b6 already defined)
(label b9 already defined)
(label b10 already defined)
(label b13 already defined)
(label b14 already defined)
(label b15 already defined)
(label m2a already defined)
(label m2b already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m9 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m17 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label hv121 already defined)
(label hv122 already defined)
(label hv123 already defined)
(label hv129 already defined)
(label hv101 already defined)
(label hv104 already defined)
(label hv105 already defined)
(label hv106 already defined)
(label hv108 already defined)
(label _merge already defined)
(label m12 already defined)
(label m16 already defined)
(label v013 already defined)
(label v014 already defined)
(label v015 already defined)
(label v018 already defined)
(label v019 already defined)
(label v020 already defined)
(label v023 already defined)
(label v024 already defined)
(label v025 already defined)
(label v026 already defined)
(label v101 already defined)
(label v106 already defined)
(label v130 already defined)
(label v133 already defined)
(label v149 already defined)
(label v150 already defined)
(label v151 already defined)
(label v152 already defined)
(label v190 already defined)
(label v213 already defined)
(label v228 already defined)
(label v229 already defined)
(label v230 already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label v445 already defined)
(label v457 already defined)
(label v463a already defined)
(label v481 already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v715 already defined)
(label v730 already defined)
(label b0 already defined)
(label b5 already defined)
(label b6 already defined)
(label b9 already defined)
(label b10 already defined)
(label b13 already defined)
(label b15 already defined)
(label b16 already defined)
(label m2a already defined)
(label m2b already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m9 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m17 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label LABC already defined)
(label LABD already defined)
(label LABF already defined)
(label hv101 already defined)
(label LABH already defined)
(label LABI already defined)
(label hv121 already defined)
(label hv129 already defined)
(label _merge already defined)
(label m12 already defined)
(label m16 already defined)
(label v007 already defined)
(label v013 already defined)
(label LABB already defined)
(label v015 already defined)
(label LABC already defined)
(label v020 already defined)
(label v023 already defined)
(label LABD already defined)
(label LABE already defined)
(label LABF already defined)
(label v106 already defined)
(label v130 already defined)
(label v133 already defined)
(label v149 already defined)
(label v150 already defined)
(label LABI already defined)
(label v152 already defined)
(label LABJ already defined)
(label v190 already defined)
(label v213 already defined)
(label LABL already defined)
(label LABM already defined)
(label LABO already defined)
(label v312 already defined)
(label v364 already defined)
(label v367 already defined)
(label LABZ already defined)
(label v501 already defined)
(label v504 already defined)
(label v602 already defined)
(label v605 already defined)
(label v613 already defined)
(label v614 already defined)
(label v701 already defined)
(label v730 already defined)
(label b0 already defined)
(label b6 already defined)
(label b9 already defined)
(label b13 already defined)
(label b16 already defined)
(label m2n already defined)
(label m4 already defined)
(label m5 already defined)
(label m8 already defined)
(label m10 already defined)
(label m14 already defined)
(label m15 already defined)
(label m18 already defined)
(label m19 already defined)
(label m19a already defined)
(label hv101 already defined)
(label hv104 already defined)
(label hv105 already defined)
(label hv106 already defined)
(label hv108 already defined)
(label hv121 already defined)
(label hv122 already defined)
(label hv123 already defined)
(label hv129 already defined)

. 
. foreach num of numlist 1(1)7 {
  2.         rm $TEMP/c`num'.dta
  3. }

. rmdir $TEMP

. 
. replace _cou="CAR" if hv000=="CF3" &_cou==""
(0 real changes made)

. replace _cou="Zimbabwe" if hv000=="ZW6" &_cou==""
(0 real changes made)

. replace _year="2004" if hv000=="CF3" &_year==""
(0 real changes made)

. replace _year="2010" if hv000=="ZW6" &_year==""
(0 real changes made)

. 
. ***Year of birth for Nepal (convert from Vikram Samvat to Gregorian calendar)
. foreach year of varlist child_yob year_birth {
  2.         replace `year'=`year'+2000 if _cou=="Nepal" & `year'<100
  3.         replace `year'=`year'-57 if _cou=="Nepal"
  4. }
(29156 real changes made)
(111120 real changes made)
(29156 real changes made)
(111120 real changes made)

. ***Year of birth for Ethiopia (convert from Ge'ez to Gregorian calendar)
. foreach year of varlist child_yob year_birth {
  2.         replace `year'=`year'+8 if _cou=="Ethiopia"
  3. }
(129595 real changes made)
(129595 real changes made)

. 
. replace child_yob=child_yob+1900 if child_yob<100&child_yob>2
(2918134 real changes made)

. replace child_yob=child_yob+2000 if child_yob<=2
(2192 real changes made)

. replace year_birth=year_birth+1900 if year_birth<100
(2920326 real changes made)

. replace age=age+100 if age<0
(5537 real changes made)

. 
. ********************************************************************************
. *** (2) Setup Variables which are used in TwinRegression
. *** (2A) Generate sibling size subgroups (1+, 2+, 3+,...)  As per Angrist et al.
. ********************************************************************************
. gen mid="a"

. drop id

. egen id=concat(_cou mid _year mid v001 mid v002 mid v150 mid caseid)

. drop mid

. 
. local max 1

. local fert 2

. 
. gen twin_bord=bord-twin+1 if twin>0
(6543069 missing values generated)

. 
. foreach num in two three four five {
  2.         gen `num'_plus=(bord>=1&bord<=`max')&fert>=`fert'
  3.         gen `num'_plus_twins=((bord>=1&bord<=`fert')&fert>=`fert')|twin_bord==`fert'
  4.         replace `num'_plus=0 if twin!=0
  5.         gen twin`num'=(twin==1 & bord==`fert')|(twin==2 & bord==`fert'+1)
  6.         bys id: egen twin_`num'_fam=max(twin`num')
  7.         drop twin`num'
  8.         local ++max
  9.         local ++fert
 10. }
(13462 real changes made)
(34046 real changes made)
(46945 real changes made)
(51990 real changes made)

. 
. 
. ********************************************************************************
. *** (2B) "Quality" variables
. ********************************************************************************
. *** Attendance (attend_year==2 is sometimes)
. gen attendance=0 if attend_year==0
(5592640 missing values generated)

. replace attendance=1 if attend_year==2
(486601 real changes made)

. replace attendance=2 if attend_year==1
(387564 real changes made)

. replace attendance=. if age<6
(755963 real changes made, 755963 to missing)

. 
. *** Z-Score
. replace educ=. if educ>25 // come back here when compiling summary stats.
(12904 real changes made, 12904 to missing)

. bys _cou age: egen sd_educ=sd(educ)
(204749 missing values generated)

. bys _cou age: egen mean_educ=mean(educ)
(192968 missing values generated)

. gen school_zscore=(educ-mean_educ)/sd_educ
(4096736 missing values generated)

. replace school_zscore=. if age<6
(253569 real changes made, 253569 to missing)

. 
. *** Highschool
. gen highschool=1 if (educlevel==2|educlevel==3)&age>=11
(6063771 missing values generated)

. replace highschool=0 if (educlevel==0|educlevel==1)&age>=11
(745618 real changes made)

. 
. *** No Educ
. gen noeduc=1 if educlevel==0&age>6
(6393414 missing values generated)

. replace noeduc=0 if (educlevel==1|educlevel==2|educlevel==3)&age>6
(1845079 real changes made)

. 
. *** Health
. gen childsurvive=child_alive

. gen childageatdeath=b7/12
(5825861 missing values generated)

. gen infantmortality=childageatdeath<=1

. replace infantmortality=. if age<1
(316192 real changes made, 316192 to missing)

. gen childmortality=childageatdeath<=5

. replace childmortality=. if age<5
(1514974 real changes made, 1514974 to missing)

. 
. ********************************************************************************
. *** (2C) Control variables
. ********************************************************************************
. gen ALL=1

. gen gender="F" if sex==2
(3429554 missing values generated)

. replace gender="M" if sex==1
(3429545 real changes made)

. 
. gen educfyrs_sq=educf*educf
(2057 missing values generated)

. gen educf_0=educf==0

. gen educf_1_4=educf>0&educf<5

. gen educf_5_6=educf>4&educf<7

. gen educf_7_10=educf>6&educf<11

. gen educf_11plus=educf>10

. gen educf_level=v149 if v149<8
(482849 missing values generated)

. gen twind=1 if twin>=1&twin!=.
(6543069 missing values generated)

. replace twind=0 if twin==0
(6543069 real changes made)

. gen twind100=twin*100

. gen malec=(gender=="M")

. 
. replace educp=. if educp>25
(186863 real changes made, 186863 to missing)

. 
. replace height=height/10
height was int now float
(3689159 real changes made)

. replace weight=weight/10
weightk was int now float
(3689140 real changes made)

. replace bmi=bmi/100
bmi was int now float
(3686643 real changes made)

. replace antenatal=. if antenatal>20
(19840 real changes made, 19840 to missing)

. gen antenateDummy=antenatal!=0 if antenatal!=.
(5572386 missing values generated)

. foreach var of varlist prenate_doc prenate_nurse prenate_none {
  2.         replace `var'=. if `var'==9
  3. }
(1098 real changes made, 1098 to missing)
(1098 real changes made, 1098 to missing)
(814 real changes made, 814 to missing)

. 
. gen poor1=wealth==1

. gen agesq=age*age

. gen magesq=agemay*agemay

. 
. gen motherage   = agemay - age

. gen motheragesq = motherage^2 

. gen motheragecub= motherage^3

. gen antesq = antenatal^2
(5572386 missing values generated)

. 
. gen bmi_sq    = bmi*bmi
(3010754 missing values generated)

. gen height_sq = height*height
(3008238 missing values generated)

. 
. gen underweight=bmi<=18.5 if bmi!=.
(3010754 missing values generated)

. gen overweight =bmi>25 if bmi!=.
(3010754 missing values generated)

. 
. *** General variables (country year)
. rename _cou country

. rename v005 sweight

. encode country, gen(_cou)

. 
. ********************************************************************************
. *** (2D) Twin variables
. ********************************************************************************
. bys id: egen twinfamily=max(twin)

. bys id: egen twin_bord_fam=max(twin_bord)
(6239689 missing values generated)

. bys id: egen nummultiple=max(twin)

. gen finaltwin=(fert==bord)&twind==1

. bys id: egen finaltwinfamily=max(finaltwin)

. replace finaltwinfamily=0 if finaltwinfamily==.
(0 real changes made)

. gen twindfamily=twinfamily!=0

. 
. ********************************************************************************
. *** (2E) Fertility variables
. ********************************************************************************
. gen idealnumkids=v613 if v613<25
(805504 missing values generated)

. gen lastbirth=fert==bord&twin==0

. replace lastbirth=1 if (twin_bord==(fert-1))&nummultiple==2
(52414 real changes made)

. replace lastbirth=1 if (twin_bord==(fert-2))&nummultiple==3
(974 real changes made)

. replace lastbirth=1 if (twin_bord==(fert-3))&nummultiple==4
(40 real changes made)

. 
. gen wantedbirth=bord<=idealnumkids

. gen idealfam=0 if idealnumkids==fert
(5404935 missing values generated)

. replace idealfam=1 if idealnumkids<fert
(2747361 real changes made)

. replace idealfam=-1 if idealnumkids>fert
(2657574 real changes made)

. 
. gen quant_exceed=fert-idealnumkids
(805504 missing values generated)

. gen exceeder=1 if bord-idealnumkids==1
(6196568 missing values generated)

. gen twinexceeder=exceeder==1&(twin==2|twin==3|twin==4)

. bys id: egen twinexceedfamily=max(twinexceeder)

. gen tu=twin_bord>=idealnumkids

. gen td=twin_bord>=idealnumkids

. bys id: egen twin_undesired=max(tu)

