-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/TwinSetup2.log
  log type:  text
 opened on:  12 Sep 2012, 14:43:19

. 
. *******************************************************************************
. ****(2) Maternal variables from IR
. *******************************************************************************
. gen maternal_weight = v437 / 10
v437 not found
r(111);

end of do-file

r(111);

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. use NMIR51DT.dta

. do "/tmp/SD01930.000000"

. gen maternal_weight = v437 / 10
(242 missing values generated)

. gen maternal_height = v438 / 1000
(252 missing values generated)

. gen maternal_bmi = maternal_height / (maternal_weight^2)
(263 missing values generated)

. 
end of do-file

. sum maternal_b

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
maternal_bmi |      9541    .0005239    .0002238   .0000641   .0029258

. sum maternal_h

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
maternal_h~t |      9552    1.602841    .0714981       .869       1.96

. sum maternal_w

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
maternal_w~t |      9562    59.72673    15.21003       17.8        164

. h label

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
-----------------------------------------------------------------------------------------------------------------------------
v106            byte   %8.0g       v106       highest educational level
v107            byte   %8.0g                  highest year of education
v133            byte   %8.0g       v133       education in single years
v149            byte   %8.0g       v149       educational attainment
awfacte         byte   %8.0g                  all woman factor - educational
v701            byte   %8.0g       v701       partner's education level
v702            byte   %8.0g       v702       highest year of education
v715            byte   %8.0g       v715       husbands education-single yrs
v729            byte   %8.0g       v729       partner's educational attainm.
v754bp          byte   %8.0g       v754bp     reduce risk of getting aids by not having sex at all
v754cp          byte   %8.0g       v754cp     reduce chances of aids by always using condoms during sex
v754dp          byte   %8.0g       v754dp     reduce chance of aids: have 1 sex partner with no oth partne

. lookfor twin

              storage  display     value
variable name   type   format      label      variable label
-----------------------------------------------------------------------------------------------------------------------------
b0_01           byte   %8.0g       b0_01      child is twin
b0_02           byte   %8.0g       b0_02      child is twin
b0_03           byte   %8.0g       b0_03      child is twin
b0_04           byte   %8.0g       b0_04      child is twin
b0_05           byte   %8.0g       b0_05      child is twin
b0_06           byte   %8.0g       b0_06      child is twin
b0_07           byte   %8.0g       b0_07      child is twin
b0_08           byte   %8.0g       b0_08      child is twin
b0_09           byte   %8.0g       b0_09      child is twin
b0_10           byte   %8.0g       b0_10      child is twin
b0_11           byte   %8.0g       b0_11      child is twin
b0_12           byte   %8.0g       b0_12      child is twin
b0_13           byte   %8.0g       b0_13      child is twin
b0_14           byte   %8.0g       b0_14      child is twin
b0_15           byte   %8.0g       b0_15      child is twin
b0_16           byte   %8.0g       b0_16      child is twin
b0_17           byte   %8.0g       b0_17      child is twin
b0_18           byte   %8.0g       b0_18      child is twin
b0_19           byte   %8.0g       b0_19      child is twin
b0_20           byte   %8.0g       b0_20      child is twin

. tab b0_01

  child is twin |      Freq.     Percent        Cum.
----------------+-----------------------------------
   single birth |      6,527       98.36       98.36
2nd of multiple |        109        1.64      100.00
----------------+-----------------------------------
          Total |      6,636      100.00

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. use NMKR51DT.dta, clear

. count
 5168

. use NMBR51DT.dta, clear

. count
19522

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
-----------------------------------------------------------------------------------------------------------------------------
v106            byte   %8.0g       v106       highest educational level
v107            byte   %8.0g                  highest year of education
v133            byte   %8.0g       v133       education in single years
v149            byte   %8.0g       v149       educational attainment
awfacte         byte   %8.0g                  all woman factor - educational
v701            byte   %8.0g       v701       partner's education level
v702            byte   %8.0g       LABS       highest year of education
v715            byte   %8.0g       LABQ       husbands education-single yrs
v729            byte   %8.0g       v729       partner's educational attainm.

. count if v133!=.
19513

. br

. use NMPR51DT.dta, clear
file NMPR51DT.dta not found
r(601);

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. use NMPR52DT.dta, clear

. count
42633

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
hv106           byte   %8.0g       LABM       highest educational level
hv107           byte   %8.0g       LABN       highest year of education
hv108           byte   %8.0g       LABO       education in single years
hv109           byte   %8.0g       hv109      educational attainment
hv122           byte   %8.0g       LABM       educational level during current school year
hv123           byte   %8.0g       LABN       grade of education during current school year
hv124           byte   %8.0g       LABO       education in single years - current school year
hv126           byte   %8.0g       LABM       educational level during previous school year
hv127           byte   %8.0g       LABN       grade of education during previous school year
hv128           byte   %8.0g       LABO       education in single years - previous school year
ha66            byte   %8.0g       LABX       woman's highest educational level
ha67            byte   %8.0g                  woman's highest year of education
ha68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hc61            byte   %8.0g       LABX       mother's highest educational level
hc62            byte   %8.0g                  mother's highest year of education
hc68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hs109           byte   %8.0g       LABZ       able to reduce the pain
hs111           byte   %8.0g       LABZ       able to reduce the nausea

. use NMHR51DT.dta, clear

. merge 1:m hv001 hv002 using NMPR51DT.dta
file NMPR51DT.dta not found
r(601);

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. merge 1:m hv001 hv002 using NMPR52DT.dta
(label sh143 already defined)
(label sh141 already defined)
(label sh140 already defined)
(label sh126e already defined)
(label sh126a1 already defined)
(label sh126a already defined)
(label shtrans already defined)
(label shqlang already defined)
(label hml1a already defined)
(label hml1 already defined)
(label hv270 already defined)
(label hv250 already defined)
(label hv249 already defined)
(label hv245 already defined)
(label hv241 already defined)
(label hv240 already defined)
(label hv239 already defined)
(label hv238 already defined)
(label hv236 already defined)
(label hv235 already defined)
(label hv234 already defined)
(label hv228 already defined)
(label hv226 already defined)
(label hv217 already defined)
(label hv215 already defined)
(label hv214 already defined)
(label hv213 already defined)
(label hv205 already defined)
(label hv204 already defined)
(label hv042 already defined)
(label hv027 already defined)
(label hv026 already defined)
(label hv025 already defined)
(label hv024 already defined)
(label hv023 already defined)
(label hv020 already defined)
(label hv015 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            42,633  (_merge==3)
    -----------------------------------------

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. use NMIR51DT.dta
no; data in memory would be lost
r(4);

. use NMIR51DT.dta, clear

. rename v001 hv001 

. rename v002 hv002

. merge 1:m hv001 hv002 using NMPR52DT.dta
variables hv001 hv002 do not uniquely identify observations in the master data
r(459);

. br

. use NMPR52DT.dta, clear

. br

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
hv106           byte   %8.0g       LABM       highest educational level
hv107           byte   %8.0g       LABN       highest year of education
hv108           byte   %8.0g       LABO       education in single years
hv109           byte   %8.0g       hv109      educational attainment
hv122           byte   %8.0g       LABM       educational level during current school year
hv123           byte   %8.0g       LABN       grade of education during current school year
hv124           byte   %8.0g       LABO       education in single years - current school year
hv126           byte   %8.0g       LABM       educational level during previous school year
hv127           byte   %8.0g       LABN       grade of education during previous school year
hv128           byte   %8.0g       LABO       education in single years - previous school year
ha66            byte   %8.0g       LABX       woman's highest educational level
ha67            byte   %8.0g                  woman's highest year of education
ha68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hc61            byte   %8.0g       LABX       mother's highest educational level
hc62            byte   %8.0g                  mother's highest year of education
hc68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hs109           byte   %8.0g       LABZ       able to reduce the pain
hs111           byte   %8.0g       LABZ       able to reduce the nausea

. use NMKR51DT.dta, clear

. br

. br

. sort caseid

. count
 5168

. use NMBR51DT.dta, clear

. br

. use NMKR51DT.dta, clear

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
v106            byte   %8.0g       v106       highest educational level
v107            byte   %8.0g                  highest year of education
v133            byte   %8.0g       v133       education in single years
v149            byte   %8.0g       v149       educational attainment
awfacte         byte   %8.0g                  all woman factor - educational
v701            byte   %8.0g       v701       partner's education level
v702            byte   %8.0g       LABS       highest year of education
v715            byte   %8.0g       LABQ       husbands education-single yrs
v729            byte   %8.0g       v729       partner's educational attainm.

. use NMPR52DT.dta, clear

. br

. lookfor relat

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
hv217           byte   %8.0g       hv217      relationship structure
hv101           byte   %8.0g       hv101      relationship to head

. order hv101 hv217

. br

. lookfor twin

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
hv106           byte   %8.0g       LABM       highest educational level
hv107           byte   %8.0g       LABN       highest year of education
hv108           byte   %8.0g       LABO       education in single years
hv109           byte   %8.0g       hv109      educational attainment
hv122           byte   %8.0g       LABM       educational level during current school year
hv123           byte   %8.0g       LABN       grade of education during current school year
hv124           byte   %8.0g       LABO       education in single years - current school year
hv126           byte   %8.0g       LABM       educational level during previous school year
hv127           byte   %8.0g       LABN       grade of education during previous school year
hv128           byte   %8.0g       LABO       education in single years - previous school year
ha66            byte   %8.0g       LABX       woman's highest educational level
ha67            byte   %8.0g                  woman's highest year of education
ha68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hc61            byte   %8.0g       LABX       mother's highest educational level
hc62            byte   %8.0g                  mother's highest year of education
hc68            byte   %8.0g       LABX       highest educational level (cs for preliminary & final report
hs109           byte   %8.0g       LABZ       able to reduce the pain
hs111           byte   %8.0g       LABZ       able to reduce the nausea

. tab hv101

    relationship to head |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    head |      9,200       21.58       21.58
         wife or husband |      3,708        8.70       30.28
            son/daughter |     12,215       28.65       58.93
     son/daughter-in-law |        399        0.94       59.86
              grandchild |      6,939       16.28       76.14
                  parent |        249        0.58       76.72
           parent-in-law |         67        0.16       76.88
          brother/sister |      1,611        3.78       80.66
          other relative |      3,010        7.06       87.72
    adopted/foster child |        694        1.63       89.35
             not related |      1,768        4.15       93.50
   niece/nephew by blood |      2,440        5.72       99.22
niece/nephew by marriage |        316        0.74       99.96
                      dk |          6        0.01       99.97
                      99 |         11        0.03      100.00
-------------------------+-----------------------------------
                   Total |     42,633      100.00

. use NMBR51DT.dta, clear

. lookfor twin

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
b0              byte   %8.0g       b0         child is twin

. tab b0

  child is twin |      Freq.     Percent        Cum.
----------------+-----------------------------------
   single birth |     19,021       97.43       97.43
1st of multiple |        250        1.28       98.71
2nd of multiple |        250        1.28       99.99
3rd of multiple |          1        0.01      100.00
----------------+-----------------------------------
          Total |     19,522      100.00

. count
19522

. ls

total 121760
-rw-rw-r-- 1 damiancclarke damiancclarke 22225077 sep 11 18:32 NMBR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2564259 sep 11 18:32 NMCR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 30298777 sep 11 18:32 NMHR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 44547161 sep 11 18:32 NMIR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  6018261 sep 11 18:32 NMKR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke  2572951 sep 11 18:32 NMMR51DT.dta
-rw-rw-r-- 1 damiancclarke damiancclarke 16433274 sep 11 18:32 NMPR52DT.dta

. use NMKR51DT.dta, clear

. count
 5168

. br

. use NMBR51DT.dta, clear

. br

. lookfor relati

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
v150            byte   %8.0g       v150       relationship to household head
v3a00u          byte   %8.0g       LABAM      source of fp for non-users:  friend, relative
v743d           byte   %8.0g       LABBE      final say on visits to family or relatives
m2h             byte   %8.0g       m2h        na - prenatal: relative
m3h             byte   %8.0g       m3h        assistance: relative, friend

. order v150

. lookfor age

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
v012            byte   %8.0g                  current age - respondent
v013            byte   %8.0g       v013       age 5-year groups
v152            byte   %8.0g       v152       age of household head
v212            byte   %8.0g                  age of respondent at 1st birth
v221            int    %8.0g       v221       marriage to first birth int.
v320            byte   %8.0g       v320       age at sterilization
v372            byte   %8.0g       LABV       shown pill package
v372a           byte   %8.0g       LABV       shown condom package
v447a           byte   %8.0g                  women's age in years from household report
v452a           byte   %8.0g       v452a      na - under age 18 (hh report)
v480            byte   %8.0g       LABAR      syringe and needle from new, unopened package
v482a           byte   %8.0g       LABBA      arrange care of biological children under age 18
v482b           byte   %8.0g       LABJ       primary caregiver of children under age 18
v507            byte   %8.0g                  month of first marriage
v508            int    %8.0g                  year of first marriage
v509            int    %8.0g                  date of first marriage (cmc)
v511            byte   %8.0g                  age at first marriage
v512            byte   %8.0g                  years since first marriage
v525            byte   %8.0g       v525       age at first intercourse
v531            byte   %8.0g       v531       age at first intercourse (imp)
v538            byte   %8.0g       v538       how previous marriage or union ended
v541            byte   %8.0g       v541       intends to postpone intercourse until marriage
v730            byte   %8.0g       v730       partners age
b6              int    %8.0g       b6         age at death
b7              int    %8.0g                  age at death (months-imputed)
b8              byte   %8.0g                  current age of child
b13             byte   %8.0g       b13        flag for age at death
h13b            byte   %8.0g       LABAR      na - given a pre-packaged ors liquid
hw1             byte   %8.0g                  age in months
sqlang          byte   %8.0g       sqlang     language of questionnaire
srlang          byte   %8.0g       LABCI      language of respondent
silang          byte   %8.0g       LABCI      language of interview
s119            byte   %8.0g       s119       main language spoken at home
s941a           byte   %8.0g       LABJ       seen or heard messages promoting hiv/aids prevention through
s941ba          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bb          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bc          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bd          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941be          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bf          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bg          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bh          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bx          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941bz          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941c           byte   %8.0g       LABJ       seen or heard messages promoting hiv/aids prevention by bein
s941da          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941db          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dc          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dd          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941de          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941df          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dg          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dh          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dx          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941dz          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941e           byte   %8.0g       LABJ       seen or heard messages promoting hiv/aids prevention by usin
s941fa          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fb          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fc          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fd          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fe          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941ff          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fg          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fh          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fx          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s941fz          byte   %8.0g       LABJ       place where seen or heard messages promoting hiv/aids preven
s1019           byte   %8.0g       LABJ       ever drank an alcohol-containing beverage

. lookfor educ

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
v106            byte   %8.0g       v106       highest educational level
v107            byte   %8.0g                  highest year of education
v133            byte   %8.0g       v133       education in single years
v149            byte   %8.0g       v149       educational attainment
awfacte         byte   %8.0g                  all woman factor - educational
v701            byte   %8.0g       v701       partner's education level
v702            byte   %8.0g       LABS       highest year of education
v715            byte   %8.0g       LABQ       husbands education-single yrs
v729            byte   %8.0g       v729       partner's educational attainm.

. lookfor relat

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
v150            byte   %8.0g       v150       relationship to household head
v3a00u          byte   %8.0g       LABAM      source of fp for non-users:  friend, relative
v743d           byte   %8.0g       LABBE      final say on visits to family or relatives
m2h             byte   %8.0g       m2h        na - prenatal: relative
m3h             byte   %8.0g       m3h        assistance: relative, friend

. tab v150

     relationship to |
      household head |      Freq.     Percent        Cum.
---------------------+-----------------------------------
                head |      6,527       33.44       33.44
                wife |      7,185       36.81       70.24
            daughter |      2,535       12.99       83.23
     daughter-in-law |        326        1.67       84.90
          grandchild |        440        2.25       87.15
              parent |         38        0.19       87.35
       parent-in-law |         16        0.08       87.43
              sister |        646        3.31       90.74
      other relative |        662        3.39       94.13
adopted/foster child |        105        0.54       94.67
         not related |        567        2.90       97.57
      niece by blood |        391        2.00       99.57
   niece by marriage |         83        0.43      100.00
---------------------+-----------------------------------
               Total |     19,521      100.00

. use NMPR51DT.dta, clear
file NMPR51DT.dta not found
r(601);

. use NMPR52DT.dta, clear

. tab v150
variable v150 not found
r(111);

. tab hv150
variable hv150 not found
r(111);

. lookfor relationship

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------
hv217           byte   %8.0g       hv217      relationship structure
hv101           byte   %8.0g       hv101      relationship to head

. tab hv101

    relationship to head |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    head |      9,200       21.58       21.58
         wife or husband |      3,708        8.70       30.28
            son/daughter |     12,215       28.65       58.93
     son/daughter-in-law |        399        0.94       59.86
              grandchild |      6,939       16.28       76.14
                  parent |        249        0.58       76.72
           parent-in-law |         67        0.16       76.88
          brother/sister |      1,611        3.78       80.66
          other relative |      3,010        7.06       87.72
    adopted/foster child |        694        1.63       89.35
             not related |      1,768        4.15       93.50
   niece/nephew by blood |      2,440        5.72       99.22
niece/nephew by marriage |        316        0.74       99.96
                      dk |          6        0.01       99.97
                      99 |         11        0.03      100.00
-------------------------+-----------------------------------
                   Total |     42,633      100.00

. use NMIR51DT.dta, clear

. br

. rename v001 hv001

. rename v002 hv002

. rename v003 hv003

. merge m:m hv001 hv001 hv003 using NMPR52DT

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,399
        from master                     1,944  (_merge==1)
        from using                      1,455  (_merge==2)

    matched                            41,245  (_merge==3)
    -----------------------------------------

. br

. order caseid

. sort caseid

