---------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/TwinRegressions2.log
  log type:  text
 opened on:  14 Mar 2013, 08:25:22

. 
. *TWIN PREDICT CONTROLS
. global twinpredict bord agemay m_age_sq educf_* height bmi_* /*wealth*/ poor1 i.child_yob i._cou

. global twinpredict_i agemay m_age_sq educf_* height /*
> */ bmi_vslow bmi_vlow bmi_low bmi_overwt bmi_obese1 bmi_obese2 /*
> */ /*wealth*/ poor1 i.child_yob i._cou

. global twinpredict_ii agemay m_age_sq educf_1_4 educf_5_6 educf_7_10 educf_11plus height /*
> */ bmi /*wealth*/ poor1 i.child_yob i._cou

. 
. global sumstats bord fert agemay educf educ attendance poor1 height bmi /*wealth*/

. 
. *Q-Q CONTROLS
. global basic malec agemay age17-age18 i.child_yob i._cou /*
> */ borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. global socioeconomic educf_* poor1 malec agemay age17-age18 i.child_yob/*
> */ i._cou borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. global allcontrols educf_* poor1 height bmi malec agemay age17-age18 i.child_yob/*
> */ i._cou borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 borddummy7

. 
. *OUTREG Q-Q
. global basic_out fert malec agemay borddummy2 borddummy3 borddummy4 

. global socioeconomic_out fert malec agemay educf_* poor1 borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 bor
> ddummy7 

. global all_out fert malec agemay educf_* bmi poor1 height borddummy2 borddummy3 borddummy4 borddummy5 borddummy6 bo
> rddummy7

. 
. 
. 
. use $Data/DHS_twins, clear

. 
. drop if height<800|height>2200 //THIS IS 1728 OBSERVATIONS
(1483973 observations deleted)

. rename educf_0 educf00

. 
. *NEW CONDITION 24/10/2012: max 18yrs (92.78% of the sample)
. drop if age>18
(154917 observations deleted)

. local agemax 18

. gen poor1=wealth==1

. 
. replace bmi=bmi/100
bmi was int now float
(1964879 real changes made)

. gen bmi_vslow=bmi<15

. gen bmi_vlow=bmi>=15&bmi<16

. gen bmi_low=bmi>=16&bmi<18.5

. gen bmi_norm=bmi>=18.5&bmi<25

. gen bmi_overwt=bmi>=25&bmi<30

. gen bmi_obese1=bmi>=30&bmi<35

. gen bmi_obese2=bmi>=35

. foreach var in bmi_vslow bmi_vlow bmi_low bmi_norm bmi_overwt bmi_obese1 bmi_obese2 {
  2.         replace `var'=. if bmi==.
  3. }
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)
(13659 real changes made, 13659 to missing)

. 
. gen m_age_sq=agemay^2

. 
. *******************************************************************************
. *** (2a) OLS BRISTOL
. *******************************************************************************
. local basecontrols malec age agesq agemay magesq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. gen highschool=educlevel==2|educlevel==3

. 
. 
. reg zscore fert `basecontrols', cluster(_cou) 
variable zscore not found
r(111);

end of do-file

r(111);

. lookfor zscore

              storage  display     value
variable name   type   format      label      variable label
---------------------------------------------------------------------------------------------------------------------
school_zscore   float  %9.0g                  

. do "/tmp/SD09334.000000"

. reg school_zscore fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =   52.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0196
                                                       Root MSE      =  .70154

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0378274   .0052419    -7.22   0.000    -.0483165   -.0273384
       _cons |   .1767458   .0220155     8.03   0.000     .1326929    .2207987
------------------------------------------------------------------------------

. outreg2 fert, using ~/olszscore.tex, tex(pr) append
invalid 'tex' 
r(198);

end of do-file

r(198);

. h outreg2

. do "/tmp/SD09334.000000"

. reg school_zscore fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =   52.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0196
                                                       Root MSE      =  .70154

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0378274   .0052419    -7.22   0.000    -.0483165   -.0273384
       _cons |   .1767458   .0220155     8.03   0.000     .1326929    .2207987
------------------------------------------------------------------------------

. outreg2 fert, using "~/olszscore.tex", tex(pr) append
invalid 'tex' 
r(198);

end of do-file

r(198);

. do "/tmp/SD09334.000000"

. reg school_zscore fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =   52.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0196
                                                       Root MSE      =  .70154

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0378274   .0052419    -7.22   0.000    -.0483165   -.0273384
       _cons |   .1767458   .0220155     8.03   0.000     .1326929    .2207987
------------------------------------------------------------------------------

. outreg2 fert, using "~/olszscore.tex", tex(pr) append
invalid 'tex' 
r(198);

end of do-file

r(198);

. do "/tmp/SD09334.000000"

. reg school_zscore fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =   52.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0196
                                                       Root MSE      =  .70154

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0378274   .0052419    -7.22   0.000    -.0483165   -.0273384
       _cons |   .1767458   .0220155     8.03   0.000     .1326929    .2207987
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. reg school_zscore fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  6,    59) =   40.66
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0525
                                                       Root MSE      =  .68969

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0205692     .00382    -5.38   0.000    -.0282129   -.0129254
   educf_1_4 |   .0875057   .0224446     3.90   0.000      .042594    .1324173
   educf_5_6 |   .2020691   .0192315    10.51   0.000      .163587    .2405513
  educf_7_10 |   .2487556    .025654     9.70   0.000     .1974219    .3000892
educf_11plus |   .3084472   .0287003    10.75   0.000     .2510181    .3658764
       poor1 |  -.1563156   .0179819    -8.69   0.000    -.1922972    -.120334
       _cons |  -.0049107   .0155915    -0.31   0.754    -.0361093    .0262879
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. reg school_zscore fert `basecontrols' `morecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =   52.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0196
                                                       Root MSE      =  .70154

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0378274   .0052419    -7.22   0.000    -.0483165   -.0273384
       _cons |   .1767458   .0220155     8.03   0.000     .1326929    .2207987
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. 
. reg attendance fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1231569
                                                       F(  1,    46) =    9.59
                                                       Prob > F      =  0.0033
                                                       R-squared     =  0.0082
                                                       Root MSE      =  .81161

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0285417   .0092158     3.10   0.003     .0099912    .0470922
       _cons |   .5402191   .0858319     6.29   0.000     .3674484    .7129898
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. reg attendance fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 

Linear regression                                      Number of obs = 1231569
                                                       F(  6,    46) =   29.01
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0521
                                                       Root MSE      =  .79348

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0527806   .0058409     9.04   0.000     .0410234    .0645378
   educf_1_4 |   .2513436   .0680826     3.69   0.001     .1143004    .3883868
   educf_5_6 |   .3246973   .0860634     3.77   0.000     .1514608    .4979339
  educf_7_10 |   .3017807   .0641102     4.71   0.000     .1727335    .4308278
educf_11plus |   .4384032   .0981023     4.47   0.000     .2409335    .6358729
       poor1 |  -.1239903   .0481557    -2.57   0.013    -.2209226   -.0270579
       _cons |   .2575379   .0474902     5.42   0.000      .161945    .3531308
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. reg attendance fert `basecontrols' `morecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1231569
                                                       F(  1,    46) =    9.59
                                                       Prob > F      =  0.0033
                                                       R-squared     =  0.0082
                                                       Root MSE      =  .81161

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0285417   .0092158     3.10   0.003     .0099912    .0470922
       _cons |   .5402191   .0858319     6.29   0.000     .3674484    .7129898
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. 
. reg highschool fert `basecontrols', cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  1,    59) =    0.08
                                                       Prob > F      =  0.7754
                                                       R-squared     =  0.0001
                                                       Root MSE      =  .31256

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  highschool |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0008633    .003012     0.29   0.775    -.0051637    .0068902
       _cons |   .1056649   .0234293     4.51   0.000      .058783    .1525468
------------------------------------------------------------------------------

. outreg2 fert using "~/olsattend.tex", tex(pr) append
~/olsattend.tex
dir : seeout

. reg highschool fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 

Linear regression                                      Number of obs = 1978538
                                                       F(  6,    59) =   46.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0197
                                                       Root MSE      =  .30947

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  highschool |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |   .0071512   .0029834     2.40   0.020     .0011814     .013121
   educf_1_4 |   .0148349   .0135007     1.10   0.276    -.0121799    .0418497
   educf_5_6 |   .0589341   .0168472     3.50   0.001     .0252228    .0926453
  educf_7_10 |   .0815272   .0198705     4.10   0.000     .0417665    .1212879
educf_11plus |   .1250001   .0255187     4.90   0.000     .0739373    .1760629
       poor1 |   -.029858   .0165365    -1.81   0.076    -.0629474    .0032314
       _cons |   .0407671   .0311158     1.31   0.195    -.0214954    .1030296
------------------------------------------------------------------------------

. outreg2 fert using "~/olsattend.tex", tex(pr) append
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "/tmp/SD09334.000000"

. local basecontrols malec age agesq agemay magesq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. gen highschool=educlevel==2|educlevel==3
highschool already defined
r(110);

end of do-file

r(110);

. do "/tmp/SD09334.000000"

. local basecontrols malec age agesq agemay magesq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. *gen highschool=educlevel==2|educlevel==3
. 
. 
. reg school_zscore fert `basecontrols', cluster(_cou) 
variable agesq not found
r(111);

end of do-file

r(111);

. lookfor
nothing to look for
r(198);

. lookfor age

              storage  display     value
variable name   type   format      label      variable label
---------------------------------------------------------------------------------------------------------------------
age             byte   %8.0g       LABF       age of household members
agemay          byte   %8.0g                  current age - respondent
v013            byte   %8.0g       v013       age 5-year groups
v152            byte   %8.0g                  age of household head
agefirstbirth   byte   %8.0g                  age of respondent at 1st birth
b6              int    %8.0g       b6         age at death
b7              int    %8.0g                  age at death (months-imputed)
b13             byte   %8.0g       b13        flag for age at death
v730            byte   %8.0g       v730       husband/partner's age
age1            byte   %8.0g                  age== 0.0000
age2            byte   %8.0g                  age== 1.0000
age3            byte   %8.0g                  age== 2.0000
age4            byte   %8.0g                  age== 3.0000
age5            byte   %8.0g                  age== 4.0000
age6            byte   %8.0g                  age== 5.0000
age7            byte   %8.0g                  age== 6.0000
age8            byte   %8.0g                  age== 7.0000
age9            byte   %8.0g                  age== 8.0000
age10           byte   %8.0g                  age== 9.0000
age11           byte   %8.0g                  age== 10.0000
age12           byte   %8.0g                  age== 11.0000
age13           byte   %8.0g                  age== 12.0000
age14           byte   %8.0g                  age== 13.0000
age15           byte   %8.0g                  age== 14.0000
age16           byte   %8.0g                  age== 15.0000
age17           byte   %8.0g                  age== 16.0000
age18           byte   %8.0g                  age== 17.0000
age19           byte   %8.0g                  age== 18.0000
age20           byte   %8.0g                  age== 19.0000
age21           byte   %8.0g                  age== 20.0000
age22           byte   %8.0g                  age== 21.0000
age23           byte   %8.0g                  age== 22.0000
age24           byte   %8.0g                  age== 23.0000
age25           byte   %8.0g                  age== 24.0000
age26           byte   %8.0g                  age== 25.0000
age27           byte   %8.0g                  age== 26.0000
age28           byte   %8.0g                  age== 27.0000
age29           byte   %8.0g                  age== 28.0000
age30           byte   %8.0g                  age== 29.0000
age31           byte   %8.0g                  age== 30.0000
age32           byte   %8.0g                  age== 31.0000
age33           byte   %8.0g                  age== 32.0000
age34           byte   %8.0g                  age== 33.0000
age35           byte   %8.0g                  age== 34.0000
age36           byte   %8.0g                  age== 35.0000
age37           byte   %8.0g                  age== 36.0000
age38           byte   %8.0g                  age== 37.0000
age39           byte   %8.0g                  age== 38.0000
age40           byte   %8.0g                  age== 39.0000
age41           byte   %8.0g                  age== 40.0000
age42           byte   %8.0g                  age== 41.0000
age43           byte   %8.0g                  age== 42.0000
m_age_sq        float  %9.0g                  

. do "/tmp/SD09334.000000"

. local basecontrols malec age agesq agemay magesq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. *gen highschool=educlevel==2|educlevel==3
. 
. gen agesq=age*age

. 
. reg school_zscore fert `basecontrols', cluster(_cou) 
variable magesq not found
r(111);

end of do-file

r(111);

. do "/tmp/SD09334.000000"

. local basecontrols malec age agesq agemay m_age_sq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. *gen highschool=educlevel==2|educlevel==3
. 
. gen agesq=age*age
agesq already defined
r(110);

end of do-file

r(110);

. do "/tmp/SD09334.000000"

. local basecontrols malec age agesq agemay m_age_sq i._cou i.year_birth 

. local morecontrols height bmi educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1

. 
. *gen highschool=educlevel==2|educlevel==3
. 
. cap gen agesq=age*age

. 
. reg school_zscore fert `basecontrols', cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1978538
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0467
                                                       Root MSE      =  .69182

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0707751   .0072432    -9.77   0.000    -.0852687   -.0562815
       malec |   -.006112   .0129652    -0.47   0.639    -.0320553    .0198314
         age |  -.0008416   .0019365    -0.43   0.665    -.0047165    .0030334
       agesq |  -.0000751   .0000796    -0.94   0.349    -.0002343    .0000841
      agemay |   .0299569   .0064745     4.63   0.000     .0170014    .0429124
    m_age_sq |  -.0000454   .0001068    -0.42   0.673    -.0002592    .0001684
             |
        _cou |
          2  |  -.1095798   .0256738    -4.27   0.000    -.1609529   -.0582068
          3  |   .0449089   .0102093     4.40   0.000     .0244802    .0653377
          4  |   .2540333   .0210941    12.04   0.000      .211824    .2962425
          5  |   .2707348   .0252344    10.73   0.000      .220241    .3212287
          6  |   .2220973    .023042     9.64   0.000     .1759904    .2682042
          7  |   .2434241    .035675     6.82   0.000     .1720385    .3148097
          8  |   .2909524   .0319968     9.09   0.000      .226927    .3549778
          9  |   .1935627   .0206189     9.39   0.000     .1523045     .234821
         10  |    .350634   .0432645     8.10   0.000      .264062    .4372059
         11  |   .1674743    .019165     8.74   0.000     .1291253    .2058234
         12  |   .2788724    .029054     9.60   0.000     .2207354    .3370094
         13  |     .33667   .0341362     9.86   0.000     .2683636    .4049764
         14  |   .1224188   .0111921    10.94   0.000     .1000236    .1448141
         15  |   .3206307     .04228     7.58   0.000     .2360286    .4052329
         16  |   .1924393   .0196841     9.78   0.000     .1530515    .2318271
         17  |   .2492029   .0225461    11.05   0.000     .2040883    .2943174
         18  |   .3305216   .0404915     8.16   0.000     .2494982    .4115449
         19  |    .095708   .0397786     2.41   0.019     .0161113    .1753048
         20  |   .1948041   .0250886     7.76   0.000     .1446019    .2450064
         21  |   .3587074   .0483766     7.41   0.000     .2619061    .4555087
         22  |   .2420414   .0311597     7.77   0.000     .1796911    .3043918
         23  |   .1898185   .0246941     7.69   0.000     .1404057    .2392314
         24  |   .3112907   .0432117     7.20   0.000     .2248242    .3977571
         25  |   .2546843   .0262369     9.71   0.000     .2021844    .3071842
         26  |   .1274438   .0111054    11.48   0.000      .105222    .1496657
         27  |   .2493479   .0331897     7.51   0.000     .1829356    .3157603
         28  |   .2097202    .020165    10.40   0.000     .1693701    .2500704
         29  |   .2115518    .020225    10.46   0.000     .1710817     .252022
         31  |   .3665491   .0270007    13.58   0.000     .3125209    .4205774
         32  |   .1655652   .0317222     5.22   0.000     .1020892    .2290412
         33  |   .2854902   .0302791     9.43   0.000     .2249018    .3460786
         34  |   .1936599   .0320139     6.05   0.000     .1296002    .2577195
         35  |   .1371206   .0125614    10.92   0.000     .1119852     .162256
         36  |   .2159274   .0199299    10.83   0.000     .1760477    .2558071
         37  |    .325264   .0227249    14.31   0.000     .2797916    .3707364
         38  |   .2385488   .0278319     8.57   0.000     .1828574    .2942402
         39  |   .1250323   .0099866    12.52   0.000     .1050491    .1450155
         40  |   .3364462   .0329132    10.22   0.000      .270587    .4023053
         41  |   .0246719   .0153562     1.61   0.113    -.0060559    .0553996
         42  |   .2763908   .0314822     8.78   0.000     .2133951    .3393865
         43  |   .2634096   .0275682     9.55   0.000     .2082457    .3185735
         44  |   .2189213   .0242088     9.04   0.000     .1704795    .2673631
         45  |  -1.150889    .129291    -8.90   0.000      -1.4096   -.8921784
         46  |   .2814517    .029897     9.41   0.000     .2216279    .3412755
         47  |   .3622418   .0393516     9.21   0.000     .2834993    .4409842
         48  |   .2569844   .0225826    11.38   0.000     .2117967    .3021721
         51  |   .2794126     .03523     7.93   0.000     .2089175    .3499077
         53  |   .1846114   .0241436     7.65   0.000     .1363001    .2329227
         54  |   .1746081   .0154103    11.33   0.000     .1437721    .2054441
         55  |   .2878575    .029681     9.70   0.000     .2284659    .3472491
         56  |   .1869253    .015935    11.73   0.000     .1550394    .2188113
         58  |   .1872566   .0175903    10.65   0.000     .1520584    .2224548
         59  |   .3181296   .0286555    11.10   0.000     .2607901    .3754692
         60  |   .2262543   .0351779     6.43   0.000     .1558634    .2966451
         61  |    .257251   .0291731     8.82   0.000     .1988758    .3156262
         62  |   .3428758   .0349603     9.81   0.000     .2729205    .4128312
         64  |   .2140821   .0342393     6.25   0.000     .1455694    .2825948
         67  |   .3269855   .0333713     9.80   0.000     .2602096    .3937613
         68  |   .2008477   .0208154     9.65   0.000     .1591961    .2424992
             |
  year_birth |
          4  |   .1418805   .0140069    10.13   0.000     .1138529    .1699082
          5  |   .6704573   .0366309    18.30   0.000     .5971591    .7437555
          6  |   .4839675   .0211091    22.93   0.000     .4417282    .5262068
          7  |   .5693647   .0266075    21.40   0.000     .5161232    .6226061
          8  |   .8376389   .0291953    28.69   0.000     .7792193    .8960585
          9  |   .6668391   .0390085    17.09   0.000     .5887833     .744895
         10  |    .708757   .0429573    16.50   0.000     .6227996    .7947144
         11  |   .5949594   .0484307    12.28   0.000     .4980499    .6918689
         12  |   .6441478   .0531064    12.13   0.000     .5378822    .7504134
         13  |   .6567354   .0579201    11.34   0.000     .5408376    .7726332
         14  |   .8555867   .0647998    13.20   0.000     .7259226    .9852509
         15  |   .7904095   .0702125    11.26   0.000     .6499146    .9309044
         16  |   .7599741   .0736141    10.32   0.000     .6126727    .9072755
         17  |   .8752328   .0790275    11.08   0.000     .7170992    1.033366
         18  |   .8198922   .0827338     9.91   0.000     .6543422    .9854422
         19  |   .8196549   .0867863     9.44   0.000     .6459958     .993314
         20  |   .7975462   .0913744     8.73   0.000     .6147064    .9803859
         21  |   .8735481   .0947598     9.22   0.000     .6839342    1.063162
         22  |    .902359   .0990174     9.11   0.000     .7042257    1.100492
         23  |   .9950688   .1021093     9.75   0.000     .7907487    1.199389
         24  |   1.028687   .1048778     9.81   0.000     .8188269    1.238547
         25  |   1.026963   .1088664     9.43   0.000     .8091224    1.244805
         26  |   1.065588   .1122739     9.49   0.000     .8409283    1.290247
         27  |    1.06163    .114924     9.24   0.000     .8316682    1.291593
         28  |   1.087918   .1176133     9.25   0.000     .8525739    1.323261
         29  |   1.120053   .1202097     9.32   0.000     .8795138    1.360592
         30  |   1.127282   .1227167     9.19   0.000     .8817263    1.372838
         31  |   1.135171   .1249565     9.08   0.000     .8851336    1.385208
         32  |   1.147647   .1273251     9.01   0.000       .89287    1.402424
         33  |   1.167195   .1292329     9.03   0.000     .9086002    1.425789
         34  |   1.172125   .1311187     8.94   0.000     .9097569    1.434493
         35  |   1.201479   .1324657     9.07   0.000     .9364153    1.466542
         36  |   1.224732   .1336663     9.16   0.000     .9572658    1.492197
         37  |   1.237745   .1353422     9.15   0.000     .9669255    1.508564
         41  |  -1.530032   .2312337    -6.62   0.000     -1.99273   -1.067334
         42  |  -.8243531   .1644074    -5.01   0.000    -1.153332   -.4953746
         43  |  -.7524321    .169654    -4.44   0.000    -1.091909   -.4129552
         44  |  -.6998023   .1766855    -3.96   0.000    -1.053349   -.3462555
         45  |  -.7373574   .1556538    -4.74   0.000     -1.04882    -.425895
         46  |  -.5918319   .1389439    -4.26   0.000    -.8698581   -.3138057
         47  |   -.662818   .1294267    -5.12   0.000    -.9218003   -.4038357
         48  |  -.6131762   .1308122    -4.69   0.000    -.8749308   -.3514216
         49  |   -.598574    .127978    -4.68   0.000    -.8546575   -.3424906
         50  |  -.6256111   .1337397    -4.68   0.000    -.8932237   -.3579985
         51  |  -.5761952      .1235    -4.67   0.000    -.8233182   -.3290723
         52  |  -.5582743   .1204529    -4.63   0.000       -.7993   -.3172487
         53  |  -.5467447   .1174643    -4.65   0.000    -.7817903   -.3116991
         54  |  -.5099245   .1193057    -4.27   0.000    -.7486547   -.2711942
         55  |   -.488229   .1062008    -4.60   0.000    -.7007362   -.2757217
         56  |  -.4802711   .1070792    -4.49   0.000    -.6945361    -.266006
         57  |  -.4705717   .1033555    -4.55   0.000    -.6773856   -.2637578
         58  |  -.4477694   .1015618    -4.41   0.000    -.6509942   -.2445446
         59  |  -.4251052   .0934369    -4.55   0.000     -.612072   -.2381384
         60  |  -.4307122   .0911853    -4.72   0.000    -.6131735   -.2482508
         61  |  -.4221305   .0911675    -4.63   0.000    -.6045563   -.2397047
         62  |    -.41304   .0842556    -4.90   0.000     -.581635    -.244445
         63  |  -.4037997   .0871069    -4.64   0.000    -.5781002   -.2294992
         64  |  -.3873268   .0788377    -4.91   0.000    -.5450807   -.2295729
         65  |  -.3787166   .0758092    -5.00   0.000    -.5304104   -.2270229
         66  |  -.3696227   .0711511    -5.19   0.000    -.5119957   -.2272496
         67  |   -.355264   .0677059    -5.25   0.000    -.4907433   -.2197848
         68  |  -.3535503   .0648715    -5.45   0.000    -.4833578   -.2237428
         69  |  -.3455409   .0605238    -5.71   0.000    -.4666488   -.2244331
         70  |  -.3378656   .0605669    -5.58   0.000    -.4590597   -.2166715
         71  |  -.3209023   .0542594    -5.91   0.000    -.4294751   -.2123294
         72  |   -.308251   .0512012    -6.02   0.000    -.4107044   -.2057975
         73  |  -.3003776   .0468329    -6.41   0.000    -.3940899   -.2066652
         74  |  -.2911938     .04464    -6.52   0.000    -.3805182   -.2018694
         75  |  -.2756097   .0417967    -6.59   0.000    -.3592446   -.1919747
         76  |  -.2638547   .0386276    -6.83   0.000    -.3411485    -.186561
         77  |  -.2617479   .0345971    -7.57   0.000    -.3309765   -.1925193
         78  |  -.2413995   .0310799    -7.77   0.000    -.3035903   -.1792087
         79  |  -.2308544   .0285171    -8.10   0.000    -.2879169   -.1737919
         80  |  -.2193272   .0254478    -8.62   0.000    -.2702482   -.1684062
         81  |  -.2040432   .0228171    -8.94   0.000    -.2497002   -.1583863
         82  |   -.185022   .0203764    -9.08   0.000    -.2257951   -.1442489
         83  |   -.168984   .0189976    -8.90   0.000    -.2069981   -.1309698
         84  |  -.1601735   .0167117    -9.58   0.000    -.1936136   -.1267334
         85  |  -.1413535   .0157011    -9.00   0.000    -.1727714   -.1099356
         86  |   -.061248   .0065954    -9.29   0.000    -.0744454   -.0480507
       1942  |  -.9006584   .1708698    -5.27   0.000    -1.242568   -.5587487
       1943  |  -.8426813   .1680192    -5.02   0.000    -1.178887   -.5064757
       1944  |  -.9040585   .1627976    -5.55   0.000    -1.229816   -.5783013
       1945  |  -.8524283   .1566181    -5.44   0.000    -1.165821   -.5390362
       1946  |  -.7825991   .1508195    -5.19   0.000    -1.084388     -.48081
       1947  |  -.8139198   .1473165    -5.52   0.000    -1.108699   -.5191402
       1948  |  -.7565447    .145394    -5.20   0.000    -1.047477    -.465612
       1949  |  -.6333668    .142076    -4.46   0.000    -.9176603   -.3490733
       1950  |   -.653765   .1617391    -4.04   0.000    -.9774043   -.3301258
       1951  |   -.653319   .1593301    -4.10   0.000    -.9721377   -.3345002
       1952  |  -.6105446   .1511647    -4.04   0.000    -.9130245   -.3080647
       1953  |  -.5920763   .1510941    -3.92   0.000    -.8944149   -.2897377
       1954  |  -.5716862   .1412593    -4.05   0.000    -.8543454    -.289027
       1955  |  -.5342171   .1421357    -3.76   0.000      -.81863   -.2498041
       1956  |  -.5367649    .136553    -3.93   0.000    -.8100069   -.2635229
       1957  |  -.5165696   .1287491    -4.01   0.000    -.7741959   -.2589432
       1958  |  -.5024436   .1272532    -3.95   0.000    -.7570766   -.2478105
       1959  |  -.4924997   .1184157    -4.16   0.000     -.729449   -.2555504
       1960  |  -.4838864   .1166088    -4.15   0.000    -.7172201   -.2505527
       1961  |  -.4458953   .1148089    -3.88   0.000    -.6756275   -.2161632
       1962  |  -.4303609    .104824    -4.11   0.000    -.6401133   -.2206086
       1963  |  -.4149372   .1019044    -4.07   0.000    -.6188475    -.211027
       1964  |  -.4098357   .0926635    -4.42   0.000    -.5952549   -.2244165
       1965  |  -.4031041   .0939216    -4.29   0.000    -.5910408   -.2151674
       1966  |  -.3904069   .0911029    -4.29   0.000    -.5727034   -.2081104
       1967  |  -.3700592   .0816948    -4.53   0.000    -.5335301   -.2065883
       1968  |  -.3648816   .0793457    -4.60   0.000    -.5236519   -.2061113
       1969  |  -.3549848   .0753497    -4.71   0.000    -.5057592   -.2042104
       1970  |  -.3545103    .072116    -4.92   0.000    -.4988141   -.2102065
       1971  |  -.3375154   .0699274    -4.83   0.000    -.4774397   -.1975911
       1972  |  -.3257214   .0667153    -4.88   0.000    -.4592185   -.1922243
       1973  |  -.3339761   .0627339    -5.32   0.000    -.4595064   -.2084459
       1974  |   -.318157    .060549    -5.25   0.000    -.4393152   -.1969988
       1975  |  -.3191818   .0594797    -5.37   0.000    -.4382004   -.2001631
       1976  |   -.317049   .0580318    -5.46   0.000    -.4331704   -.2009275
       1977  |   -.317411   .0556278    -5.71   0.000     -.428722   -.2060999
       1978  |  -.3147938    .053011    -5.94   0.000    -.4208685   -.2087191
       1979  |  -.2963031   .0506673    -5.85   0.000     -.397688   -.1949181
       1980  |  -.3026532   .0488599    -6.19   0.000    -.4004215   -.2048849
       1981  |  -.3016109   .0455893    -6.62   0.000    -.3928349    -.210387
       1982  |  -.2894567   .0422346    -6.85   0.000     -.373968   -.2049454
       1983  |  -.2838175   .0399411    -7.11   0.000    -.3637394   -.2038956
       1984  |  -.2690229   .0390141    -6.90   0.000    -.3470899   -.1909559
       1985  |  -.2551509   .0354805    -7.19   0.000    -.3261472   -.1841547
       1986  |  -.2515632   .0346375    -7.26   0.000    -.3208726   -.1822537
       1987  |  -.2328356   .0330445    -7.05   0.000    -.2989575   -.1667136
       1988  |  -.2277954   .0320997    -7.10   0.000    -.2920268    -.163564
       1989  |  -.2112197   .0325505    -6.49   0.000    -.2763531   -.1460864
       1990  |  -.2021172   .0329401    -6.14   0.000    -.2680301   -.1362043
       1991  |  -.1797616   .0349719    -5.14   0.000    -.2497403    -.109783
       1992  |  -.1652493   .0361112    -4.58   0.000    -.2375076   -.0929911
       1993  |  -.1327991   .0358327    -3.71   0.000    -.2045002    -.061098
       1994  |  -.1121803   .0429925    -2.61   0.011    -.1982081   -.0261525
       1995  |  -.0644267   .0355026    -1.81   0.075    -.1354673    .0066138
       1996  |          0  (omitted)
       2007  |    .518321   .0116887    44.34   0.000     .4949319      .54171
       2008  |   .3712709   .0155651    23.85   0.000     .3401251    .4024166
       2009  |    .469498   .0196634    23.88   0.000     .4301518    .5088443
       2010  |   .3649357   .0263794    13.83   0.000     .3121507    .4177207
       2011  |   .6152898   .0254809    24.15   0.000     .5643026    .6662769
       2012  |   .5489289   .0322132    17.04   0.000     .4844704    .6133875
       2013  |   .5789054   .0336926    17.18   0.000     .5114867    .6463242
       2014  |   .5737779   .0346415    16.56   0.000     .5044604    .6430953
       2015  |   .6660591    .042733    15.59   0.000     .5805506    .7515676
       2016  |   .7329467   .0461151    15.89   0.000     .6406706    .8252229
       2017  |   .6772512   .0488896    13.85   0.000     .5794232    .7750791
       2018  |   .7339987    .054048    13.58   0.000      .625849    .8421485
       2019  |   .7811347   .0585832    13.33   0.000     .6639099    .8983594
       2020  |   .7900339   .0579189    13.64   0.000     .6741385    .9059293
       2021  |   .7872876   .0638645    12.33   0.000     .6594951    .9150801
       2022  |   .8833131   .0693175    12.74   0.000     .7446091    1.022017
       2023  |    .876509   .0734405    11.93   0.000     .7295549    1.023463
       2024  |   .9086768   .0780989    11.63   0.000     .7524013    1.064952
       2025  |   .9502506   .0813379    11.68   0.000     .7874939    1.113007
       2026  |   .9415994   .0839832    11.21   0.000     .7735494     1.10965
       2027  |    1.03873   .0893442    11.63   0.000     .8599528    1.217507
       2028  |   1.018992   .0905232    11.26   0.000     .8378553    1.200128
       2029  |   1.058726   .0958963    11.04   0.000     .8668381    1.250614
       2030  |   1.060609   .0976506    10.86   0.000     .8652103    1.256007
       2031  |   1.048484   .1014076    10.34   0.000     .8455681      1.2514
       2032  |   1.156097   .1036016    11.16   0.000     .9487911    1.363404
       2033  |   1.098042   .1059172    10.37   0.000     .8861023    1.309982
       2034  |   1.129306   .1091826    10.34   0.000     .9108321     1.34778
       2035  |   1.152748   .1108231    10.40   0.000     .9309917    1.374505
       2036  |   1.130273   .1131808     9.99   0.000     .9037982    1.356747
       2037  |   1.130244   .1149428     9.83   0.000     .9002438    1.360244
       2038  |   1.116477   .1161907     9.61   0.000     .8839802    1.348974
       2039  |   1.126728   .1177333     9.57   0.000     .8911443    1.362312
       2040  |    1.11503    .119203     9.35   0.000     .8765056    1.353555
       2041  |   1.135305   .1202206     9.44   0.000     .8947442    1.375866
       2042  |   1.193719   .1221534     9.77   0.000     .9492905    1.438147
       2043  |   1.114223   .1231848     9.05   0.000      .867731    1.360715
       2044  |   1.133206    .124093     9.13   0.000     .8848965    1.381515
       2045  |    1.13538   .1254272     9.05   0.000     .8844012     1.38636
       2046  |    1.13407    .126252     8.98   0.000     .8814401    1.386699
       2047  |   1.141306   .1278422     8.93   0.000     .8854946    1.397118
       2048  |   1.140866   .1295319     8.81   0.000     .8816733    1.400059
       2049  |    1.17177   .1308411     8.96   0.000     .9099572    1.433582
       2050  |   1.185015   .1322639     8.96   0.000      .920356    1.449675
       2051  |   1.208562   .1340213     9.02   0.000     .9403862    1.476738
       2052  |   1.214185   .1348589     9.00   0.000      .944333    1.484037
             |
       _cons |  -.4531916    .075549    -6.00   0.000    -.6043648   -.3020185
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. reg school_zscore fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1978538
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0845
                                                       Root MSE      =  .67797

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0455355   .0054583    -8.34   0.000    -.0564575   -.0346134
       malec |  -.0041434   .0131892    -0.31   0.755    -.0305351    .0222482
         age |   .0017059   .0021375     0.80   0.428    -.0025712     .005983
       agesq |  -.0001864   .0000832    -2.24   0.029    -.0003528   -.0000199
      agemay |   .0152237   .0059033     2.58   0.012     .0034112    .0270362
    m_age_sq |   .0001592    .000104     1.53   0.131    -.0000489    .0003674
             |
        _cou |
          2  |  -.1172391   .0251728    -4.66   0.000    -.1676098   -.0668684
          3  |   .0544627   .0101022     5.39   0.000     .0342482    .0746771
          4  |   .4138489   .0345185    11.99   0.000     .3447775    .4829203
          5  |   .4911805   .0393899    12.47   0.000     .4123615    .5699996
          6  |   .2801913   .0276446    10.14   0.000     .2248746    .3355081
          7  |   .3151335   .0427158     7.38   0.000     .2296595    .4006076
          8  |   .5270299    .047287    11.15   0.000     .4324089     .621651
          9  |   .3474416   .0272859    12.73   0.000     .2928426    .4020406
         10  |   .5117297   .0551072     9.29   0.000     .4014604     .621999
         11  |   .3165212   .0314878    10.05   0.000     .2535142    .3795282
         12  |   .3616716   .0356809    10.14   0.000     .2902743    .4330689
         13  |   .5399326    .047448    11.38   0.000     .4449893    .6348758
         14  |   .1806271   .0153009    11.81   0.000     .1500101     .211244
         15  |   .4904222   .0533203     9.20   0.000     .3837284    .5971159
         16  |   .2257803   .0232231     9.72   0.000      .179311    .2722496
         17  |   .3256459   .0266698    12.21   0.000     .2722797    .3790121
         18  |   .5073525   .0529853     9.58   0.000     .4013291    .6133758
         19  |   .1395909   .0436324     3.20   0.002     .0522827    .2268991
         20  |    .321417   .0319579    10.06   0.000     .2574695    .3853645
         21  |   .5989353   .0600839     9.97   0.000     .4787077    .7191629
         22  |    .232189   .0340948     6.81   0.000     .1639656    .3004125
         23  |   .3291737   .0349455     9.42   0.000     .2592479    .3990996
         24  |   .4619561   .0540635     8.54   0.000     .3537752     .570137
         25  |   .4843715   .0412527    11.74   0.000      .401825     .566918
         26  |   .1594129   .0116349    13.70   0.000     .1361316    .1826942
         27  |   .4116716   .0445955     9.23   0.000     .3224362    .5009071
         28  |    .319016   .0280157    11.39   0.000     .2629567    .3750752
         29  |   .3628094   .0326368    11.12   0.000     .2975033    .4281154
         31  |   .3289028   .0242315    13.57   0.000     .2804158    .3773898
         32  |   .1328578   .0292105     4.55   0.000     .0744077    .1913078
         33  |   .3221036   .0337351     9.55   0.000     .2545998    .3896074
         34  |   .1401976   .0296509     4.73   0.000     .0808664    .1995289
         35  |   .1622145   .0171332     9.47   0.000     .1279311     .196498
         36  |   .3866528   .0303189    12.75   0.000     .3259848    .4473207
         37  |   .4280528   .0310854    13.77   0.000     .3658511    .4902545
         38  |    .337054   .0359407     9.38   0.000     .2651369    .4089711
         39  |   .2400265   .0191516    12.53   0.000     .2017042    .2783488
         40  |   .5441608    .045525    11.95   0.000     .4530655    .6352561
         41  |   .0254756   .0143662     1.77   0.081     -.003271    .0542223
         42  |     .51189   .0460871    11.11   0.000     .4196699    .6041101
         43  |   .4333396   .0401711    10.79   0.000     .3529573    .5137219
         44  |   .2775524   .0295036     9.41   0.000     .2185158     .336589
         45  |  -1.151999   .1205856    -9.55   0.000    -1.393291   -.9107083
         46  |   .3626022   .0378612     9.58   0.000      .286842    .4383623
         47  |   .5688582   .0523438    10.87   0.000     .4641186    .6735978
         48  |   .3820122   .0278433    13.72   0.000     .3262978    .4377265
         51  |   .3185385   .0397853     8.01   0.000     .2389284    .3981486
         53  |   .2955711   .0325459     9.08   0.000     .2304469    .3606954
         54  |   .2715139   .0251792    10.78   0.000     .2211305    .3218973
         55  |   .5018671   .0431618    11.63   0.000     .4155005    .5882337
         56  |    .405686   .0296222    13.70   0.000     .3464121    .4649598
         58  |   .2087883   .0188433    11.08   0.000      .171083    .2464935
         59  |   .3857924   .0346721    11.13   0.000     .3164136    .4551712
         60  |   .4161421   .0490659     8.48   0.000     .3179614    .5143227
         61  |   .3724788   .0386924     9.63   0.000     .2950556    .4499021
         62  |   .4167743    .041432    10.06   0.000      .333869    .4996796
         64  |   .1632437   .0328485     4.97   0.000     .0975139    .2289734
         67  |   .3583014   .0381957     9.38   0.000     .2818721    .4347308
         68  |   .2183447   .0236089     9.25   0.000     .1711035     .265586
             |
  year_birth |
          4  |   .1850179   .0115592    16.01   0.000      .161888    .2081477
          5  |   .7919545   .0298816    26.50   0.000     .7321617    .8517474
          6  |   .5239316   .0202834    25.83   0.000     .4833446    .5645186
          7  |   .6176076   .0255391    24.18   0.000     .5665039    .6687113
          8  |   .8652204   .0291721    29.66   0.000     .8068472    .9235936
          9  |    .734257   .0378259    19.41   0.000     .6585675    .8099464
         10  |   .7645369   .0422668    18.09   0.000     .6799612    .8491127
         11  |   .6691745   .0473895    14.12   0.000     .5743482    .7640007
         12  |   .7139036   .0521316    13.69   0.000     .6095884    .8182188
         13  |   .7262449    .056883    12.77   0.000     .6124224    .8400674
         14  |   .9385793    .062766    14.95   0.000     .8129849    1.064174
         15  |    .908437   .0680759    13.34   0.000     .7722173    1.044657
         16  |   .8675313   .0717896    12.08   0.000     .7238807    1.011182
         17  |   .9887777   .0764259    12.94   0.000     .8358497    1.141706
         18  |   .9310801   .0802089    11.61   0.000     .7705825    1.091578
         19  |    .932061    .084134    11.08   0.000     .7637093    1.100413
         20  |   .9330039   .0884784    10.54   0.000     .7559591    1.110049
         21  |   .9946679   .0913956    10.88   0.000     .8117856     1.17755
         22  |   1.035925   .0954356    10.85   0.000     .8449592    1.226892
         23  |   1.126376   .0985229    11.43   0.000     .9292321     1.32352
         24  |    1.15403   .1010961    11.42   0.000     .9517369    1.356322
         25  |    1.16126    .104646    11.10   0.000      .951864    1.370656
         26  |   1.187503   .1072857    11.07   0.000     .9728251    1.402181
         27  |   1.182982   .1096569    10.79   0.000     .9635586    1.402405
         28  |   1.209725   .1120806    10.79   0.000     .9854519    1.433997
         29  |   1.233072   .1144196    10.78   0.000     1.004119    1.462025
         30  |   1.242854   .1168455    10.64   0.000     1.009047    1.476661
         31  |   1.257165    .119238    10.54   0.000     1.018571     1.49576
         32  |   1.252434   .1209323    10.36   0.000     1.010449    1.494419
         33  |   1.268904   .1228403    10.33   0.000     1.023101    1.514707
         34  |   1.297307    .124992    10.38   0.000     1.047199    1.547416
         35  |   1.330641   .1268146    10.49   0.000     1.076885    1.584396
         36  |   1.316186   .1273475    10.34   0.000     1.061364    1.571008
         37  |   1.359538   .1292358    10.52   0.000     1.100938    1.618138
         41  |   -1.64312   .2717627    -6.05   0.000    -2.186916   -1.099324
         42  |  -1.011969   .1842367    -5.49   0.000    -1.380625   -.6433117
         43  |  -.9324933   .1710888    -5.45   0.000    -1.274841   -.5901454
         44  |  -.8735091   .1757868    -4.97   0.000    -1.225258   -.5217605
         45  |  -.9036083   .1594882    -5.67   0.000    -1.222743   -.5844731
         46  |  -.7669346   .1386186    -5.53   0.000     -1.04431   -.4895595
         47  |  -.8203316   .1309035    -6.27   0.000    -1.082269   -.5583943
         48  |  -.7815753   .1348121    -5.80   0.000    -1.051334   -.5118168
         49  |  -.7570604   .1310023    -5.78   0.000    -1.019195   -.4949255
         50  |  -.7897401    .136038    -5.81   0.000    -1.061951   -.5175288
         51  |  -.7275764   .1241229    -5.86   0.000    -.9759457    -.479207
         52  |  -.7132244   .1227972    -5.81   0.000    -.9589411   -.4675077
         53  |  -.6928891   .1182936    -5.86   0.000     -.929594   -.4561842
         54  |  -.6611822   .1221373    -5.41   0.000    -.9055782   -.4167861
         55  |  -.6299727   .1095429    -5.75   0.000    -.8491675    -.410778
         56  |  -.6229836   .1089359    -5.72   0.000    -.8409637   -.4050034
         57  |  -.6083407   .1077547    -5.65   0.000    -.8239574    -.392724
         58  |  -.5826331   .1028261    -5.67   0.000    -.7883876   -.3768786
         59  |  -.5614536   .0972102    -5.78   0.000    -.7559708   -.3669365
         60  |  -.5557648   .0958259    -5.80   0.000     -.747512   -.3640176
         61  |   -.549759   .0937539    -5.86   0.000    -.7373601    -.362158
         62  |  -.5366859   .0889325    -6.03   0.000    -.7146395   -.3587323
         63  |  -.5216986   .0892102    -5.85   0.000    -.7002079   -.3431893
         64  |  -.5078694    .082945    -6.12   0.000     -.673842   -.3418969
         65  |  -.4960102   .0812876    -6.10   0.000    -.6586662   -.3333542
         66  |  -.4863334   .0748087    -6.50   0.000    -.6360252   -.3366415
         67  |  -.4675808   .0737628    -6.34   0.000    -.6151798   -.3199818
         68  |  -.4655304   .0694346    -6.70   0.000    -.6044687   -.3265921
         69  |  -.4580735   .0658437    -6.96   0.000    -.5898265   -.3263204
         70  |  -.4434806   .0672378    -6.60   0.000     -.578023   -.3089381
         71  |  -.4276538   .0591534    -7.23   0.000    -.5460195   -.3092881
         72  |  -.4160974   .0579118    -7.19   0.000    -.5319787   -.3002161
         73  |  -.4014213   .0521779    -7.69   0.000    -.5058291   -.2970136
         74  |  -.3976125   .0504901    -7.88   0.000     -.498643    -.296582
         75  |  -.3797502   .0488302    -7.78   0.000    -.4774591   -.2820412
         76  |  -.3697968   .0448753    -8.24   0.000     -.459592   -.2800015
         77  |  -.3609056   .0409795    -8.81   0.000    -.4429053   -.2789059
         78  |  -.3319074   .0371008    -8.95   0.000    -.4061459    -.257669
         79  |  -.3237773    .035136    -9.21   0.000    -.3940842   -.2534704
         80  |  -.3076957    .031515    -9.76   0.000    -.3707571   -.2446343
         81  |  -.2923597   .0299439    -9.76   0.000    -.3522774    -.232442
         82  |  -.2698969   .0335874    -8.04   0.000    -.3371051   -.2026887
         83  |  -.2611162    .032535    -8.03   0.000    -.3262186   -.1960139
         84  |  -.2679054   .0367801    -7.28   0.000    -.3415023   -.1943085
         85  |  -.2764922   .0312833    -8.84   0.000      -.33909   -.2138944
         86  |  -.0886203   .0157096    -5.64   0.000    -.1200551   -.0571854
       1942  |  -1.150963   .1715692    -6.71   0.000    -1.494272   -.8076538
       1943  |  -1.082272   .1686622    -6.42   0.000    -1.419764   -.7447799
       1944  |  -1.125504   .1637525    -6.87   0.000    -1.453172   -.7978358
       1945  |   -1.06813   .1576205    -6.78   0.000    -1.383528   -.7527322
       1946  |  -.9809928    .151837    -6.46   0.000    -1.284818   -.6771677
       1947  |  -1.015355   .1485385    -6.84   0.000     -1.31258   -.7181304
       1948  |  -.9495689   .1463293    -6.49   0.000    -1.242373   -.6567646
       1949  |   -.829755   .1436428    -5.78   0.000    -1.117183   -.5423265
       1950  |  -.8371858   .1635649    -5.12   0.000    -1.164478   -.5098932
       1951  |  -.8305196   .1619734    -5.13   0.000    -1.154628   -.5064115
       1952  |  -.7823513   .1528742    -5.12   0.000    -1.088252   -.4764508
       1953  |   -.764926   .1526876    -5.01   0.000    -1.070453   -.4593988
       1954  |  -.7357217   .1440367    -5.11   0.000    -1.023938    -.447505
       1955  |  -.6950089   .1440581    -4.82   0.000    -.9832684   -.4067493
       1956  |   -.694187   .1376525    -5.04   0.000    -.9696289   -.4187451
       1957  |  -.6688725   .1299671    -5.15   0.000     -.928936    -.408809
       1958  |  -.6495895   .1276492    -5.09   0.000     -.905015    -.394164
       1959  |  -.6365609   .1200878    -5.30   0.000     -.876856   -.3962658
       1960  |  -.6209277   .1176478    -5.28   0.000    -.8563405   -.3855149
       1961  |  -.5821364   .1159987    -5.02   0.000    -.8142493   -.3500235
       1962  |   -.565335   .1070527    -5.28   0.000    -.7795469    -.351123
       1963  |  -.5473831   .1038909    -5.27   0.000    -.7552682    -.339498
       1964  |  -.5368532   .0963913    -5.57   0.000    -.7297316   -.3439747
       1965  |  -.5277668   .0956409    -5.52   0.000    -.7191438   -.3363898
       1966  |  -.5143748   .0932424    -5.52   0.000    -.7009524   -.3277973
       1967  |  -.4899177   .0843073    -5.81   0.000    -.6586161   -.3212193
       1968  |  -.4871727   .0828348    -5.88   0.000    -.6529248   -.3214207
       1969  |  -.4730531   .0792404    -5.97   0.000    -.6316128   -.3144935
       1970  |   -.463936   .0755426    -6.14   0.000    -.6150964   -.3127757
       1971  |  -.4474002   .0719013    -6.22   0.000    -.5912743   -.3035262
       1972  |  -.4358222   .0699561    -6.23   0.000    -.5758041   -.2958403
       1973  |  -.4356006   .0659866    -6.60   0.000    -.5676395   -.3035617
       1974  |  -.4202475   .0632862    -6.64   0.000    -.5468828   -.2936122
       1975  |  -.4173365    .061021    -6.84   0.000    -.5394392   -.2952337
       1976  |  -.4165701   .0597548    -6.97   0.000    -.5361391   -.2970011
       1977  |  -.4136317   .0577178    -7.17   0.000    -.5291248   -.2981386
       1978  |  -.4035285   .0554492    -7.28   0.000     -.514482    -.292575
       1979  |  -.3955818   .0529414    -7.47   0.000    -.5015173   -.2896464
       1980  |  -.3893113   .0511813    -7.61   0.000    -.4917248   -.2868977
       1981  |  -.3911359    .048845    -8.01   0.000    -.4888745   -.2933972
       1982  |  -.3803783   .0465715    -8.17   0.000    -.4735676    -.287189
       1983  |  -.3643263   .0438639    -8.31   0.000    -.4520978   -.2765549
       1984  |  -.3590333    .043316    -8.29   0.000    -.4457084   -.2723582
       1985  |  -.3434256   .0401587    -8.55   0.000    -.4237828   -.2630683
       1986  |  -.3307713   .0377668    -8.76   0.000    -.4063425   -.2552002
       1987  |  -.3188734   .0364167    -8.76   0.000     -.391743   -.2460038
       1988  |  -.2953236   .0359108    -8.22   0.000     -.367181   -.2234662
       1989  |  -.2906906   .0332657    -8.74   0.000    -.3572551   -.2241261
       1990  |  -.2667251   .0322832    -8.26   0.000    -.3313236   -.2021266
       1991  |  -.2616206   .0353198    -7.41   0.000    -.3322954   -.1909457
       1992  |  -.2418667   .0369487    -6.55   0.000    -.3158008   -.1679326
       1993  |  -.2124895   .0349472    -6.08   0.000    -.2824187   -.1425602
       1994  |  -.1768035   .0344532    -5.13   0.000    -.2457441   -.1078628
       1995  |  -.1338317   .0443435    -3.02   0.004    -.2225629   -.0451006
       1996  |          0  (omitted)
       2007  |   .4747308   .0089247    53.19   0.000     .4568724    .4925892
       2008  |    .414419   .0130936    31.65   0.000     .3882189    .4406192
       2009  |   .5194656   .0169617    30.63   0.000     .4855254    .5534059
       2010  |   .4286239    .023386    18.33   0.000     .3818285    .4754192
       2011  |    .663894   .0239456    27.73   0.000      .615979     .711809
       2012  |    .610035   .0299388    20.38   0.000     .5501276    .6699424
       2013  |   .6615927   .0309746    21.36   0.000     .5996126    .7235728
       2014  |   .6589297   .0325042    20.27   0.000     .5938889    .7239705
       2015  |   .7624978   .0399433    19.09   0.000     .6825714    .8424242
       2016  |   .8286323   .0435523    19.03   0.000     .7414844    .9157801
       2017  |   .7874469   .0467015    16.86   0.000     .6939973    .8808965
       2018  |   .8587031   .0510839    16.81   0.000     .7564845    .9609217
       2019  |   .9033607   .0555797    16.25   0.000     .7921461    1.014575
       2020  |   .9246894   .0554759    16.67   0.000     .8136823    1.035696
       2021  |   .8984073   .0611661    14.69   0.000     .7760141      1.0208
       2022  |   1.015246   .0659826    15.39   0.000     .8832151    1.147277
       2023  |   1.012516   .0702621    14.41   0.000     .8719224    1.153111
       2024  |   1.043446   .0747377    13.96   0.000     .8938963    1.192996
       2025  |   1.075216   .0777938    13.82   0.000      .919551    1.230881
       2026  |   1.073642   .0803639    13.36   0.000     .9128338     1.23445
       2027  |   1.160513    .085109    13.64   0.000       .99021    1.330815
       2028  |   1.155559   .0863802    13.38   0.000     .9827122    1.328405
       2029  |   1.184425   .0912432    12.98   0.000     1.001847    1.367002
       2030  |    1.18442   .0929452    12.74   0.000     .9984374    1.370403
       2031  |   1.183532   .0967382    12.23   0.000     .9899589    1.377104
       2032  |   1.271636   .0982376    12.94   0.000     1.075063    1.468209
       2033  |   1.235153   .1009413    12.24   0.000      1.03317    1.437136
       2034  |   1.244227   .1034581    12.03   0.000     1.037208    1.451246
       2035  |   1.262592   .1049608    12.03   0.000     1.052566    1.472618
       2036  |    1.22453   .1067818    11.47   0.000      1.01086    1.438199
       2037  |   1.241008   .1086466    11.42   0.000     1.023606    1.458409
       2038  |   1.195685   .1093427    10.94   0.000      .976891    1.414479
       2039  |   1.227434   .1112695    11.03   0.000     1.004784    1.450083
       2040  |   1.213983   .1124741    10.79   0.000     .9889226    1.439043
       2041  |   1.247446   .1138935    10.95   0.000     1.019545    1.475346
       2042  |   1.276192   .1149642    11.10   0.000     1.046149    1.506234
       2043  |   1.205314   .1160474    10.39   0.000     .9731037    1.437524
       2044  |   1.204926    .116747    10.32   0.000     .9713154    1.438536
       2045  |   1.200344   .1179136    10.18   0.000     .9643995    1.436289
       2046  |   1.157556   .1180578     9.80   0.000     .9213229    1.393789
       2047  |   1.206191    .120455    10.01   0.000     .9651615    1.447221
       2048  |   1.177688     .12114     9.72   0.000     .9352872    1.420088
       2049  |   1.208891    .122703     9.85   0.000     .9633626    1.454419
       2050  |   1.133832   .1234306     9.19   0.000     .8868478    1.380816
       2051  |   1.197649   .1255886     9.54   0.000     .9463464    1.448951
       2052  |   1.057767   .1239161     8.54   0.000     .8098111    1.305722
             |
   educf_1_4 |    .148864   .0133404    11.16   0.000     .1221699    .1755581
   educf_5_6 |   .2683755   .0163834    16.38   0.000     .2355925    .3011585
  educf_7_10 |   .3324746   .0232824    14.28   0.000     .2858866    .3790626
educf_11plus |   .3636531   .0441819     8.23   0.000     .2752453    .4520608
       poor1 |  -.1669983   .0096077   -17.38   0.000    -.1862233   -.1477733
       _cons |  -.4744299   .0770255    -6.16   0.000    -.6285577   -.3203022
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. reg school_zscore fert `basecontrols' `morecontrols', cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1964879
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0886
                                                       Root MSE      =  .67613

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
school_zsc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0450059   .0053186    -8.46   0.000    -.0556483   -.0343635
       malec |  -.0034914   .0132353    -0.26   0.793    -.0299751    .0229924
         age |   .0012988   .0021328     0.61   0.545     -.002969    .0055665
       agesq |  -.0001995   .0000824    -2.42   0.019    -.0003644   -.0000346
      agemay |   .0114117   .0057325     1.99   0.051     -.000059    .0228824
    m_age_sq |    .000194   .0001016     1.91   0.061    -9.24e-06    .0003972
             |
        _cou |
          2  |  -.1125107    .025348    -4.44   0.000    -.1632319   -.0617896
          3  |   .0468657   .0096977     4.83   0.000     .0274607    .0662707
          4  |   .4731016   .0393155    12.03   0.000     .3944315    .5517717
          5  |   .5000288   .0402284    12.43   0.000     .4195321    .5805256
          6  |   .2758514   .0282736     9.76   0.000      .219276    .3324268
          7  |   .3156281   .0438973     7.19   0.000     .2277898    .4034664
          8  |   .5428233   .0487459    11.14   0.000     .4452831    .6403636
          9  |   .3816995   .0286871    13.31   0.000     .3242968    .4391022
         10  |   .5271914   .0574963     9.17   0.000     .4121415    .6422412
         11  |   .3648376   .0344834    10.58   0.000     .2958364    .4338387
         12  |   .3604884   .0361161     9.98   0.000     .2882202    .4327565
         13  |    .550678    .048712    11.30   0.000     .4532055    .6481506
         14  |   .1783589   .0155893    11.44   0.000     .1471647     .209553
         15  |   .5031279   .0549666     9.15   0.000       .39314    .6131159
         16  |   .2407219   .0245289     9.81   0.000     .1916396    .2898042
         17  |   .3535225   .0284131    12.44   0.000      .296668    .4103769
         18  |   .5076043   .0538889     9.42   0.000     .3997729    .6154357
         19  |   .1396715   .0448157     3.12   0.003     .0499956    .2293474
         20  |   .2765465   .0293047     9.44   0.000      .217908    .3351851
         21  |   .6338764   .0625258    10.14   0.000     .5087627    .7589902
         22  |   .2366599   .0352592     6.71   0.000     .1661064    .3072135
         23  |   .3410211   .0362696     9.40   0.000     .2684458    .4135964
         24  |   .4748967   .0562897     8.44   0.000     .3622612    .5875323
         25  |   .4964463   .0423891    11.71   0.000      .411626    .5812667
         26  |   .1475017   .0122919    12.00   0.000     .1229057    .1720977
         27  |   .4263927   .0457827     9.31   0.000     .3347818    .5180036
         28  |   .3160863   .0286513    11.03   0.000     .2587552    .3734174
         29  |   .4142016   .0369304    11.22   0.000     .3403041    .4880992
         31  |   .2904331    .022814    12.73   0.000     .2447824    .3360839
         32  |   .1371101   .0303043     4.52   0.000     .0764713    .1977488
         33  |   .3383798   .0356408     9.49   0.000     .2670628    .4096968
         34  |   .1550565   .0318714     4.87   0.000      .091282    .2188311
         35  |   .1539627   .0171246     8.99   0.000     .1196964     .188229
         36  |   .3993472   .0313064    12.76   0.000     .3367032    .4619912
         37  |   .4746202   .0345034    13.76   0.000     .4055791    .5436613
         38  |    .359352   .0377977     9.51   0.000     .2837189     .434985
         39  |   .2522272   .0198553    12.70   0.000     .2124968    .2919575
         40  |   .5485499    .045831    11.97   0.000     .4568422    .6402577
         41  |   .0184218   .0141145     1.31   0.197    -.0098213    .0466649
         42  |   .4940101   .0448324    11.02   0.000     .4043007    .5837195
         43  |   .4512249   .0418965    10.77   0.000     .3673903    .5350596
         44  |   .2841958   .0300508     9.46   0.000     .2240643    .3443273
         45  |  -1.054727   .1168866    -9.02   0.000    -1.288616   -.8208373
         46  |   .3542441   .0378423     9.36   0.000     .2785218    .4299665
         47  |   .5741243   .0532712    10.78   0.000     .4675289    .6807197
         48  |   .3956335   .0287477    13.76   0.000     .3381094    .4531576
         51  |   .3236154   .0407485     7.94   0.000     .2420778     .405153
         53  |   .3181617   .0338707     9.39   0.000     .2503866    .3859368
         54  |   .2691083   .0256695    10.48   0.000     .2177438    .3204728
         55  |   .4981669   .0431336    11.55   0.000     .4118568    .5844769
         56  |   .4112973    .030156    13.64   0.000     .3509553    .4716394
         58  |   .1708424   .0176432     9.68   0.000     .1355383    .2061464
         59  |   .4091992   .0368241    11.11   0.000     .3355143     .482884
         60  |   .4304489   .0509835     8.44   0.000     .3284312    .5324666
         61  |   .3416454   .0371927     9.19   0.000      .267223    .4160679
         62  |   .4351517   .0431864    10.08   0.000     .3487358    .5215675
         64  |   .1757105     .03483     5.04   0.000     .1060159    .2454051
         67  |   .3801501   .0403007     9.43   0.000     .2995085    .4607917
         68  |   .2249875   .0243614     9.24   0.000     .1762405    .2737345
             |
  year_birth |
          4  |   .1735059   .0114767    15.12   0.000      .150541    .1964707
          5  |   .7748085   .0276256    28.05   0.000     .7195298    .8300872
          6  |    .515675   .0196198    26.28   0.000     .4764159    .5549342
          7  |   .5954012   .0243851    24.42   0.000     .5466067    .6441958
          8  |   .8280987   .0275867    30.02   0.000     .7728979    .8832995
          9  |   .7082161   .0359591    19.70   0.000     .6362622      .78017
         10  |   .7353188   .0405375    18.14   0.000     .6542033    .8164342
         11  |   .6467189   .0456061    14.18   0.000     .5554614    .7379764
         12  |   .6869864   .0505687    13.59   0.000     .5857988    .7881741
         13  |   .6937796    .054958    12.62   0.000      .583809    .8037502
         14  |   .9146876   .0608822    15.02   0.000     .7928625    1.036513
         15  |   .8845967   .0661793    13.37   0.000     .7521722    1.017021
         16  |   .8303022   .0695234    11.94   0.000     .6911862    .9694181
         17  |   .9613653    .074414    12.92   0.000     .8124631    1.110267
         18  |   .9006284   .0780208    11.54   0.000     .7445092    1.056748
         19  |    .905021   .0822814    11.00   0.000     .7403762    1.069666
         20  |   .8957391   .0860038    10.42   0.000     .7236458    1.067832
         21  |   .9545189   .0888806    10.74   0.000     .7766692    1.132369
         22  |   .9982224   .0929803    10.74   0.000     .8121693    1.184275
         23  |   1.090407    .096231    11.33   0.000     .8978496    1.282965
         24  |   1.109361   .0984605    11.27   0.000     .9123423     1.30638
         25  |   1.116643   .1020398    10.94   0.000     .9124624    1.320825
         26  |   1.141512   .1046999    10.90   0.000     .9320076    1.351016
         27  |   1.137864   .1072141    10.61   0.000     .9233293    1.352399
         28  |   1.159078   .1094635    10.59   0.000      .940042    1.378114
         29  |   1.177384   .1116039    10.55   0.000     .9540647    1.400703
         30  |   1.190947   .1143009    10.42   0.000     .9622312    1.419662
         31  |    1.20593   .1169072    10.32   0.000     .9719993    1.439861
         32  |   1.198307   .1186287    10.10   0.000     .9609313    1.435682
         33  |   1.216268   .1207098    10.08   0.000     .9747281    1.457807
         34  |   1.240626   .1227266    10.11   0.000      .995051    1.486202
         35  |   1.266444   .1242168    10.20   0.000     1.017887    1.515001
         36  |   1.260619    .125209    10.07   0.000     1.010076    1.511162
         37  |   1.295976   .1269885    10.21   0.000     1.041873    1.550079
         41  |  -1.542085    .242253    -6.37   0.000    -2.026832   -1.057338
         42  |  -.9633229    .190998    -5.04   0.000    -1.345509   -.5811367
         43  |  -.9074969   .1730969    -5.24   0.000    -1.253863   -.5611309
         44  |  -.8493909    .174351    -4.87   0.000    -1.198266   -.5005154
         45  |   -.874917   .1607467    -5.44   0.000     -1.19657   -.5532637
         46  |  -.7478159   .1399872    -5.34   0.000     -1.02793   -.4677021
         47  |  -.8011136     .13236    -6.05   0.000    -1.065965   -.5362619
         48  |   -.760037   .1349088    -5.63   0.000    -1.029989   -.4900851
         49  |  -.7361571   .1319872    -5.58   0.000    -1.000263   -.4720514
         50  |  -.7681498   .1373544    -5.59   0.000    -1.042995   -.4933042
         51  |  -.7068433   .1258793    -5.62   0.000    -.9587272   -.4549595
         52  |   -.695101   .1237409    -5.62   0.000    -.9427059   -.4474961
         53  |  -.6768415   .1192405    -5.68   0.000    -.9154412   -.4382417
         54  |  -.6460601   .1234986    -5.23   0.000    -.8931803     -.39894
         55  |  -.6123759   .1131643    -5.41   0.000    -.8388172   -.3859347
         56  |  -.6069313   .1105204    -5.49   0.000    -.8280821   -.3857805
         57  |  -.5905875   .1096955    -5.38   0.000    -.8100877   -.3710874
         58  |  -.5672967   .1053721    -5.38   0.000    -.7781459   -.3564476
         59  |  -.5460019   .0995565    -5.48   0.000    -.7452141   -.3467898
         60  |  -.5392702   .0985305    -5.47   0.000    -.7364293   -.3421111
         61  |  -.5356413   .0961708    -5.57   0.000    -.7280786   -.3432041
         62  |  -.5233135   .0917127    -5.71   0.000    -.7068303   -.3397967
         63  |  -.5075857    .091728    -5.53   0.000     -.691133   -.3240384
         64  |  -.4938293   .0856141    -5.77   0.000    -.6651428   -.3225158
         65  |  -.4826478   .0845459    -5.71   0.000    -.6518237   -.3134719
         66  |  -.4741875   .0773257    -6.13   0.000    -.6289158   -.3194592
         67  |  -.4558849   .0765869    -5.95   0.000     -.609135   -.3026348
         68  |  -.4535742   .0720274    -6.30   0.000    -.5977007   -.3094476
         69  |  -.4468593   .0680945    -6.56   0.000     -.583116   -.3106026
         70  |    -.43283   .0696851    -6.21   0.000    -.5722696   -.2933903
         71  |  -.4185987   .0611647    -6.84   0.000    -.5409891   -.2962084
         72  |  -.4074945   .0601742    -6.77   0.000    -.5279029   -.2870862
         73  |  -.3935934   .0544848    -7.22   0.000    -.5026173   -.2845696
         74  |  -.3912599   .0523121    -7.48   0.000    -.4959362   -.2865837
         75  |  -.3738778   .0507398    -7.37   0.000    -.4754079   -.2723476
         76  |  -.3642932   .0463154    -7.87   0.000    -.4569701   -.2716163
         77  |  -.3563751   .0423766    -8.41   0.000    -.4411705   -.2715798
         78  |  -.3298413   .0386676    -8.53   0.000     -.407215   -.2524675
         79  |  -.3236795   .0366123    -8.84   0.000    -.3969404   -.2504185
         80  |  -.3072101   .0328098    -9.36   0.000    -.3728623   -.2415579
         81  |  -.2926548   .0311302    -9.40   0.000    -.3549463   -.2303634
         82  |  -.2720254   .0344684    -7.89   0.000    -.3409965   -.2030544
         83  |  -.2653488    .032992    -8.04   0.000    -.3313656    -.199332
         84  |   -.271703   .0375924    -7.23   0.000    -.3469252   -.1964809
         85  |  -.2764313   .0339726    -8.14   0.000    -.3444103   -.2084523
         86  |  -.0795032   .0161905    -4.91   0.000    -.1119004    -.047106
       1942  |  -1.096053    .170355    -6.43   0.000    -1.436932   -.7551734
       1943  |  -1.047103   .1688826    -6.20   0.000    -1.385036   -.7091698
       1944  |  -1.085278    .163689    -6.63   0.000    -1.412819   -.7577375
       1945  |  -1.028327     .15762    -6.52   0.000    -1.343723   -.7129298
       1946  |  -.9481944    .152422    -6.22   0.000     -1.25319   -.6431987
       1947  |  -.9833539   .1491467    -6.59   0.000    -1.281796    -.684912
       1948  |  -.9208238   .1471875    -6.26   0.000    -1.215345   -.6263023
       1949  |  -.8050094   .1448168    -5.56   0.000    -1.094787   -.5152318
       1950  |  -.8269138   .1606428    -5.15   0.000    -1.148359   -.5054682
       1951  |  -.8110307    .160493    -5.05   0.000    -1.132176    -.489885
       1952  |  -.7624801   .1542402    -4.94   0.000    -1.071114   -.4538462
       1953  |  -.7518111   .1532592    -4.91   0.000    -1.058482   -.4451401
       1954  |  -.7204302   .1442542    -4.99   0.000    -1.009082   -.4317782
       1955  |  -.6816888   .1450508    -4.70   0.000    -.9719348   -.3914428
       1956  |  -.6805087   .1392418    -4.89   0.000     -.959131   -.4018864
       1957  |  -.6581636   .1311062    -5.02   0.000    -.9205066   -.3958206
       1958  |   -.637921   .1294068    -4.93   0.000    -.8968633   -.3789786
       1959  |  -.6264299   .1210607    -5.17   0.000    -.8686718   -.3841881
       1960  |  -.6112918   .1192217    -5.13   0.000    -.8498539   -.3727298
       1961  |  -.5729991   .1177118    -4.87   0.000    -.8085399   -.3374584
       1962  |  -.5562682   .1095184    -5.08   0.000    -.7754141   -.3371224
       1963  |  -.5392673   .1060391    -5.09   0.000     -.751451   -.3270837
       1964  |  -.5289367    .098936    -5.35   0.000    -.7269072   -.3309662
       1965  |  -.5191502   .0981683    -5.29   0.000    -.7155845   -.3227159
       1966  |  -.5074207   .0957771    -5.30   0.000    -.6990702   -.3157712
       1967  |  -.4836773   .0866599    -5.58   0.000    -.6570833   -.3102713
       1968  |  -.4809924   .0852831    -5.64   0.000    -.6516436   -.3103413
       1969  |  -.4675446   .0817187    -5.72   0.000    -.6310633   -.3040258
       1970  |  -.4589119   .0781287    -5.87   0.000    -.6152471   -.3025767
       1971  |  -.4429822   .0744107    -5.95   0.000    -.5918777   -.2940867
       1972  |  -.4309834   .0726459    -5.93   0.000    -.5763474   -.2856194
       1973  |  -.4312538    .068486    -6.30   0.000     -.568294   -.2942137
       1974  |  -.4165324   .0659304    -6.32   0.000    -.5484588   -.2846059
       1975  |  -.4135295    .063624    -6.50   0.000    -.5408408   -.2862182
       1976  |  -.4138473    .061988    -6.68   0.000     -.537885   -.2898096
       1977  |  -.4116551   .0600123    -6.86   0.000    -.5317395   -.2915707
       1978  |  -.4009359    .057676    -6.95   0.000    -.5163453   -.2855266
       1979  |   -.393657   .0553906    -7.11   0.000    -.5044933   -.2828206
       1980  |  -.3884624   .0532129    -7.30   0.000    -.4949411   -.2819837
       1981  |  -.3907145   .0508557    -7.68   0.000    -.4924765   -.2889524
       1982  |  -.3792331    .048479    -7.82   0.000    -.4762394   -.2822269
       1983  |  -.3625442   .0457868    -7.92   0.000    -.4541633    -.270925
       1984  |  -.3581888   .0453502    -7.90   0.000    -.4489342   -.2674433
       1985  |  -.3436177   .0422062    -8.14   0.000    -.4280721   -.2591633
       1986  |  -.3312181   .0396599    -8.35   0.000    -.4105774   -.2518587
       1987  |  -.3192335   .0382497    -8.35   0.000    -.3957711    -.242696
       1988  |  -.2967192   .0377001    -7.87   0.000    -.3721569   -.2212816
       1989  |  -.2916639   .0350071    -8.33   0.000    -.3617129   -.2216149
       1990  |  -.2686373   .0339128    -7.92   0.000    -.3364967    -.200778
       1991  |  -.2648247   .0365496    -7.25   0.000    -.3379603   -.1916891
       1992  |  -.2452485   .0379312    -6.47   0.000    -.3211487   -.1693483
       1993  |  -.2108001   .0363742    -5.80   0.000    -.2835847   -.1380156
       1994  |  -.1819809   .0357891    -5.08   0.000    -.2535947   -.1103672
       1995  |  -.1364608   .0448004    -3.05   0.003    -.2261062   -.0468154
       1996  |          0  (omitted)
       2007  |    .463265     .00945    49.02   0.000     .4443555    .4821744
       2008  |   .3979392   .0130462    30.50   0.000     .3718337    .4240446
       2009  |   .4997334   .0163311    30.60   0.000     .4670549    .5324118
       2010  |   .4143443   .0221612    18.70   0.000     .3699998    .4586887
       2011  |   .6499406   .0229034    28.38   0.000     .6041111    .6957701
       2012  |   .5932857   .0285464    20.78   0.000     .5361645    .6504069
       2013  |   .6421983    .029614    21.69   0.000     .5829408    .7014557
       2014  |    .636698    .031141    20.45   0.000      .574385    .6990111
       2015  |   .7383729    .038252    19.30   0.000     .6618308     .814915
       2016  |   .8027407   .0417415    19.23   0.000     .7192162    .8862652
       2017  |   .7616641   .0448098    17.00   0.000     .6719998    .8513284
       2018  |   .8283078   .0490428    16.89   0.000     .7301735    .9264421
       2019  |   .8770178   .0536326    16.35   0.000     .7696993    .9843363
       2020  |   .8944449   .0533923    16.75   0.000     .7876071    1.001283
       2021  |   .8695072   .0590992    14.71   0.000       .75125    .9877643
       2022  |   .9818314   .0636534    15.42   0.000     .8544612    1.109202
       2023  |   .9801765   .0679947    14.42   0.000     .8441194    1.116234
       2024  |   1.006753   .0721779    13.95   0.000     .8623253     1.15118
       2025  |   1.037008   .0752841    13.77   0.000     .8863653    1.187651
       2026  |   1.034433   .0778288    13.29   0.000     .8786976    1.190168
       2027  |   1.119498   .0824525    13.58   0.000     .9545113    1.284485
       2028  |   1.114181   .0836869    13.31   0.000     .9467237    1.281638
       2029  |   1.142278   .0885607    12.90   0.000     .9650684    1.319487
       2030  |   1.139726     .09017    12.64   0.000     .9592963    1.320156
       2031  |    1.14148   .0941066    12.13   0.000      .953173    1.329787
       2032  |   1.223022   .0953463    12.83   0.000     1.032234    1.413809
       2033  |   1.186639   .0981014    12.10   0.000     .9903385     1.38294
       2034  |   1.194495   .1006012    11.87   0.000     .9931926    1.395798
       2035  |   1.211971   .1021504    11.86   0.000     1.007569    1.416374
       2036  |   1.175249   .1040079    11.30   0.000     .9671298    1.383369
       2037  |   1.188483   .1057625    11.24   0.000     .9768525    1.400113
       2038  |    1.14256   .1065062    10.73   0.000      .929442    1.355679
       2039  |   1.174082   .1085323    10.82   0.000     .9569097    1.391255
       2040  |   1.157928   .1095988    10.57   0.000     .9386215    1.377235
       2041  |    1.19033   .1109957    10.72   0.000     .9682282    1.412432
       2042  |   1.218165   .1121049    10.87   0.000     .9938439    1.442487
       2043  |    1.14703   .1132233    10.13   0.000     .9204708    1.373589
       2044  |   1.147467   .1140493    10.06   0.000     .9192545    1.375679
       2045  |   1.141058   .1150873     9.91   0.000     .9107684    1.371347
       2046  |   1.096926   .1153384     9.51   0.000     .8661341    1.327717
       2047  |   1.140691   .1175097     9.71   0.000     .9055543    1.375827
       2048  |   1.118451   .1186958     9.42   0.000     .8809411    1.355961
       2049  |    1.14962   .1203641     9.55   0.000     .9087719    1.390468
       2050  |   1.081151   .1214033     8.91   0.000     .8382239    1.324079
       2051  |   1.128882   .1230986     9.17   0.000     .8825625    1.375202
       2052  |   1.021271   .1243182     8.21   0.000     .7725109    1.270031
             |
      height |   .0002214   .0000361     6.13   0.000     .0001492    .0002936
         bmi |   .0115076   .0014706     7.82   0.000     .0085649    .0144503
   educf_1_4 |   .1398234   .0126555    11.05   0.000     .1144999    .1651469
   educf_5_6 |   .2523296   .0151331    16.67   0.000     .2220482    .2826109
  educf_7_10 |   .3102437   .0217588    14.26   0.000     .2667045    .3537829
educf_11plus |   .3367732   .0429628     7.84   0.000     .2508049    .4227415
       poor1 |  -.1532244   .0096869   -15.82   0.000    -.1726079   -.1338409
       _cons |  -1.012948   .1380898    -7.34   0.000    -1.289265   -.7366307
------------------------------------------------------------------------------

. outreg2 fert using "~/olszscore.tex", tex(pr) append
~/olszscore.tex
dir : seeout

. 
. reg attendance fert `basecontrols', cluster(_cou) 
note: 2052.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1231569
                                                       F( 46,    46) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4628
                                                       Root MSE      =  .59738

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0340753   .0031118   -10.95   0.000    -.0403391   -.0278115
       malec |   .0146595   .0070931     2.07   0.044     .0003819    .0289372
         age |   .2420117   .0202671    11.94   0.000      .201216    .2828073
       agesq |  -.0097354    .000942   -10.33   0.000    -.0116315   -.0078392
      agemay |   .0298071   .0135306     2.20   0.033     .0025713    .0570428
    m_age_sq |  -.0005955   .0002845    -2.09   0.042    -.0011683   -.0000228
             |
        _cou |
          2  |   .5174399   .0651903     7.94   0.000     .3862187    .6486611
          3  |  -.0277608   .0268572    -1.03   0.307    -.0818216    .0262999
          5  |   .2063968   .0518827     3.98   0.000     .1019624    .3108313
          6  |   .4880008   .0424821    11.49   0.000     .4024888    .5735129
          8  |   -.137667   .0657945    -2.09   0.042    -.2701044   -.0052296
          9  |   .0656895   .0236193     2.78   0.008     .0181463    .1132327
         11  |   .0508976   .0461658     1.10   0.276    -.0420294    .1438246
         12  |   .5490629   .0608755     9.02   0.000     .4265267     .671599
         13  |   .0648034   .0579702     1.12   0.269    -.0518846    .1814914
         14  |   .6430825   .0276622    23.25   0.000     .5874014    .6987635
         16  |   .0475066   .0503303     0.94   0.350     -.053803    .1488163
         17  |   .0147443   .0363066     0.41   0.687    -.0583372    .0878257
         20  |   .1379782   .0526756     2.62   0.012     .0319476    .2440087
         21  |  -.2236944   .1270928    -1.76   0.085    -.4795189    .0321302
         23  |   .2107277   .0451257     4.67   0.000     .1198944     .301561
         25  |   .1461995   .0468578     3.12   0.003     .0518796    .2405195
         26  |   .1286307   .0165443     7.77   0.000     .0953287    .1619327
         27  |    .125887   .0840404     1.50   0.141    -.0432775    .2950515
         29  |  -.0365635   .0370847    -0.99   0.329    -.1112111    .0380842
         31  |   .1047258   .0238281     4.40   0.000     .0567623    .1526894
         33  |    .186388   .0249812     7.46   0.000     .1361035    .2366725
         35  |   .2780541   .0322923     8.61   0.000      .213053    .3430552
         36  |  -.0917071   .0397573    -2.31   0.026    -.1717345   -.0116798
         37  |   .2423678   .0389755     6.22   0.000     .1639143    .3208214
         38  |   .3745119   .0608404     6.16   0.000     .2520464    .4969773
         39  |   .1643188   .0152498    10.78   0.000     .1336225     .195015
         40  |  -.0256915   .0680235    -0.38   0.707    -.1626157    .1112326
         41  |   .0664291    .038012     1.75   0.087     -.010085    .1429432
         42  |   .3880706    .061147     6.35   0.000      .264988    .5111532
         43  |   .3075106     .06403     4.80   0.000     .1786249    .4363964
         44  |    .072163   .0364665     1.98   0.054    -.0012402    .1455662
         45  |  -.9487502   .3004298    -3.16   0.003    -1.553484   -.3440163
         46  |   .3302587   .0815813     4.05   0.000      .166044    .4944733
         47  |  -.1259295   .0419709    -3.00   0.004    -.2104126   -.0414464
         48  |     .10676   .0345712     3.09   0.003     .0371717    .1763483
         51  |   .5031326   .0955557     5.27   0.000      .310789    .6954761
         53  |   .1373511   .0568365     2.42   0.020     .0229451    .2517571
         54  |   .0951796   .0248621     3.83   0.000     .0451348    .1452244
         55  |   .0765813   .0300408     2.55   0.014     .0161123    .1370502
         56  |   .0676269   .0289163     2.34   0.024     .0094214    .1258323
         58  |   .0613807   .0374774     1.64   0.108    -.0140575    .1368189
         59  |   .4253986   .0353695    12.03   0.000     .3542034    .4965938
         61  |   .2997173   .0644083     4.65   0.000     .1700701    .4293645
         62  |   .3932457   .0792747     4.96   0.000      .233674    .5528174
         67  |   .1475726   .0592557     2.49   0.016      .028297    .2668482
         68  |    .192154   .0494417     3.89   0.000      .092633     .291675
             |
  year_birth |
         58  |   .1818154   .0637587     2.85   0.006     .0534759     .310155
         60  |  -.2253702   .0859797    -2.62   0.012    -.3984383    -.052302
         63  |  -2.227087    .119933   -18.57   0.000    -2.468499   -1.985674
         66  |   .1790742    .162069     1.10   0.275    -.1471537    .5053022
         68  |  -.3366536   .1662098    -2.03   0.049    -.6712165   -.0020907
         69  |  -1.989496   .1737455   -11.45   0.000    -2.339228   -1.639765
         70  |   -.378824   .1793764    -2.11   0.040      -.73989   -.0177579
         71  |   -.210397   .1849391    -1.14   0.261    -.5826601    .1618661
         72  |  -.8446459   .2034498    -4.15   0.000    -1.254169   -.4351226
         73  |  -.8839433   .2121678    -4.17   0.000    -1.311015   -.4568717
         75  |  -1.472278   .2275437    -6.47   0.000    -1.930299   -1.014256
       1942  |  -.6949272   .1839727    -3.78   0.000    -1.065245   -.3246094
       1943  |  -.5326235   .1769957    -3.01   0.004    -.8888973   -.1763497
       1944  |   -.685885   .1624279    -4.22   0.000    -1.012835   -.3589346
       1945  |  -.6369698    .144268    -4.42   0.000    -.9273662   -.3465733
       1946  |   -.615785   .1276315    -4.82   0.000    -.8726939   -.3588761
       1947  |  -.6669495   .1175658    -5.67   0.000    -.9035972   -.4303018
       1948  |  -.7370907   .1119809    -6.58   0.000    -.9624965   -.5116849
       1949  |  -.6602754   .1055826    -6.25   0.000    -.8728021   -.4477488
       1950  |  -.5809242   .2005079    -2.90   0.006    -.9845258   -.1773227
       1951  |  -.6228165   .1711655    -3.64   0.001    -.9673548   -.2782781
       1952  |  -.6432353    .159023    -4.04   0.000     -.963332   -.3231386
       1953  |  -.6698223   .1300686    -5.15   0.000    -.9316368   -.4080078
       1954  |  -.6823943   .1216911    -5.61   0.000    -.9273459   -.4374428
       1955  |  -.7174093   .1054309    -6.80   0.000    -.9296307   -.5051879
       1956  |  -.7636039   .0871851    -8.76   0.000    -.9390985   -.5881093
       1957  |  -.7781768   .0776818   -10.02   0.000    -.9345421   -.6218116
       1958  |   -.801429   .0636987   -12.58   0.000    -.9296478   -.6732103
       1959  |  -.8298102   .0495257   -16.76   0.000    -.9295002   -.7301202
       1960  |  -.8680453   .0473271   -18.34   0.000    -.9633098   -.7727807
       1961  |  -.8846968    .036793   -24.05   0.000    -.9587573   -.8106363
       1962  |  -.8950204   .0352428   -25.40   0.000    -.9659605   -.8240804
       1963  |  -.9321843   .0407627   -22.87   0.000    -1.014235   -.8501334
       1964  |  -.9486999   .0462562   -20.51   0.000    -1.041809   -.8555909
       1965  |  -.9906738   .0597258   -16.59   0.000    -1.110895   -.8704521
       1966  |   -.996548   .0651271   -15.30   0.000    -1.127642    -.865454
       1967  |  -1.018699   .0775619   -13.13   0.000    -1.174823   -.8625746
       1968  |  -1.044459   .0878361   -11.89   0.000    -1.221264   -.8676542
       1969  |  -1.057976   .0987591   -10.71   0.000    -1.256767   -.8591839
       1970  |  -1.094274   .1091744   -10.02   0.000     -1.31403   -.8745172
       1971  |  -1.099446   .1191113    -9.23   0.000    -1.339205   -.8596875
       1972  |  -1.114606   .1300149    -8.57   0.000    -1.376313   -.8528996
       1973  |  -1.149979   .1384449    -8.31   0.000    -1.428654   -.8713038
       1974  |  -1.162702   .1459331    -7.97   0.000     -1.45645    -.868954
       1975  |  -1.181397   .1540703    -7.67   0.000    -1.491524   -.8712693
       1976  |  -1.199095   .1614942    -7.42   0.000    -1.524166   -.8740237
       1977  |  -1.215895   .1715825    -7.09   0.000    -1.561272    -.870517
       1978  |  -1.236607   .1762369    -7.02   0.000    -1.591353   -.8818604
       1979  |  -1.236707    .182896    -6.76   0.000    -1.604858   -.8685569
       1980  |  -1.250697   .1870513    -6.69   0.000    -1.627212   -.8741828
       1981  |   -1.25492   .1917166    -6.55   0.000    -1.640826   -.8690147
       1982  |  -1.253175   .1966952    -6.37   0.000    -1.649102   -.8572479
       1983  |   -1.25032   .2024401    -6.18   0.000     -1.65781   -.8428288
       1984  |  -1.237711   .2033791    -6.09   0.000    -1.647092   -.8283304
       1985  |  -1.222249   .2021533    -6.05   0.000    -1.629163   -.8153358
       1986  |  -1.225094   .2039304    -6.01   0.000    -1.635584   -.8146031
       1987  |  -1.220312   .1981036    -6.16   0.000    -1.619074   -.8215501
       1988  |  -1.234485   .1993514    -6.19   0.000    -1.635759   -.8332118
       1989  |  -1.261178   .1856662    -6.79   0.000    -1.634905   -.8874517
       1990  |  -1.247033   .1916311    -6.51   0.000    -1.632767   -.8612999
       1991  |  -1.252735   .1882151    -6.66   0.000    -1.631592   -.8738774
       1992  |  -1.244828   .1936808    -6.43   0.000    -1.634687   -.8549689
       1993  |   -1.24242   .2015813    -6.16   0.000    -1.648182   -.8366573
       1994  |  -1.256583   .2089228    -6.01   0.000    -1.677123   -.8360435
       1995  |  -1.237111   .2102031    -5.89   0.000    -1.660228   -.8139938
       1996  |  -1.376883    .288294    -4.78   0.000    -1.957189   -.7965775
       2007  |   .6114999   .3386982     1.81   0.078    -.0702643    1.293264
       2008  |   .6934759   .3428356     2.02   0.049     .0033838    1.383568
       2009  |   .6470697   .3295763     1.96   0.056    -.0163329    1.310472
       2010  |   .6032809   .3146843     1.92   0.061    -.0301457    1.236708
       2011  |   .6018567   .2991786     2.01   0.050    -.0003586    1.204072
       2012  |   .5015905   .2863246     1.75   0.086    -.0747511    1.077932
       2013  |   .3567271   .2907846     1.23   0.226    -.2285919    .9420461
       2014  |   .3014678   .2846566     1.06   0.295    -.2715163    .8744518
       2015  |   .3701345   .2677854     1.38   0.174    -.1688897    .9091586
       2016  |   .3380814   .2578753     1.31   0.196    -.1809946    .8571574
       2017  |   .2083741   .2481693     0.84   0.405    -.2911649     .707913
       2018  |   .2532967   .2431448     1.04   0.303    -.2361285    .7427218
       2019  |   .2061404     .23296     0.88   0.381    -.2627838    .6750647
       2020  |   .1677407   .2305104     0.73   0.470    -.2962526    .6317339
       2021  |   .1100955   .2153937     0.51   0.612    -.3234696    .5436606
       2022  |   .1808799   .2091327     0.86   0.392    -.2400823    .6018421
       2023  |   .1290986   .1969392     0.66   0.515    -.2673195    .5255167
       2024  |   .1432301   .1881023     0.76   0.450    -.2354002    .5218604
       2025  |   .1413666   .1774635     0.80   0.430    -.2158488    .4985821
       2026  |    .074313    .173972     0.43   0.671    -.2758744    .4245004
       2027  |   .1155599   .1645271     0.70   0.486     -.215616    .4467357
       2028  |   .0464565   .1605993     0.29   0.774    -.2768131     .369726
       2029  |   .0623617   .1474908     0.42   0.674     -.234522    .3592454
       2030  |   .0288454   .1427558     0.20   0.841    -.2585072     .316198
       2031  |   .0095256   .1297059     0.07   0.942    -.2515588      .27061
       2032  |   .0060939    .126972     0.05   0.962    -.2494875    .2616753
       2033  |  -.0659437   .1186723    -0.56   0.581    -.3048187    .1729314
       2034  |  -.0412653   .1106248    -0.37   0.711    -.2639414    .1814109
       2035  |   -.044357   .1034087    -0.43   0.670    -.2525078    .1637939
       2036  |  -.0634318   .0964609    -0.66   0.514    -.2575975    .1307338
       2037  |  -.0251249   .0889065    -0.28   0.779    -.2040845    .1538347
       2038  |  -.0295835    .086142    -0.34   0.733    -.2029785    .1438114
       2039  |  -.0244275   .0775296    -0.32   0.754    -.1804865    .1316315
       2040  |  -.0143583   .0744782    -0.19   0.848    -.1642751    .1355585
       2041  |  -.0243009   .0682806    -0.36   0.724    -.1617425    .1131407
       2042  |  -.0067572   .0618848    -0.11   0.914    -.1313249    .1178105
       2043  |   .0109287   .0539412     0.20   0.840    -.0976493    .1195068
       2044  |     .03502   .0496925     0.70   0.485    -.0650058    .1350459
       2045  |    .039214   .0429312     0.91   0.366     -.047202      .12563
       2046  |   .0245109   .0416812     0.59   0.559     -.059389    .1084108
       2047  |  -.0080578   .0328084    -0.25   0.807    -.0740978    .0579821
       2048  |  -.0060959   .0234522    -0.26   0.796    -.0533028     .041111
       2049  |   .1084361   .0123504     8.78   0.000     .0835759    .1332962
       2050  |   .1146592   .0078608    14.59   0.000     .0988361    .1304822
       2051  |   .1975487   .0125476    15.74   0.000     .1722917    .2228057
       2052  |          0  (omitted)
             |
       _cons |   .4114342   .3679781     1.12   0.269    -.3292673    1.152136
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. reg attendance fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 
note: 2052.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1231569
                                                       F( 46,    46) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4722
                                                       Root MSE      =  .59214

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0206452   .0033102    -6.24   0.000    -.0273082   -.0139822
       malec |   .0157363   .0071967     2.19   0.034       .00125    .0302225
         age |   .2433121   .0200487    12.14   0.000     .2029563     .283668
       agesq |  -.0097989   .0009308   -10.53   0.000    -.0116725   -.0079253
      agemay |   .0230813    .013824     1.67   0.102    -.0047451    .0509076
    m_age_sq |  -.0004992   .0002862    -1.74   0.088    -.0010752    .0000768
             |
        _cou |
          2  |     .51303   .0655346     7.83   0.000     .3811157    .6449442
          3  |  -.0222744   .0268895    -0.83   0.412    -.0764003    .0318514
          5  |   .3185858   .0561405     5.67   0.000     .2055809    .4315907
          6  |   .5032181   .0425292    11.83   0.000     .4176112     .588825
          8  |  -.0068816   .0703873    -0.10   0.923    -.1485638    .1348007
          9  |   .1348898   .0275171     4.90   0.000     .0795007    .1902789
         11  |   .1090416   .0474363     2.30   0.026     .0135573    .2045259
         12  |   .5832832   .0620158     9.41   0.000     .4584519    .7081146
         13  |    .171447   .0624696     2.74   0.009     .0457021    .2971919
         14  |   .6610201   .0274424    24.09   0.000     .6057814    .7162588
         16  |   .0538612   .0505826     1.06   0.293    -.0479563    .1556787
         17  |   .0393969   .0376863     1.05   0.301    -.0364617    .1152555
         20  |   .2015813    .054662     3.69   0.001     .0915524    .3116101
         21  |  -.1000255    .130348    -0.77   0.447    -.3624024    .1623513
         23  |   .2838892    .046916     6.05   0.000     .1894521    .3783262
         25  |   .2776066   .0521526     5.32   0.000     .1726289    .3825843
         26  |    .135456   .0166146     8.15   0.000     .1020125    .1688994
         27  |   .1973629   .0860753     2.29   0.026     .0241023    .3706234
         29  |   .0362905   .0398821     0.91   0.368     -.043988     .116569
         31  |   .0933363   .0249222     3.75   0.001     .0431705    .1435021
         33  |   .2098048   .0266034     7.89   0.000     .1562549    .2633548
         35  |   .2786694   .0323095     8.62   0.000     .2136337    .3437051
         36  |  -.0116111   .0426437    -0.27   0.787    -.0974485    .0742263
         37  |   .2791095   .0400348     6.97   0.000     .1985237    .3596953
         38  |   .4097799   .0622788     6.58   0.000     .2844191    .5351406
         39  |   .2180481   .0174428    12.50   0.000     .1829375    .2531587
         40  |   .0821541   .0729774     1.13   0.266    -.0647418    .2290501
         41  |   .0697059   .0379623     1.84   0.073    -.0067081      .14612
         42  |   .5133625   .0641648     8.00   0.000     .3842055    .6425195
         43  |   .3834567   .0656587     5.84   0.000     .2512926    .5156209
         44  |   .0922137   .0367942     2.51   0.016     .0181508    .1662767
         45  |  -.9213522   .3040998    -3.03   0.004    -1.533473   -.3092311
         46  |   .3583238   .0829039     4.32   0.000      .191447    .5252007
         47  |  -.0183186   .0478154    -0.38   0.703     -.114566    .0779287
         48  |   .1675269   .0379257     4.42   0.000     .0911865    .2438674
         51  |   .5063437   .0959874     5.28   0.000     .3131311    .6995563
         53  |   .1798654   .0583017     3.09   0.003     .0625101    .2972207
         54  |   .1179563   .0257022     4.59   0.000     .0662205    .1696922
         55  |   .1880137   .0355771     5.28   0.000     .1164006    .2596267
         56  |    .179951   .0350398     5.14   0.000     .1094196    .2504825
         58  |   .0649294   .0381439     1.70   0.095    -.0118504    .1417092
         59  |   .4459311   .0370575    12.03   0.000     .3713383    .5205239
         61  |   .3588782   .0653819     5.49   0.000     .2272713    .4904851
         62  |   .4151656   .0806326     5.15   0.000     .2528606    .5774707
         67  |   .1488694   .0601907     2.47   0.017     .0277119     .270027
         68  |    .191934    .050021     3.84   0.000     .0912469     .292621
             |
  year_birth |
         58  |   .2457294   .0608775     4.04   0.000     .1231894    .3682695
         60  |   -.202376    .085411    -2.37   0.022    -.3742995   -.0304525
         63  |   -2.20607   .1200502   -18.38   0.000    -2.447718   -1.964421
         66  |   .1810174   .1613029     1.12   0.268    -.1436686    .5057034
         68  |   -.286959   .1650644    -1.74   0.089    -.6192163    .0452984
         69  |  -1.970008   .1736282   -11.35   0.000    -2.319504   -1.620513
         70  |  -.3767795   .1813565    -2.08   0.043    -.7418313   -.0117278
         71  |  -.1940116   .1854397    -1.05   0.301    -.5672825    .1792592
         72  |  -.8364531   .2045639    -4.09   0.000    -1.248219   -.4246874
         73  |  -.8647578   .2128365    -4.06   0.000    -1.293176   -.4363401
         75  |  -1.427527   .2258961    -6.32   0.000    -1.882232   -.9728219
       1942  |  -.7189975   .1817879    -3.96   0.000    -1.084918   -.3530774
       1943  |  -.5507229   .1747953    -3.15   0.003    -.9025677   -.1988782
       1944  |  -.6947168   .1605319    -4.33   0.000    -1.017851   -.3715829
       1945  |  -.6420474   .1423988    -4.51   0.000    -.9286813   -.3554136
       1946  |  -.6123477   .1260431    -4.86   0.000    -.8660593   -.3586361
       1947  |  -.6644591   .1160047    -5.73   0.000    -.8979645   -.4309537
       1948  |  -.7315965   .1106696    -6.61   0.000    -.9543629   -.5088301
       1949  |  -.6565598   .1045807    -6.28   0.000    -.8670698   -.4460498
       1950  |  -.5708074   .1998994    -2.86   0.006     -.973184   -.1684308
       1951  |  -.6090816   .1706434    -3.57   0.001     -.952569   -.2655941
       1952  |  -.6276125   .1588145    -3.95   0.000    -.9472894   -.3079356
       1953  |  -.6558814   .1301929    -5.04   0.000    -.9179461   -.3938167
       1954  |  -.6633958   .1225545    -5.41   0.000    -.9100852   -.4167064
       1955  |  -.6972945   .1059066    -6.58   0.000    -.9104734   -.4841156
       1956  |  -.7409963    .087216    -8.50   0.000     -.916553   -.5654395
       1957  |  -.7534204   .0773213    -9.74   0.000    -.9090602   -.5977807
       1958  |  -.7746021   .0640531   -12.09   0.000    -.9035343   -.6456699
       1959  |  -.8010014   .0503133   -15.92   0.000    -.9022769    -.699726
       1960  |   -.835207   .0482636   -17.31   0.000    -.9323566   -.7380573
       1961  |  -.8515196   .0389372   -21.87   0.000    -.9298962    -.773143
       1962  |  -.8611407   .0372769   -23.10   0.000    -.9361751   -.7861063
       1963  |  -.8970654   .0426986   -21.01   0.000    -.9830131   -.8111176
       1964  |  -.9104422   .0480969   -18.93   0.000    -1.007256   -.8136282
       1965  |   -.951087   .0605624   -15.70   0.000    -1.072993   -.8291811
       1966  |  -.9564578   .0671213   -14.25   0.000    -1.091566   -.8213496
       1967  |  -.9766774   .0789382   -12.37   0.000    -1.135572    -.817783
       1968  |  -1.003735   .0894342   -11.22   0.000    -1.183757   -.8237131
       1969  |  -1.014408    .099905   -10.15   0.000    -1.215506   -.8133092
       1970  |  -1.046004   .1101588    -9.50   0.000    -1.267743   -.8242663
       1971  |  -1.051368   .1204219    -8.73   0.000    -1.293764   -.8089709
       1972  |   -1.06681   .1311831    -8.13   0.000    -1.330868   -.8027524
       1973  |  -1.097407   .1395932    -7.86   0.000    -1.378394   -.8164208
       1974  |  -1.109438   .1473703    -7.53   0.000    -1.406079   -.8127972
       1975  |  -1.126075   .1554382    -7.24   0.000    -1.438956   -.8131941
       1976  |  -1.143984   .1633136    -7.00   0.000    -1.472717   -.8152504
       1977  |  -1.159159   .1727489    -6.71   0.000    -1.506885   -.8114337
       1978  |  -1.174832   .1770689    -6.63   0.000    -1.531253   -.8184105
       1979  |  -1.180407   .1842838    -6.41   0.000    -1.551351   -.8094626
       1980  |  -1.186863   .1880434    -6.31   0.000    -1.565375   -.8083515
       1981  |  -1.192114   .1930244    -6.18   0.000    -1.580652   -.8035758
       1982  |  -1.191407   .1974692    -6.03   0.000    -1.588891   -.7939218
       1983  |  -1.181912   .2024872    -5.84   0.000    -1.589497   -.7743263
       1984  |  -1.174049   .2045447    -5.74   0.000    -1.585776   -.7623223
       1985  |  -1.157032    .202921    -5.70   0.000    -1.565491   -.7485732
       1986  |  -1.153559   .2048391    -5.63   0.000    -1.565878   -.7412391
       1987  |  -1.151406   .1989396    -5.79   0.000    -1.551851   -.7509612
       1988  |   -1.15552   .1991581    -5.80   0.000    -1.556404   -.7546355
       1989  |  -1.188019   .1863539    -6.38   0.000     -1.56313   -.8129081
       1990  |  -1.167234   .1916254    -6.09   0.000    -1.552956   -.7815126
       1991  |   -1.18076   .1883135    -6.27   0.000    -1.559815   -.8017041
       1992  |  -1.171817   .1945249    -6.02   0.000    -1.563376   -.7802588
       1993  |  -1.170112   .2012017    -5.82   0.000     -1.57511   -.7651142
       1994  |  -1.180107   .2099387    -5.62   0.000    -1.602691   -.7575218
       1995  |  -1.166272   .2127095    -5.48   0.000    -1.594434   -.7381101
       1996  |  -1.274354   .2898296    -4.40   0.000    -1.857751   -.6909573
       2007  |   .6667066   .3366436     1.98   0.054    -.0109219    1.344335
       2008  |   .7938752   .3421273     2.32   0.025     .1052086    1.482542
       2009  |   .7504685   .3292674     2.28   0.027     .0876877    1.413249
       2010  |   .7148171   .3144977     2.27   0.028      .081766    1.347868
       2011  |   .7036424   .2991252     2.35   0.023     .1015347     1.30575
       2012  |   .6111133   .2866024     2.13   0.038     .0342127    1.188014
       2013  |    .476202   .2913478     1.63   0.109    -.1102507    1.062655
       2014  |   .4220156   .2853987     1.48   0.146    -.1524623    .9964935
       2015  |   .4977414   .2688368     1.85   0.071     -.043399    1.038882
       2016  |   .4647807   .2590428     1.79   0.079    -.0566454    .9862068
       2017  |   .3430825   .2496853     1.37   0.176    -.1595079    .8456729
       2018  |   .3951844    .245035     1.61   0.114    -.0980454    .8884143
       2019  |   .3458823   .2351165     1.47   0.148    -.1273828    .8191473
       2020  |   .3158514   .2326316     1.36   0.181    -.1524117    .7841145
       2021  |   .2446831   .2176366     1.12   0.267    -.1933968    .6827629
       2022  |   .3257021   .2118696     1.54   0.131    -.1007693    .7521734
       2023  |   .2773596   .1999586     1.39   0.172    -.1251362    .6798553
       2024  |   .2901838   .1913608     1.52   0.136    -.0950054     .675373
       2025  |   .2818325    .180935     1.56   0.126    -.0823708    .6460358
       2026  |    .217856   .1777104     1.23   0.226    -.1398564    .5755684
       2027  |   .2537109   .1683576     1.51   0.139    -.0851754    .5925972
       2028  |   .1934912   .1646477     1.18   0.246    -.1379274    .5249098
       2029  |   .2027062   .1516963     1.34   0.188    -.1026425     .508055
       2030  |    .168152   .1471039     1.14   0.259    -.1279528    .4642567
       2031  |   .1566953   .1341678     1.17   0.249    -.1133705     .426761
       2032  |   .1406632   .1314772     1.07   0.290    -.1239868    .4053131
       2033  |   .0823282   .1233709     0.67   0.508    -.1660045    .3306609
       2034  |   .0946477   .1152033     0.82   0.416    -.1372446      .32654
       2035  |   .0883531   .1080119     0.82   0.418    -.1290637    .3057698
       2036  |   .0594377   .1011258     0.59   0.560     -.144118    .2629933
       2037  |   .1085721   .0937427     1.16   0.253    -.0801222    .2972664
       2038  |    .084567   .0907797     0.93   0.356    -.0981631     .267297
       2039  |   .1019227   .0824645     1.24   0.223    -.0640697    .2679151
       2040  |   .1110036   .0794387     1.40   0.169    -.0488981    .2709053
       2041  |   .1086945    .073489     1.48   0.146    -.0392313    .2566202
       2042  |   .1100324   .0667095     1.65   0.106     -.024247    .2443117
       2043  |   .1329517   .0589084     2.26   0.029     .0143753     .251528
       2044  |   .1435878   .0546003     2.63   0.012     .0336832    .2534924
       2045  |   .1457167   .0476964     3.06   0.004     .0497088    .2417247
       2046  |   .1100359   .0456493     2.41   0.020     .0181486    .2019233
       2047  |   .1001664   .0376193     2.66   0.011     .0244426    .1758902
       2048  |   .0811451   .0282404     2.87   0.006        .0243    .1379901
       2049  |   .1966625    .017112    11.49   0.000      .162218    .2311071
       2050  |    .159594   .0107312    14.87   0.000     .1379933    .1811947
       2051  |   .2537247   .0135287    18.75   0.000     .2264929    .2809566
       2052  |          0  (omitted)
             |
   educf_1_4 |   .1216138   .0130188     9.34   0.000     .0954083    .1478193
   educf_5_6 |   .1686839    .015686    10.75   0.000     .1371097     .200258
  educf_7_10 |   .1807012   .0170459    10.60   0.000     .1463896    .2150127
educf_11plus |   .1858509   .0196507     9.46   0.000      .146296    .2254057
       poor1 |  -.0882431   .0115492    -7.64   0.000    -.1114906   -.0649957
       _cons |   .2705496   .3786393     0.71   0.479    -.4916117    1.032711
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. reg attendance fert `basecontrols' `morecontrols', cluster(_cou) 
note: 2052.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1222957
                                                       F( 46,    46) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4733
                                                       Root MSE      =  .59154

                                  (Std. Err. adjusted for 47 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  attendance |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0202913   .0033204    -6.11   0.000    -.0269749   -.0136076
       malec |   .0159884   .0072406     2.21   0.032     .0014139     .030563
         age |   .2429255   .0200462    12.12   0.000     .2025746    .2832764
       agesq |  -.0097953   .0009294   -10.54   0.000    -.0116661   -.0079245
      agemay |     .02103   .0135967     1.55   0.129    -.0063386    .0483987
    m_age_sq |  -.0004797   .0002821    -1.70   0.096    -.0010475    .0000881
             |
        _cou |
          2  |   .5140197   .0646619     7.95   0.000     .3838621    .6441773
          3  |   -.027176   .0262908    -1.03   0.307    -.0800967    .0257446
          5  |   .3250414   .0569029     5.71   0.000     .2105019     .439581
          6  |   .4950002   .0414547    11.94   0.000     .4115562    .5784442
          8  |   .0093155   .0715876     0.13   0.897    -.1347828    .1534137
          9  |   .1544186   .0287534     5.37   0.000      .096541    .2122962
         11  |   .1352289   .0485663     2.78   0.008     .0374699    .2329879
         12  |   .5837201   .0625749     9.33   0.000     .4577634    .7096768
         13  |   .1820323   .0639534     2.85   0.007     .0533008    .3107638
         14  |    .657333   .0268337    24.50   0.000     .6033195    .7113465
         16  |   .0633591   .0510305     1.24   0.221    -.0393599    .1660781
         17  |   .0565323   .0389781     1.45   0.154    -.0219266    .1349911
         20  |   .1725592   .0527289     3.27   0.002     .0664215    .2786969
         21  |  -.0776058   .1304121    -0.60   0.555    -.3401117       .1849
         23  |   .2896099    .047446     6.10   0.000     .1941061    .3851136
         25  |   .2884246   .0531414     5.43   0.000     .1814565    .3953928
         26  |   .1296975   .0161129     8.05   0.000     .0972639    .1621312
         27  |   .2063547   .0860395     2.40   0.021     .0331663    .3795432
         29  |   .0636259   .0410422     1.55   0.128    -.0189877    .1462395
         31  |   .0712866   .0242869     2.94   0.005     .0223996    .1201736
         33  |   .2210749   .0278777     7.93   0.000     .1649601    .2771898
         35  |   .2724165   .0324417     8.40   0.000     .2071148    .3377183
         36  |  -.0039838   .0434299    -0.09   0.927    -.0914037    .0834361
         37  |   .3052097     .04141     7.37   0.000     .2218557    .3885637
         38  |   .4235535   .0628138     6.74   0.000     .2971159    .5499911
         39  |   .2195604   .0170519    12.88   0.000     .1852367    .2538842
         40  |   .0875733   .0734972     1.19   0.240    -.0603688    .2355154
         41  |   .0666097   .0374234     1.78   0.082    -.0087197    .1419392
         42  |   .5027969   .0631249     7.97   0.000     .3757331    .6298607
         43  |   .3939997   .0661262     5.96   0.000     .2608945    .5271049
         44  |   .0958761   .0375179     2.56   0.014     .0203565    .1713958
         45  |  -.8611587   .3060668    -2.81   0.007    -1.477239   -.2450782
         46  |   .3511715   .0815958     4.30   0.000     .1869278    .5154153
         47  |  -.0123115   .0490315    -0.25   0.803    -.1110068    .0863837
         48  |   .1768487   .0389017     4.55   0.000     .0985436    .2551537
         51  |   .5055285   .0942501     5.36   0.000     .3158129    .6952441
         53  |   .1960169   .0587363     3.34   0.002     .0777869    .3142469
         54  |   .1153961   .0267462     4.31   0.000     .0615587    .1692334
         55  |    .190067   .0373058     5.09   0.000     .1149743    .2651598
         56  |   .1821989   .0354558     5.14   0.000       .11083    .2535678
         58  |   .0463333   .0382611     1.21   0.232    -.0306823     .123349
         59  |   .4598937   .0378446    12.15   0.000     .3837166    .5360708
         61  |   .3395772   .0646519     5.25   0.000     .2094397    .4697147
         62  |   .4281118   .0811821     5.27   0.000     .2647007    .5915229
         67  |   .1643832   .0609721     2.70   0.010     .0416528    .2871136
         68  |   .1971148   .0503952     3.91   0.000     .0956745    .2985551
             |
  year_birth |
         58  |   .2044475    .058154     3.52   0.001     .0873895    .3215054
         60  |  -.1490455   .0894664    -1.67   0.103    -.3291321     .031041
         63  |  -2.217447   .1189813   -18.64   0.000    -2.456944    -1.97795
         66  |    .215888   .1630693     1.32   0.192    -.1123534    .5441294
         68  |  -.2368855   .1678519    -1.41   0.165    -.5747538    .1009827
         69  |  -1.905941   .1760746   -10.82   0.000    -2.260361   -1.551521
         70  |  -.3819688   .1807037    -2.11   0.040    -.7457064   -.0182312
         71  |  -.1833883    .185633    -0.99   0.328     -.557048    .1902715
         72  |  -.7837602   .2056883    -3.81   0.000    -1.197789    -.369731
         73  |  -.8475638   .2135102    -3.97   0.000    -1.277338     -.41779
         75  |   -1.39964   .2268069    -6.17   0.000    -1.856178    -.943101
       1942  |  -.6695104   .1765057    -3.79   0.000    -1.024798    -.314223
       1943  |  -.5121077   .1698971    -3.01   0.004    -.8540928   -.1701225
       1944  |  -.6531849   .1559055    -4.19   0.000    -.9670065   -.3393634
       1945  |  -.6005469    .138193    -4.35   0.000     -.878715   -.3223788
       1946  |  -.5748106   .1223402    -4.70   0.000    -.8210687   -.3285525
       1947  |  -.6268029   .1124981    -5.57   0.000    -.8532499   -.4003559
       1948  |  -.6960527   .1073591    -6.48   0.000    -.9121554   -.4799499
       1949  |  -.6233199   .1014389    -6.14   0.000    -.8275057   -.4191341
       1950  |  -.5496455   .1887148    -2.91   0.006    -.9295086   -.1697824
       1951  |  -.5806066   .1640651    -3.54   0.001    -.9108524   -.2503607
       1952  |  -.5990836   .1538542    -3.89   0.000    -.9087761   -.2893912
       1953  |  -.6290643   .1256029    -5.01   0.000    -.8818899   -.3762387
       1954  |  -.6360184    .118508    -5.37   0.000    -.8745625   -.3974742
       1955  |  -.6698107   .1026767    -6.52   0.000    -.8764882   -.4631333
       1956  |  -.7119138   .0853565    -8.34   0.000    -.8837275   -.5401001
       1957  |  -.7272244   .0751149    -9.68   0.000    -.8784228    -.576026
       1958  |  -.7485769   .0630107   -11.88   0.000     -.875411   -.6217429
       1959  |  -.7752573    .050706   -15.29   0.000    -.8773232   -.6731915
       1960  |  -.8094938   .0499837   -16.20   0.000    -.9101058   -.7088818
       1961  |  -.8264028   .0420311   -19.66   0.000    -.9110069   -.7417987
       1962  |  -.8351096   .0415875   -20.08   0.000    -.9188208   -.7513983
       1963  |  -.8719195     .04782   -18.23   0.000    -.9681763   -.7756628
       1964  |  -.8852179   .0534001   -16.58   0.000    -.9927068   -.7777291
       1965  |   -.924917   .0652738   -14.17   0.000    -1.056306   -.7935276
       1966  |  -.9318373   .0715483   -13.02   0.000    -1.075857    -.787818
       1967  |  -.9518583   .0833393   -11.42   0.000    -1.119612    -.784105
       1968  |  -.9790266    .093205   -10.50   0.000    -1.166639   -.7914148
       1969  |  -.9897808   .1035017    -9.56   0.000    -1.198119   -.7814426
       1970  |  -1.021408   .1137145    -8.98   0.000    -1.250304   -.7925129
       1971  |  -1.027046   .1234426    -8.32   0.000    -1.275523   -.7785687
       1972  |  -1.042642   .1339954    -7.78   0.000     -1.31236   -.7729232
       1973  |  -1.072852   .1423011    -7.54   0.000    -1.359289   -.7864146
       1974  |  -1.085721   .1496646    -7.25   0.000    -1.386981   -.7844622
       1975  |  -1.102228   .1574698    -7.00   0.000    -1.419198   -.7852574
       1976  |  -1.120463   .1654502    -6.77   0.000    -1.453497    -.787429
       1977  |  -1.135659   .1747068    -6.50   0.000    -1.487326   -.7839927
       1978  |  -1.151079   .1789491    -6.43   0.000    -1.511285   -.7908732
       1979  |  -1.157321   .1859322    -6.22   0.000    -1.531583   -.7830588
       1980  |  -1.164047   .1896026    -6.14   0.000    -1.545697   -.7823966
       1981  |  -1.169598   .1946308    -6.01   0.000     -1.56137   -.7778269
       1982  |  -1.168396   .1986898    -5.88   0.000    -1.568338   -.7684543
       1983  |  -1.158317   .2038336    -5.68   0.000    -1.568613   -.7480209
       1984  |   -1.15111   .2056188    -5.60   0.000    -1.564999   -.7372209
       1985  |  -1.134583   .2036831    -5.57   0.000    -1.544576   -.7245899
       1986  |  -1.130855   .2056978    -5.50   0.000    -1.544903   -.7168072
       1987  |  -1.128638   .1993783    -5.66   0.000    -1.529965   -.7273099
       1988  |  -1.133388   .1996458    -5.68   0.000    -1.535255   -.7315221
       1989  |  -1.165449   .1871193    -6.23   0.000    -1.542101   -.7887977
       1990  |  -1.145427   .1924436    -5.95   0.000    -1.532796   -.7580583
       1991  |   -1.15915   .1889146    -6.14   0.000    -1.539415   -.7788846
       1992  |  -1.152164   .1953912    -5.90   0.000    -1.545466   -.7588623
       1993  |   -1.14663    .202451    -5.66   0.000    -1.554143    -.739117
       1994  |  -1.159514   .2109796    -5.50   0.000    -1.584194   -.7348344
       1995  |  -1.143876   .2137553    -5.35   0.000    -1.574143   -.7136087
       1996  |  -1.250609   .2909189    -4.30   0.000    -1.836199   -.6650201
       2007  |   .6706885     .33492     2.00   0.051    -.0034704    1.344847
       2008  |   .7972005   .3403969     2.34   0.024      .112017    1.482384
       2009  |   .7515885   .3278129     2.29   0.026     .0917353    1.411442
       2010  |   .7184775   .3133773     2.29   0.026     .0876817    1.349273
       2011  |   .7082475   .2978341     2.38   0.022     .1087386    1.307756
       2012  |    .613899   .2855618     2.15   0.037      .039093    1.188705
       2013  |   .4778451   .2901973     1.65   0.106    -.1062918    1.061982
       2014  |   .4224193   .2841544     1.49   0.144    -.1495539    .9943924
       2015  |   .4969945    .267833     1.86   0.070    -.0421253    1.036114
       2016  |   .4630567   .2580877     1.79   0.079     -.056447    .9825604
       2017  |   .3414182   .2487666     1.37   0.177     -.159323    .8421594
       2018  |   .3913771   .2440935     1.60   0.116    -.0999576    .8827117
       2019  |   .3444924   .2342749     1.47   0.148    -.1270784    .8160633
       2020  |   .3123145   .2317144     1.35   0.184    -.1541024    .7787314
       2021  |   .2419598   .2168084     1.12   0.270    -.1944529    .6783725
       2022  |    .320527     .21107     1.52   0.136    -.1043349     .745389
       2023  |   .2731217   .1991612     1.37   0.177    -.1277691    .6740124
       2024  |   .2826245   .1906572     1.48   0.145    -.1011484    .6663975
       2025  |   .2745079   .1800549     1.52   0.134    -.0879237    .6369396
       2026  |   .2101443   .1767981     1.19   0.241    -.1457318    .5660204
       2027  |   .2448703   .1675202     1.46   0.151    -.0923303     .582071
       2028  |   .1845432   .1637902     1.13   0.266    -.1451495    .5142358
       2029  |   .1935514   .1508441     1.28   0.206     -.110082    .4971847
       2030  |   .1575741   .1461908     1.08   0.287    -.1366926    .4518408
       2031  |    .147557   .1331937     1.11   0.274     -.120548    .4156619
       2032  |   .1280361   .1305164     0.98   0.332    -.1346798     .390752
       2033  |   .0700597   .1223586     0.57   0.570    -.1762353    .3163547
       2034  |   .0816881   .1142244     0.72   0.478    -.1482337    .3116099
       2035  |   .0751113   .1069959     0.70   0.486    -.1402602    .2904829
       2036  |   .0461691   .1001737     0.46   0.647    -.1554702    .2478083
       2037  |   .0939462   .0927955     1.01   0.317    -.0928415    .2807339
       2038  |    .069803   .0897906     0.78   0.441    -.1109362    .2505422
       2039  |   .0873106    .081432     1.07   0.289    -.0766035    .2512248
       2040  |    .094824   .0783332     1.21   0.232    -.0628524    .2525005
       2041  |   .0919798   .0723174     1.27   0.210    -.0535876    .2375473
       2042  |   .0927782   .0655865     1.41   0.164    -.0392406     .224797
       2043  |   .1156663    .057776     2.00   0.051    -.0006308    .2319634
       2044  |   .1267911    .053514     2.37   0.022      .019073    .2345091
       2045  |    .127387   .0466866     2.73   0.009     .0334118    .2213622
       2046  |   .0915422    .044545     2.06   0.046     .0018777    .1812066
       2047  |   .0790402   .0362488     2.18   0.034     .0060752    .1520052
       2048  |   .0637909   .0271977     2.35   0.023     .0090448     .118537
       2049  |   .1788615    .016111    11.10   0.000     .1464318    .2112912
       2050  |   .1442775   .0102696    14.05   0.000     .1236057    .1649492
       2051  |   .2316476   .0137977    16.79   0.000     .2038743     .259421
       2052  |          0  (omitted)
             |
      height |   .0000731   .0000412     1.78   0.082    -9.73e-06     .000156
         bmi |   .0068528   .0011793     5.81   0.000     .0044791    .0092266
   educf_1_4 |   .1164216   .0120824     9.64   0.000     .0921009    .1407423
   educf_5_6 |    .159775   .0145092    11.01   0.000     .1305694    .1889806
  educf_7_10 |    .169354   .0155774    10.87   0.000     .1379984    .2007097
educf_11plus |    .172306   .0173014     9.96   0.000     .1374801    .2071318
       poor1 |  -.0807236   .0108256    -7.46   0.000    -.1025144   -.0589328
       _cons |   .0144806   .3629123     0.04   0.968    -.7160241    .7449852
------------------------------------------------------------------------------

. outreg2 fert using "~/olshighschool.tex", tex(pr) append
~/olshighschool.tex
dir : seeout

. 
. reg highschool fert `basecontrols', cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1978538
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4562
                                                       Root MSE      =  .23051

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  highschool |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0199177   .0027716    -7.19   0.000    -.0254636   -.0143717
       malec |  -.0049359   .0026725    -1.85   0.070    -.0102837    .0004118
         age |  -.0333513   .0016344   -20.41   0.000    -.0366217    -.030081
       agesq |   .0038838   .0002877    13.50   0.000     .0033081    .0044595
      agemay |  -.0050381   .0044852    -1.12   0.266     -.014013    .0039367
    m_age_sq |   .0001597   .0000722     2.21   0.031     .0000153    .0003042
             |
        _cou |
          2  |   .2467792   .0066933    36.87   0.000     .2333859    .2601725
          3  |   .3409103    .002953   115.45   0.000     .3350014    .3468192
          4  |   .1533494   .0146841    10.44   0.000     .1239666    .1827322
          5  |   .0946847   .0188808     5.01   0.000     .0569044     .132465
          6  |   .1036362    .015445     6.71   0.000     .0727308    .1345416
          7  |   .1114906   .0209217     5.33   0.000     .0696264    .1533549
          8  |   .0662531   .0185426     3.57   0.001     .0291494    .1033568
          9  |   .0530903   .0185384     2.86   0.006     .0159951    .0901855
         10  |   .0973333    .022979     4.24   0.000     .0513525    .1433141
         11  |    .055408   .0116216     4.77   0.000     .0321531    .0786628
         12  |   .1132973   .0201046     5.64   0.000     .0730681    .1535265
         13  |   .0870362   .0208061     4.18   0.000     .0454033     .128669
         14  |   .1805814    .009621    18.77   0.000     .1613298     .199833
         15  |   .0958344   .0231472     4.14   0.000     .0495169    .1421518
         16  |   .0970967   .0160709     6.04   0.000     .0649389    .1292545
         17  |   .0982565   .0188956     5.20   0.000     .0604464    .1360665
         18  |   .1015026   .0215571     4.71   0.000     .0583669    .1446383
         19  |   .0633287   .0165674     3.82   0.000     .0301774    .0964801
         20  |   .2039558   .0127162    16.04   0.000     .1785107    .2294008
         21  |   .0710135   .0205339     3.46   0.001     .0299253    .1121018
         22  |   .1276042   .0241432     5.29   0.000     .0792938    .1759146
         23  |   .0964179   .0174609     5.52   0.000     .0614787    .1313571
         24  |   .0894985    .021537     4.16   0.000     .0464032    .1325939
         25  |   .0741772   .0197609     3.75   0.000     .0346356    .1137187
         26  |   .2142727   .0108002    19.84   0.000     .1926615    .2358838
         27  |   .0564729    .017267     3.27   0.002     .0219218    .0910241
         28  |   .0781283   .0135556     5.76   0.000     .0510037     .105253
         29  |   .1804309   .0110611    16.31   0.000     .1582977    .2025642
         31  |   .2366149   .0148506    15.93   0.000      .206899    .2663308
         32  |   .2526507   .0084865    29.77   0.000     .2356693    .2696321
         33  |   .0669635   .0191004     3.51   0.001     .0287437    .1051832
         34  |   .2283431   .0110772    20.61   0.000     .2061776    .2505086
         35  |   .0332808   .0111897     2.97   0.004     .0108902    .0556714
         36  |   .0612293   .0181545     3.37   0.001     .0249023    .0975564
         37  |   .1004707   .0174995     5.74   0.000     .0654542    .1354871
         38  |    .059246   .0184393     3.21   0.002     .0223489     .096143
         39  |   .1330949   .0084963    15.66   0.000     .1160937     .150096
         40  |   .0741625   .0193791     3.83   0.000     .0353849      .11294
         41  |   .2939123   .0033307    88.24   0.000     .2872476    .3005771
         42  |   .0990133   .0137833     7.18   0.000     .0714329    .1265936
         43  |   .0634765   .0187007     3.39   0.001     .0260565    .1008966
         44  |   .0773147   .0164128     4.71   0.000     .0444728    .1101565
         45  |    .028974   .0283882     1.02   0.312    -.0278306    .0857787
         46  |   .0838955   .0141069     5.95   0.000     .0556677    .1121234
         47  |   .0923995   .0215352     4.29   0.000     .0493077    .1354914
         48  |   .1316773   .0191946     6.86   0.000     .0932691    .1700855
         51  |   .1444033   .0167115     8.64   0.000     .1109635     .177843
         53  |   .0302833   .0162121     1.87   0.067     -.002157    .0627236
         54  |   .0885792    .015287     5.79   0.000       .05799    .1191685
         55  |    .080398   .0191089     4.21   0.000     .0421613    .1186348
         56  |   .0867087   .0178247     4.86   0.000     .0510415    .1223759
         58  |   .0656698   .0136431     4.81   0.000     .0383701    .0929695
         59  |   .0672297   .0188905     3.56   0.001     .0294299    .1050294
         60  |   .0916677   .0231527     3.96   0.000     .0453394    .1379961
         61  |   .1260911   .0194552     6.48   0.000     .0871613    .1650209
         62  |   .0907288   .0207242     4.38   0.000     .0492597    .1321979
         64  |   .2669571   .0109522    24.37   0.000     .2450417    .2888724
         67  |   .0847664   .0196287     4.32   0.000     .0454895    .1240432
         68  |   .1053631   .0153529     6.86   0.000     .0746419    .1360842
             |
  year_birth |
          4  |   .0449323   .0048387     9.29   0.000       .03525    .0546145
          5  |   .1223362   .0105437    11.60   0.000     .1012384    .1434339
          6  |   .0854291   .0068814    12.41   0.000     .0716595    .0991986
          7  |   .1560027   .0092629    16.84   0.000     .1374676    .1745377
          8  |   .1779879   .0116611    15.26   0.000     .1546541    .2013218
          9  |   .1581853   .0125385    12.62   0.000     .1330959    .1832746
         10  |   .1177206    .015075     7.81   0.000     .0875555    .1478857
         11  |   .1527659   .0159114     9.60   0.000     .1209273    .1846044
         12  |   .1657196   .0175537     9.44   0.000     .1305949    .2008444
         13  |   .1559352   .0191105     8.16   0.000     .1176953    .1941752
         14  |   .2139799   .0194122    11.02   0.000     .1751361    .2528236
         15  |   .2057105   .0202414    10.16   0.000     .1652075    .2462135
         16  |   .1787058   .0215877     8.28   0.000     .1355089    .2219026
         17  |   .2080985   .0220137     9.45   0.000     .1640492    .2521477
         18  |   .1916515   .0229048     8.37   0.000      .145819     .237484
         19  |   .2032295   .0234871     8.65   0.000     .1562318    .2502271
         20  |   .1951408   .0238422     8.18   0.000     .1474327    .2428489
         21  |   .1984371   .0241959     8.20   0.000     .1500212     .246853
         22  |   .2043595   .0245252     8.33   0.000     .1552848    .2534343
         23  |   .2080065   .0247292     8.41   0.000     .1585235    .2574895
         24  |   .2199086   .0251323     8.75   0.000     .1696191    .2701981
         25  |   .2189874    .025083     8.73   0.000     .1687964    .2691784
         26  |   .2180269   .0249937     8.72   0.000     .1680146    .2680392
         27  |   .2156312   .0250303     8.61   0.000     .1655457    .2657167
         28  |   .2132368   .0249603     8.54   0.000     .1632913    .2631823
         29  |   .2082195   .0249456     8.35   0.000     .1583034    .2581356
         30  |   .2036496   .0248944     8.18   0.000     .1538361     .253463
         31  |   .1949107   .0248471     7.84   0.000     .1451917    .2446296
         32  |    .188761   .0249961     7.55   0.000      .138744     .238778
         33  |   .1833565   .0252256     7.27   0.000     .1328802    .2338328
         34  |   .1693847   .0254082     6.67   0.000     .1185431    .2202263
         35  |    .167283   .0259043     6.46   0.000     .1154487    .2191173
         36  |   .1618351   .0263612     6.14   0.000     .1090864    .2145838
         37  |   .1462094   .0269206     5.43   0.000     .0923414    .2000775
         41  |   -.070101   .0739531    -0.95   0.347    -.2180809    .0778789
         42  |   .0246392   .0329211     0.75   0.457    -.0412357    .0905142
         43  |   .0153645   .0341434     0.45   0.654    -.0529562    .0836852
         44  |   .0326617   .0320497     1.02   0.312    -.0314696     .096793
         45  |   .0424952    .030821     1.38   0.173    -.0191776    .1041679
         46  |   .0657325   .0321491     2.04   0.045     .0014023    .1300626
         47  |   .0550242   .0321306     1.71   0.092    -.0092689    .1193173
         48  |   .0719476   .0316989     2.27   0.027     .0085182     .135377
         49  |   .0777892   .0314486     2.47   0.016     .0148607    .1407178
         50  |   .0821409   .0309945     2.65   0.010     .0201211    .1441607
         51  |   .0990085   .0327003     3.03   0.004     .0335754    .1644416
         52  |   .1008275   .0313702     3.21   0.002     .0380558    .1635992
         53  |   .1082525   .0323684     3.34   0.001     .0434835    .1730215
         54  |   .1157842   .0310951     3.72   0.000     .0535631    .1780052
         55  |   .1176118   .0323101     3.64   0.001     .0529594    .1822642
         56  |   .1240424   .0325895     3.81   0.000     .0588311    .1892538
         57  |   .1264097   .0325016     3.89   0.000     .0613741    .1914452
         58  |   .1291108   .0326845     3.95   0.000     .0637093    .1945122
         59  |   .1324851   .0342728     3.87   0.000     .0639054    .2010648
         60  |   .1313489    .033955     3.87   0.000      .063405    .1992928
         61  |   .1334804   .0334796     3.99   0.000     .0664878    .2004729
         62  |   .1301762   .0337357     3.86   0.000     .0626712    .1976811
         63  |   .1259328    .032568     3.87   0.000     .0607644    .1911013
         64  |   .1268688   .0319396     3.97   0.000     .0629579    .1907797
         65  |    .123044   .0316657     3.89   0.000     .0596811    .1864068
         66  |   .1241393   .0302297     4.11   0.000     .0636498    .1846287
         67  |   .1211147   .0297454     4.07   0.000     .0615944     .180635
         68  |   .1173523   .0280099     4.19   0.000     .0613046       .1734
         69  |   .1137156   .0273364     4.16   0.000     .0590155    .1684157
         70  |    .109906   .0270546     4.06   0.000     .0557699    .1640421
         71  |   .1088822    .025767     4.23   0.000     .0573225     .160442
         72  |   .1095773   .0247329     4.43   0.000     .0600869    .1590677
         73  |   .1026516   .0237272     4.33   0.000     .0551736    .1501295
         74  |   .1040726   .0225428     4.62   0.000     .0589646    .1491806
         75  |   .0984677   .0216842     4.54   0.000     .0550776    .1418577
         76  |   .0950957   .0208262     4.57   0.000     .0534226    .1367688
         77  |   .0937177    .020412     4.59   0.000     .0528734     .134562
         78  |   .0840513   .0202028     4.16   0.000     .0436256     .124477
         79  |   .0830689   .0199403     4.17   0.000     .0431685    .1229694
         80  |   .0726166   .0207042     3.51   0.001     .0311876    .1140456
         81  |   .0678259   .0213253     3.18   0.002      .025154    .1104978
         82  |   .0565856    .019498     2.90   0.005     .0175702    .0956009
         83  |   .0478889   .0190763     2.51   0.015     .0097173    .0860606
         84  |   .0501167   .0157131     3.19   0.002     .0186748    .0815586
         85  |   .0353088    .012031     2.93   0.005     .0112347    .0593829
         86  |   .0655044   .0052402    12.50   0.000     .0550189      .07599
       1942  |  -.0861365   .0380625    -2.26   0.027    -.1622993   -.0099737
       1943  |  -.0823018    .039356    -2.09   0.041     -.161053   -.0035506
       1944  |  -.0741098   .0380634    -1.95   0.056    -.1502745    .0020549
       1945  |  -.0359604   .0367992    -0.98   0.332    -.1095954    .0376746
       1946  |  -.0141454   .0361175    -0.39   0.697    -.0864164    .0581256
       1947  |   -.019509   .0362634    -0.54   0.593    -.0920719     .053054
       1948  |   .0011047    .035547     0.03   0.975    -.0700248    .0722341
       1949  |   .0178328   .0343228     0.52   0.605    -.0508471    .0865126
       1950  |   .0528356   .0401841     1.31   0.194    -.0275727    .1332438
       1951  |   .0375387   .0463774     0.81   0.422    -.0552623    .1303396
       1952  |   .0428434   .0402514     1.06   0.291    -.0376995    .1233862
       1953  |   .0544194   .0362824     1.50   0.139    -.0181816    .1270203
       1954  |   .0563672   .0327517     1.72   0.090    -.0091688    .1219033
       1955  |   .0728441   .0305553     2.38   0.020      .011703    .1339852
       1956  |   .0752273   .0295373     2.55   0.013     .0161233    .1343314
       1957  |   .0796689   .0293753     2.71   0.009      .020889    .1384487
       1958  |   .0894579   .0294009     3.04   0.003     .0306269    .1482889
       1959  |   .0993813   .0300793     3.30   0.002     .0391928    .1595697
       1960  |   .0982056    .029265     3.36   0.001     .0396465    .1567648
       1961  |   .1136963   .0296938     3.83   0.000     .0542792    .1731135
       1962  |    .116846   .0298582     3.91   0.000     .0570998    .1765922
       1963  |    .122275   .0287334     4.26   0.000     .0647797    .1797703
       1964  |   .1272624   .0302922     4.20   0.000     .0666478    .1878769
       1965  |   .1322134   .0304003     4.35   0.000     .0713826    .1930442
       1966  |   .1297307    .030985     4.19   0.000     .0677298    .1917316
       1967  |   .1364313     .03144     4.34   0.000       .07352    .1993426
       1968  |   .1333065   .0318899     4.18   0.000     .0694951     .197118
       1969  |   .1303925   .0318368     4.10   0.000     .0666872    .1940978
       1970  |   .1330515   .0326643     4.07   0.000     .0676904    .1984126
       1971  |   .1325812   .0320979     4.13   0.000     .0683534     .196809
       1972  |   .1305577   .0315299     4.14   0.000     .0674665    .1936489
       1973  |    .127987   .0310678     4.12   0.000     .0658204    .1901536
       1974  |   .1230827   .0311274     3.95   0.000      .060797    .1853685
       1975  |   .1188005   .0305656     3.89   0.000     .0576388    .1799622
       1976  |   .1174737   .0297062     3.95   0.000     .0580318    .1769157
       1977  |   .1142847   .0289897     3.94   0.000     .0562764     .172293
       1978  |   .1143087   .0282919     4.04   0.000     .0576968    .1709206
       1979  |   .1124046    .027395     4.10   0.000     .0575873    .1672219
       1980  |   .1130974   .0260912     4.33   0.000      .060889    .1653059
       1981  |   .1120648    .025308     4.43   0.000     .0614236    .1627061
       1982  |   .1108918   .0242797     4.57   0.000     .0623082    .1594754
       1983  |   .1092847   .0229741     4.76   0.000     .0633135    .1552558
       1984  |   .1102901   .0225871     4.88   0.000     .0650934    .1554869
       1985  |   .1053065   .0214115     4.92   0.000     .0624622    .1481508
       1986  |   .1066904    .020752     5.14   0.000     .0651658     .148215
       1987  |   .0998101   .0199983     4.99   0.000     .0597935    .1398266
       1988  |   .1024538   .0188596     5.43   0.000     .0647159    .1401917
       1989  |   .0966633   .0188304     5.13   0.000     .0589838    .1343429
       1990  |   .0956219   .0193604     4.94   0.000     .0568819    .1343619
       1991  |   .0823393   .0202452     4.07   0.000     .0418288    .1228498
       1992  |   .0820083   .0221018     3.71   0.000     .0377826    .1262339
       1993  |   .0636079   .0255882     2.49   0.016     .0124059    .1148098
       1994  |   .0591719   .0270552     2.19   0.033     .0050346    .1133093
       1995  |   .0383993   .0229598     1.67   0.100    -.0075432    .0843418
       1996  |          0  (omitted)
       2007  |  -.0129432   .0058235    -2.22   0.030     -.024596   -.0012904
       2008  |   .0627969   .0162837     3.86   0.000     .0302134    .0953805
       2009  |   .0841064   .0148492     5.66   0.000     .0543933    .1138195
       2010  |   .0731513   .0187833     3.89   0.000      .035566    .1107366
       2011  |   .1544117   .0150099    10.29   0.000      .124377    .1844463
       2012  |   .1482521   .0144573    10.25   0.000     .1193231    .1771811
       2013  |   .1350833   .0188223     7.18   0.000       .09742    .1727466
       2014  |   .1298396   .0191565     6.78   0.000     .0915076    .1681717
       2015  |   .1565063   .0184994     8.46   0.000      .119489    .1935235
       2016  |   .1637599   .0198061     8.27   0.000      .124128    .2033918
       2017  |   .1805742   .0193241     9.34   0.000     .1419068    .2192417
       2018  |   .1975524   .0207192     9.53   0.000     .1560934    .2390114
       2019  |   .2042828   .0216792     9.42   0.000     .1609028    .2476629
       2020  |   .1863571   .0210258     8.86   0.000     .1442846    .2284296
       2021  |   .2042517   .0222959     9.16   0.000     .1596377    .2488656
       2022  |   .2203644    .023204     9.50   0.000     .1739332    .2667955
       2023  |   .2113624    .022476     9.40   0.000     .1663879    .2563368
       2024  |   .2208027   .0229958     9.60   0.000     .1747882    .2668172
       2025  |   .2321453   .0227449    10.21   0.000     .1866328    .2776578
       2026  |   .2242257   .0234486     9.56   0.000     .1773052    .2711463
       2027  |   .2357298   .0238506     9.88   0.000     .1880048    .2834547
       2028  |   .2334911   .0236739     9.86   0.000     .1861197    .2808625
       2029  |   .2478362   .0238696    10.38   0.000     .2000732    .2955993
       2030  |   .2308322   .0238718     9.67   0.000     .1830649    .2785996
       2031  |   .2239703   .0238267     9.40   0.000     .1762932    .2716473
       2032  |    .235601   .0239297     9.85   0.000     .1877178    .2834841
       2033  |   .2211057   .0240647     9.19   0.000     .1729524    .2692589
       2034  |   .2231567    .024158     9.24   0.000     .1748167    .2714966
       2035  |   .2178741   .0241786     9.01   0.000     .1694928    .2662554
       2036  |   .2132528   .0243005     8.78   0.000     .1646276     .261878
       2037  |   .2095566     .02437     8.60   0.000     .1607924    .2583208
       2038  |   .1983701   .0244082     8.13   0.000     .1495295    .2472108
       2039  |   .2013743   .0244702     8.23   0.000     .1524095    .2503391
       2040  |   .1984446   .0245744     8.08   0.000     .1492713    .2476179
       2041  |   .1989095   .0246372     8.07   0.000     .1496106    .2482083
       2042  |    .203595   .0247392     8.23   0.000      .154092    .2530981
       2043  |   .1930688   .0246567     7.83   0.000     .1437308    .2424068
       2044  |    .195902   .0247477     7.92   0.000     .1463821    .2454219
       2045  |   .1956188   .0247735     7.90   0.000     .1460472    .2451904
       2046  |    .195967   .0250656     7.82   0.000     .1458108    .2461231
       2047  |   .1899486   .0251446     7.55   0.000     .1396343     .240263
       2048  |   .1779054   .0250381     7.11   0.000     .1278043    .2280066
       2049  |   .1684939   .0253132     6.66   0.000     .1178423    .2191455
       2050  |   .1627694   .0254836     6.39   0.000     .1117768    .2137619
       2051  |   .1515308   .0259931     5.83   0.000     .0995188    .2035428
       2052  |   .1790535   .0275511     6.50   0.000     .1239239    .2341831
             |
       _cons |  -.1139918    .047996    -2.38   0.021    -.2100315   -.0179521
------------------------------------------------------------------------------

. outreg2 fert using "~/olsattend.tex", tex(pr) append
~/olsattend.tex
dir : seeout

. reg highschool fert `basecontrols' educf_1_4 educf_5_6 educf_7_10 educf_11plus poor1, cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1978538
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4608
                                                       Root MSE      =  .22954

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  highschool |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0167329    .002319    -7.22   0.000    -.0213733   -.0120925
       malec |  -.0046705   .0026982    -1.73   0.089    -.0100696    .0007285
         age |  -.0330727   .0016392   -20.18   0.000    -.0363527   -.0297926
       agesq |   .0038668   .0002876    13.44   0.000     .0032912    .0044423
      agemay |   -.006402   .0047135    -1.36   0.180    -.0158337    .0030297
    m_age_sq |   .0001829   .0000755     2.42   0.019     .0000317    .0003341
             |
        _cou |
          2  |   .2452271   .0067584    36.28   0.000     .2317036    .2587506
          3  |   .3429485    .003112   110.20   0.000     .3367213    .3491757
          4  |   .1726083   .0160946    10.72   0.000      .140403    .2048136
          5  |   .1231321   .0210461     5.85   0.000     .0810189    .1652453
          6  |   .1103759   .0153293     7.20   0.000     .0797021    .1410498
          7  |   .1197589   .0207987     5.76   0.000     .0781407    .1613771
          8  |   .0977323   .0211566     4.62   0.000      .055398    .1400667
          9  |   .0702476   .0193042     3.64   0.001       .03162    .1088753
         10  |   .1178496    .023977     4.92   0.000     .0698718    .1658274
         11  |   .0720996   .0132935     5.42   0.000     .0454995    .0986998
         12  |   .1219775   .0200353     6.09   0.000     .0818869    .1620682
         13  |    .114002   .0226291     5.04   0.000     .0687213    .1592826
         14  |   .1883942   .0099513    18.93   0.000     .1684817    .2083067
         15  |   .1177563   .0243304     4.84   0.000     .0690712    .1664413
         16  |    .097773   .0154533     6.33   0.000      .066851     .128695
         17  |   .1055954   .0185804     5.68   0.000      .068416    .1427747
         18  |   .1241203   .0228927     5.42   0.000      .078312    .1699285
         19  |   .0689099   .0166203     4.15   0.000     .0356527     .102167
         20  |   .2229072    .014297    15.59   0.000     .1942989    .2515154
         21  |   .1041468    .023726     4.39   0.000     .0566711    .1516225
         22  |   .1209817   .0222599     5.43   0.000     .0764398    .1655237
         23  |   .1131603   .0183129     6.18   0.000     .0765163    .1498044
         24  |     .10903    .022416     4.86   0.000     .0641757    .1538843
         25  |   .1045863   .0221534     4.72   0.000     .0602575    .1489151
         26  |   .2176976   .0104153    20.90   0.000     .1968566    .2385385
         27  |   .0763298   .0189904     4.02   0.000     .0383301    .1143295
         28  |   .0907173   .0138785     6.54   0.000     .0629464    .1184882
         29  |   .1989177   .0126636    15.71   0.000     .1735779    .2242574
         31  |    .233004   .0141392    16.48   0.000     .2047115    .2612965
         32  |   .2490725   .0084775    29.38   0.000      .232109    .2660361
         33  |   .0697482    .018576     3.75   0.000     .0325777    .1069187
         34  |   .2209244   .0104732    21.09   0.000     .1999676    .2418811
         35  |   .0314417   .0105531     2.98   0.004      .010325    .0525584
         36  |   .0825991   .0193516     4.27   0.000     .0438766    .1213215
         37  |   .1118123   .0176266     6.34   0.000     .0765416    .1470831
         38  |   .0689563   .0187536     3.68   0.001     .0314305    .1064821
         39  |   .1440606   .0091828    15.69   0.000     .1256859    .1624354
         40  |   .1011323   .0216022     4.68   0.000     .0579064    .1443581
         41  |   .2970454   .0029265   101.50   0.000     .2911895    .3029013
         42  |   .1310272   .0167878     7.80   0.000     .0974349    .1646195
         43  |   .0844732   .0198565     4.25   0.000     .0447404     .124206
         44  |   .0828026   .0163513     5.06   0.000     .0500837    .1155214
         45  |   .0191633   .0308648     0.62   0.537    -.0425971    .0809236
         46  |   .0924379   .0145699     6.34   0.000     .0632835    .1215923
         47  |   .1200573     .02347     5.12   0.000     .0730939    .1670207
         48  |   .1481653   .0201033     7.37   0.000     .1079387    .1883919
         51  |    .147494   .0166936     8.84   0.000     .1140903    .1808978
         53  |   .0411965   .0169127     2.44   0.018     .0073543    .0750386
         54  |   .0968892   .0148988     6.50   0.000     .0670768    .1267016
         55  |   .1084417   .0211223     5.13   0.000     .0661761    .1507072
         56  |    .114577   .0199633     5.74   0.000     .0746305    .1545235
         58  |   .0666428   .0132051     5.05   0.000     .0402194    .0930662
         59  |   .0729061   .0186534     3.91   0.000     .0355808    .1102315
         60  |   .1156561   .0244812     4.72   0.000     .0666692     .164643
         61  |   .1390666   .0198423     7.01   0.000     .0993623     .178771
         62  |   .0976912   .0206176     4.74   0.000     .0564354     .138947
         64  |   .2587596   .0102358    25.28   0.000     .2382779    .2792414
         67  |   .0849211   .0188787     4.50   0.000      .047145    .1226972
         68  |   .1046231   .0148972     7.02   0.000     .0748139    .1344324
             |
  year_birth |
          4  |   .0505283   .0051905     9.73   0.000     .0401421    .0609145
          5  |   .1380979   .0092661    14.90   0.000     .1195566    .1566393
          6  |   .0911312   .0074683    12.20   0.000     .0761871    .1060753
          7  |   .1629263   .0100587    16.20   0.000     .1427989    .1830537
          8  |   .1826046   .0121255    15.06   0.000     .1583416    .2068676
          9  |   .1681201   .0134672    12.48   0.000     .1411723    .1950679
         10  |    .126381     .01582     7.99   0.000     .0947254    .1580367
         11  |   .1640255   .0170311     9.63   0.000     .1299464    .1981046
         12  |   .1765948   .0185967     9.50   0.000      .139383    .2138067
         13  |   .1671089   .0201171     8.31   0.000     .1268547    .2073632
         14  |   .2264194   .0207664    10.90   0.000      .184866    .2679728
         15  |   .2236225   .0217822    10.27   0.000     .1800365    .2672086
         16  |   .1954731   .0231411     8.45   0.000     .1491678    .2417784
         17  |   .2256361   .0236769     9.53   0.000     .1782586    .2730135
         18  |    .209194   .0246057     8.50   0.000     .1599582    .2584298
         19  |   .2209205   .0252059     8.76   0.000     .1704837    .2713574
         20  |   .2163817   .0258149     8.38   0.000     .1647262    .2680372
         21  |   .2177491   .0261592     8.32   0.000     .1654047    .2700935
         22  |    .225563   .0266841     8.45   0.000     .1721682    .2789577
         23  |   .2293438   .0268152     8.55   0.000     .1756866    .2830009
         24  |   .2406162   .0273414     8.80   0.000     .1859061    .2953263
         25  |   .2408472   .0273861     8.79   0.000     .1860478    .2956466
         26  |   .2383486   .0272563     8.74   0.000     .1838088    .2928883
         27  |   .2364522   .0273336     8.65   0.000     .1817579    .2911466
         28  |   .2344775    .027264     8.60   0.000     .1799223    .2890327
         29  |   .2280776   .0272644     8.37   0.000     .1735218    .2826334
         30  |   .2240896   .0272785     8.21   0.000     .1695054    .2786738
         31  |    .216349   .0271539     7.97   0.000     .1620141    .2706839
         32  |   .2080142   .0273638     7.60   0.000     .1532594     .262769
         33  |    .202565   .0275851     7.34   0.000     .1473674    .2577627
         34  |   .1927838   .0276524     6.97   0.000     .1374516     .248116
         35  |   .1916018   .0282102     6.79   0.000     .1351533    .2480504
         36  |   .1808404   .0285093     6.34   0.000     .1237934    .2378874
         37  |   .1706925   .0292346     5.84   0.000     .1121943    .2291907
         41  |  -.0958199   .0831935    -1.15   0.254    -.2622897      .07065
         42  |  -.0093858   .0346368    -0.27   0.787    -.0786939    .0599224
         43  |   -.017371   .0365754    -0.47   0.637    -.0905582    .0558162
         44  |   .0008165   .0348962     0.02   0.981    -.0690105    .0706435
         45  |   .0116261   .0339436     0.34   0.733     -.056295    .0795472
         46  |   .0334837   .0344355     0.97   0.335    -.0354217     .102389
         47  |   .0249515   .0346382     0.72   0.474    -.0443595    .0942624
         48  |   .0405038   .0341695     1.19   0.241    -.0278693    .1088769
         49  |   .0479499   .0340412     1.41   0.164    -.0201663    .1160661
         50  |   .0512056   .0334758     1.53   0.131    -.0157793    .1181905
         51  |   .0701635   .0346023     2.03   0.047     .0009245    .1394025
         52  |   .0714972   .0333164     2.15   0.036     .0048311    .1381633
         53  |   .0804525   .0344147     2.34   0.023      .011589    .1493161
         54  |   .0872755   .0329491     2.65   0.010     .0213444    .1532066
         55  |   .0905194   .0341369     2.65   0.010     .0222116    .1588273
         56  |   .0971149   .0343204     2.83   0.006     .0284399    .1657898
         57  |   .1001873   .0340937     2.94   0.005      .031966    .1684086
         58  |   .1034635   .0342556     3.02   0.004     .0349183    .1720087
         59  |    .106735   .0357199     2.99   0.004     .0352596    .1782104
         60  |   .1072964    .035167     3.05   0.003     .0369274    .1776655
         61  |   .1094358   .0347298     3.15   0.003     .0399417    .1789299
         62  |   .1068421   .0348799     3.06   0.003     .0370477    .1766365
         63  |   .1035857   .0337641     3.07   0.003     .0360239    .1711475
         64  |   .1043828   .0329304     3.17   0.002     .0384892    .1702764
         65  |   .1010325   .0324193     3.12   0.003     .0361615    .1659034
         66  |   .1025462   .0310004     3.31   0.002     .0405145     .164578
         67  |   .1002848    .030321     3.31   0.002     .0396126     .160957
         68  |   .0967115   .0284922     3.39   0.001     .0396987    .1537243
         69  |   .0931725   .0276276     3.37   0.001     .0378898    .1484551
         70  |   .0904357   .0271114     3.34   0.001     .0361859    .1446856
         71  |    .089504   .0258967     3.46   0.001     .0376849    .1413231
         72  |   .0902299   .0247792     3.64   0.001     .0406469    .1398129
         73  |   .0844878   .0236629     3.57   0.001     .0371385     .131837
         74  |   .0853969   .0225966     3.78   0.000     .0401811    .1306126
         75  |   .0802508   .0216826     3.70   0.000     .0368639    .1236376
         76  |   .0768329   .0209985     3.66   0.001     .0348149    .1188508
         77  |   .0766557   .0205004     3.74   0.000     .0356344    .1176769
         78  |   .0684716   .0196492     3.48   0.001     .0291537    .1077895
         79  |   .0673205   .0199097     3.38   0.001     .0274812    .1071598
         80  |   .0577299   .0201492     2.87   0.006     .0174114    .0980484
         81  |   .0533668   .0209549     2.55   0.014     .0114361    .0952975
         82  |   .0431281    .018281     2.36   0.022     .0065478    .0797084
         83  |   .0336476   .0193391     1.74   0.087    -.0050498     .072345
         84  |   .0335971   .0184643     1.82   0.074    -.0033499    .0705441
         85  |   .0157544   .0154038     1.02   0.311    -.0150685    .0465772
         86  |   .0645624   .0048911    13.20   0.000     .0547754    .0743494
       1942  |  -.1301987    .042062    -3.10   0.003    -.2143646   -.0460328
       1943  |  -.1247725   .0432461    -2.89   0.005    -.2113078   -.0382373
       1944  |  -.1141405   .0416417    -2.74   0.008    -.1974653   -.0308157
       1945  |  -.0750082    .040208    -1.87   0.067    -.1554643    .0054478
       1946  |  -.0508374   .0392392    -1.30   0.200    -.1293548    .0276801
       1947  |  -.0562674   .0393386    -1.43   0.158    -.1349836    .0224489
       1948  |  -.0341575    .038491    -0.89   0.378    -.1111779    .0428629
       1949  |  -.0176514   .0372086    -0.47   0.637    -.0921055    .0568027
       1950  |   .0192556   .0426854     0.45   0.654    -.0661577     .104669
       1951  |   .0048657   .0488232     0.10   0.921    -.0928294    .1025608
       1952  |   .0112206   .0427053     0.26   0.794    -.0742324    .0966737
       1953  |   .0227513   .0386939     0.59   0.559    -.0546751    .1001776
       1954  |   .0260381   .0354556     0.73   0.466    -.0449084    .0969846
       1955  |   .0434151   .0326104     1.33   0.188    -.0218382    .1086683
       1956  |   .0464664   .0314446     1.48   0.145     -.016454    .1093868
       1957  |   .0519875   .0314201     1.65   0.103     -.010884     .114859
       1958  |   .0625773    .031431     1.99   0.051     -.000316    .1254705
       1959  |   .0730462    .031785     2.30   0.025     .0094447    .1366478
       1960  |   .0731033   .0310615     2.35   0.022     .0109493    .1352573
       1961  |   .0888361   .0311539     2.85   0.006     .0264974    .1511748
       1962  |   .0923715   .0311408     2.97   0.004     .0300588    .1546841
       1963  |     .09827   .0301136     3.26   0.002     .0380127    .1585272
       1964  |    .104272   .0313335     3.33   0.002     .0415737    .1669702
       1965  |   .1096641   .0315624     3.47   0.001     .0465079    .1728204
       1966  |   .1074635   .0321289     3.34   0.001     .0431738    .1717533
       1967  |   .1149532   .0324963     3.54   0.001     .0499284    .1799781
       1968  |   .1115982   .0327195     3.41   0.001     .0461266    .1770699
       1969  |   .1095467   .0325975     3.36   0.001     .0443192    .1747743
       1970  |   .1135757   .0335355     3.39   0.001     .0464712    .1806802
       1971  |   .1131767   .0329002     3.44   0.001     .0473436    .1790098
       1972  |   .1113355   .0321869     3.46   0.001     .0469296    .1757413
       1973  |   .1103017    .031643     3.49   0.001     .0469843    .1736192
       1974  |   .1055664   .0315947     3.34   0.001     .0423455    .1687873
       1975  |   .1020851   .0310018     3.29   0.002     .0400505    .1641196
       1976  |    .100781   .0302145     3.34   0.001      .040322      .16124
       1977  |   .0983344   .0292284     3.36   0.001     .0398485    .1568203
       1978  |   .0995809    .028644     3.48   0.001     .0422644    .1568973
       1979  |   .0965161   .0275482     3.50   0.001     .0413923    .1516398
       1980  |   .0992168   .0263094     3.77   0.000     .0465717    .1518618
       1981  |   .0979244   .0256367     3.82   0.000     .0466256    .1492232
       1982  |   .0968448   .0244593     3.96   0.000     .0479019    .1457876
       1983  |   .0969139    .023196     4.18   0.000     .0504989     .143329
       1984  |   .0967095   .0228377     4.23   0.000     .0510113    .1424077
       1985  |   .0921781   .0214438     4.30   0.000     .0492691     .135087
       1986  |   .0951395   .0209685     4.54   0.000     .0531816    .1370974
       1987  |   .0875533   .0201236     4.35   0.000     .0472859    .1278206
       1988  |   .0929717    .019234     4.83   0.000     .0544846    .1314587
       1989  |   .0856676   .0194736     4.40   0.000      .046701    .1246341
       1990  |   .0871989   .0200256     4.35   0.000     .0471278      .12727
       1991  |   .0713976   .0212321     3.36   0.001     .0289123     .113883
       1992  |   .0710952    .022851     3.11   0.003     .0253704    .1168199
       1993  |   .0521093   .0273926     1.90   0.062    -.0027031    .1069218
       1994  |   .0500566   .0296156     1.69   0.096    -.0092041    .1093174
       1995  |   .0288045   .0228464     1.26   0.212    -.0169109      .07452
       1996  |          0  (omitted)
       2007  |  -.0182242    .005759    -3.16   0.002    -.0297479   -.0067005
       2008  |    .068503    .015769     4.34   0.000     .0369494    .1000567
       2009  |   .0907051   .0143583     6.32   0.000     .0619742    .1194361
       2010  |   .0816149   .0182534     4.47   0.000       .04509    .1181398
       2011  |   .1611914   .0149143    10.81   0.000      .131348    .1910348
       2012  |    .156737   .0144167    10.87   0.000     .1278894    .1855847
       2013  |   .1469919    .018469     7.96   0.000     .1100356    .1839482
       2014  |   .1426183   .0189398     7.53   0.000     .1047199    .1805167
       2015  |   .1706794   .0184211     9.27   0.000     .1338189    .2075399
       2016  |   .1779365   .0198355     8.97   0.000     .1382457    .2176274
       2017  |   .1975558   .0195216    10.12   0.000     .1584931    .2366184
       2018  |   .2165003   .0208465    10.39   0.000     .1747865    .2582141
       2019  |   .2230397   .0219501    10.16   0.000     .1791176    .2669618
       2020  |   .2075199   .0213321     9.73   0.000     .1648345    .2502052
       2021  |   .2216954   .0228417     9.71   0.000     .1759893    .2674016
       2022  |   .2407877   .0237634    10.13   0.000     .1932372    .2883382
       2023  |   .2330631   .0233163    10.00   0.000     .1864074    .2797189
       2024  |   .2419606   .0240299    10.07   0.000     .1938769    .2900443
       2025  |   .2518439   .0240144    10.49   0.000     .2037912    .2998966
       2026  |   .2453729   .0247235     9.92   0.000     .1959013    .2948444
       2027  |   .2550391   .0252273    10.11   0.000     .2045594    .3055189
       2028  |   .2556913   .0251222    10.18   0.000     .2054219    .3059606
       2029  |   .2682656   .0254899    10.52   0.000     .2172603    .3192709
       2030  |    .251354    .025598     9.82   0.000     .2001326    .3025753
       2031  |   .2463532   .0257479     9.57   0.000     .1948318    .2978745
       2032  |   .2552047   .0258446     9.87   0.000     .2034899    .3069196
       2033  |    .244383   .0261158     9.36   0.000     .1921253    .2966407
       2034  |   .2429649   .0262351     9.26   0.000     .1904686    .2954612
       2035  |   .2372197   .0262796     9.03   0.000     .1846344    .2898051
       2036  |   .2302995   .0265397     8.68   0.000     .1771938    .2834053
       2037  |   .2300128   .0266575     8.63   0.000     .1766714    .2833543
       2038  |   .2133161   .0267267     7.98   0.000     .1598361    .2667962
       2039  |    .220455    .026892     8.20   0.000     .1666444    .2742657
       2040  |   .2173583   .0270306     8.04   0.000     .1632703    .2714464
       2041  |   .2199831   .0271676     8.10   0.000     .1656208    .2743455
       2042  |   .2204447   .0272792     8.08   0.000     .1658592    .2750301
       2043  |     .21141   .0272167     7.77   0.000     .1569495    .2658705
       2044  |   .2110401   .0273679     7.71   0.000      .156277    .2658032
       2045  |   .2101893   .0272869     7.70   0.000     .1555884    .2647902
       2046  |   .2039902   .0274889     7.42   0.000     .1489851    .2589954
       2047  |    .204593   .0277183     7.38   0.000     .1491289    .2600571
       2048  |   .1880596   .0278323     6.76   0.000     .1323672    .2437519
       2049  |   .1794221   .0282018     6.36   0.000     .1229904    .2358537
       2050  |   .1593962   .0280505     5.68   0.000     .1032674    .2155251
       2051  |   .1554828   .0290382     5.35   0.000     .0973775    .2135881
       2052  |   .1599884   .0300396     5.33   0.000     .0998792    .2200976
             |
   educf_1_4 |   .0225397   .0054123     4.16   0.000     .0117097    .0333697
   educf_5_6 |   .0445278   .0057978     7.68   0.000     .0329264    .0561293
  educf_7_10 |   .0512688   .0067578     7.59   0.000     .0377465    .0647911
educf_11plus |   .0365121   .0099231     3.68   0.001      .016656    .0563683
       poor1 |  -.0320128   .0028985   -11.04   0.000    -.0378126    -.026213
       _cons |  -.1242032   .0494528    -2.51   0.015     -.223158   -.0252484
------------------------------------------------------------------------------

. outreg2 fert using "~/olsattend.tex", tex(pr) append
~/olsattend.tex
dir : seeout

. reg highschool fert `basecontrols' `morecontrols', cluster(_cou) 
note: 1996.year_birth omitted because of collinearity

Linear regression                                      Number of obs = 1964879
                                                       F( 59,    59) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4615
                                                       Root MSE      =  .22871

                                  (Std. Err. adjusted for 60 clusters in _cou)
------------------------------------------------------------------------------
             |               Robust
  highschool |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        fert |  -.0165934   .0022754    -7.29   0.000    -.0211466   -.0120402
       malec |  -.0043854   .0027212    -1.61   0.112    -.0098304    .0010596
         age |  -.0330896   .0016418   -20.15   0.000    -.0363748   -.0298043
       agesq |   .0038518   .0002886    13.35   0.000     .0032744    .0044292
      agemay |  -.0074769   .0046077    -1.62   0.110    -.0166969    .0017431
    m_age_sq |   .0001926   .0000741     2.60   0.012     .0000443    .0003409
             |
        _cou |
          2  |   .2446018   .0066696    36.67   0.000     .2312559    .2579476
          3  |   .3389081   .0033034   102.59   0.000     .3322979    .3455182
          4  |   .1878673   .0164803    11.40   0.000     .1548904    .2208443
          5  |   .1260304   .0209062     6.03   0.000     .0841972    .1678636
          6  |   .1056638   .0158739     6.66   0.000     .0739002    .1374274
          7  |   .1176001   .0209429     5.62   0.000     .0756935    .1595067
          8  |    .103739   .0208624     4.97   0.000     .0619935    .1454846
          9  |   .0794258   .0192497     4.13   0.000     .0409072    .1179443
         10  |   .1227152   .0238055     5.15   0.000     .0750806    .1703498
         11  |    .084849   .0133613     6.35   0.000     .0581132    .1115848
         12  |   .1219217   .0199265     6.12   0.000     .0820489    .1617945
         13  |   .1187074   .0222712     5.33   0.000     .0741429    .1632719
         14  |   .1854112   .0102926    18.01   0.000     .1648158    .2060067
         15  |   .1195615   .0245128     4.88   0.000     .0705114    .1686115
         16  |   .1020039   .0153554     6.64   0.000     .0712778      .13273
         17  |   .1138247   .0184781     6.16   0.000     .0768501    .1507993
         18  |   .1242625   .0228043     5.45   0.000     .0786312    .1698938
         19  |   .0675652    .016774     4.03   0.000     .0340005    .1011299
         20  |   .2065084   .0147897    13.96   0.000     .1769144    .2361025
         21  |   .1149484   .0235662     4.88   0.000     .0677925    .1621044
         22  |   .1214708   .0223782     5.43   0.000      .076692    .1662496
         23  |   .1164601   .0182753     6.37   0.000     .0798912     .153029
         24  |   .1079134   .0230003     4.69   0.000     .0618899    .1539369
         25  |   .1082757    .022041     4.91   0.000     .0641719    .1523796
         26  |   .2114679   .0108461    19.50   0.000     .1897649    .2331709
         27  |   .0807916    .018943     4.26   0.000     .0428868    .1186964
         28  |   .0866044   .0143899     6.02   0.000     .0578102    .1153986
         29  |   .2119991   .0131263    16.15   0.000     .1857334    .2382648
         31  |   .2181002   .0145634    14.98   0.000     .1889589    .2472416
         32  |    .248972   .0085554    29.10   0.000     .2318526    .2660914
         33  |   .0750728   .0184675     4.07   0.000     .0381194    .1120262
         34  |   .2238854   .0105679    21.19   0.000     .2027391    .2450318
         35  |   .0291318   .0108774     2.68   0.010     .0073662    .0508974
         36  |   .0862387    .019359     4.45   0.000     .0475014     .124976
         37  |   .1242522   .0176951     7.02   0.000     .0888444      .15966
         38  |   .0749525   .0187237     4.00   0.000     .0374865    .1124186
         39  |   .1435858   .0096009    14.96   0.000     .1243746    .1627971
         40  |   .1034005   .0212953     4.86   0.000     .0607888    .1460122
         41  |   .2941589   .0028985   101.48   0.000     .2883589    .2999589
         42  |   .1248225   .0169451     7.37   0.000     .0909155    .1587295
         43  |   .0891234   .0198856     4.48   0.000     .0493324    .1289143
         44  |    .084076   .0162722     5.17   0.000     .0515154    .1166365
         45  |    .045879    .031986     1.43   0.157    -.0181249    .1098828
         46  |   .0876402   .0149497     5.86   0.000      .057726    .1175544
         47  |   .1223498   .0232383     5.27   0.000       .07585    .1688496
         48  |   .1518728   .0200012     7.59   0.000     .1118506    .1918951
         51  |   .1451961   .0172097     8.44   0.000     .1107595    .1796327
         53  |   .0478053   .0168151     2.84   0.006     .0141584    .0814523
         54  |    .094189   .0149315     6.31   0.000     .0643111    .1240669
         55  |   .1085979   .0208314     5.21   0.000     .0669144    .1502815
         56  |   .1145744    .020057     5.71   0.000     .0744405    .1547083
         58  |   .0550957   .0136593     4.03   0.000     .0277635    .0824279
         59  |   .0791006   .0186467     4.24   0.000     .0417886    .1164126
         60  |   .1199361   .0244022     4.91   0.000     .0711075    .1687648
         61  |   .1276346   .0201414     6.34   0.000     .0873318    .1679374
         62  |   .1031202   .0204719     5.04   0.000      .062156    .1440845
         64  |   .2620711   .0102537    25.56   0.000     .2415535    .2825887
         67  |   .0910679   .0187874     4.85   0.000     .0534743    .1286615
         68  |   .1065735   .0148615     7.17   0.000     .0768357    .1363113
             |
  year_birth |
          4  |   .0479484   .0052199     9.19   0.000     .0375034    .0583934
          5  |   .1305317    .008772    14.88   0.000     .1129789    .1480845
          6  |   .0884625   .0074546    11.87   0.000     .0735459    .1033791
          7  |   .1563409   .0101554    15.39   0.000       .13602    .1766618
          8  |   .1716376   .0122277    14.04   0.000       .14717    .1961053
          9  |   .1592041   .0134978    11.79   0.000     .1321951    .1862131
         10  |   .1173469   .0157332     7.46   0.000     .0858647     .148829
         11  |   .1561368    .017093     9.13   0.000     .1219339    .1903398
         12  |   .1689293   .0185346     9.11   0.000     .1318416     .206017
         13  |   .1574121   .0200699     7.84   0.000     .1172524    .1975718
         14  |   .2184727   .0207528    10.53   0.000     .1769464     .259999
         15  |   .2159637   .0217107     9.95   0.000     .1725206    .2594067
         16  |   .1852423   .0231947     7.99   0.000     .1388298    .2316547
         17  |   .2169501   .0236737     9.16   0.000     .1695791     .264321
         18  |   .1993603   .0246679     8.08   0.000     .1499999    .2487206
         19  |   .2126814   .0252141     8.44   0.000      .162228    .2631347
         20  |   .2047055   .0259436     7.89   0.000     .1527925    .2566184
         21  |    .205413   .0263334     7.80   0.000       .15272    .2581061
         22  |    .213619   .0268834     7.95   0.000     .1598255    .2674125
         23  |   .2180202   .0269921     8.08   0.000     .1640091    .2720313
         24  |   .2267256   .0276617     8.20   0.000     .1713746    .2820765
         25  |   .2270431   .0276991     8.20   0.000     .1716173    .2824689
         26  |   .2242254   .0275865     8.13   0.000     .1690249    .2794258
         27  |   .2225504   .0276556     8.05   0.000     .1672117    .2778891
         28  |   .2191907   .0276546     7.93   0.000      .163854    .2745274
         29  |   .2112657   .0277356     7.62   0.000     .1557669    .2667645
         30  |   .2082803   .0277097     7.52   0.000     .1528334    .2637272
         31  |   .2010141   .0275535     7.30   0.000     .1458797    .2561486
         32  |   .1919979   .0278091     6.90   0.000     .1363521    .2476438
         33  |   .1867048   .0279968     6.67   0.000     .1306834    .2427262
         34  |   .1757451   .0280681     6.26   0.000     .1195809    .2319092
         35  |   .1722057    .028733     5.99   0.000      .114711    .2297004
         36  |   .1628871   .0288195     5.65   0.000     .1052194    .2205548
         37  |   .1515094   .0296365     5.11   0.000     .0922068    .2108119
         41  |  -.0701337    .074913    -0.94   0.353    -.2200344    .0797669
         42  |   .0024722   .0354644     0.07   0.945     -.068492    .0734363
         43  |  -.0104403   .0367149    -0.28   0.777    -.0839067    .0630261
         44  |   .0074445   .0348541     0.21   0.832    -.0622984    .0771874
         45  |   .0192215   .0336875     0.57   0.570     -.048187    .0866299
         46  |   .0397762   .0342547     1.16   0.250    -.0287674    .1083198
         47  |   .0314265   .0341082     0.92   0.361    -.0368239    .0996769
         48  |   .0458743   .0338889     1.35   0.181    -.0219372    .1136858
         49  |   .0547358   .0336256     1.63   0.109    -.0125489    .1220204
         50  |   .0575235   .0330302     1.74   0.087    -.0085698    .1236168
         51  |   .0758648   .0340768     2.23   0.030     .0076773    .1440522
         52  |   .0770405    .032769     2.35   0.022     .0114699     .142611
         53  |    .085614   .0338253     2.53   0.014     .0179298    .1532982
         54  |   .0914027   .0322029     2.84   0.006     .0269648    .1558407
         55  |   .0956919    .033215     2.88   0.006     .0292288     .162155
         56  |   .1022036   .0335263     3.05   0.003     .0351176    .1692895
         57  |    .105377   .0332105     3.17   0.002     .0389231     .171831
         58  |   .1084016   .0331062     3.27   0.002     .0421563    .1746469
         59  |   .1114446   .0347672     3.21   0.002     .0418755    .1810136
         60  |   .1123855   .0340682     3.30   0.002     .0442152    .1805558
         61  |   .1139963   .0336152     3.39   0.001     .0467323    .1812602
         62  |   .1106041   .0337161     3.28   0.002     .0431383      .17807
         63  |   .1078318   .0326108     3.31   0.002     .0425777    .1730859
         64  |   .1086041   .0316837     3.43   0.001     .0452052     .172003
         65  |   .1050707    .030995     3.39   0.001     .0430499    .1670914
         66  |   .1061683   .0297305     3.57   0.001     .0466778    .1656588
         67  |   .1040048   .0289321     3.59   0.001     .0461118    .1618979
         68  |   .1003473   .0271258     3.70   0.000     .0460687    .1546259
         69  |   .0965575   .0263138     3.67   0.001     .0439037    .1492113
         70  |   .0937127   .0257968     3.63   0.001     .0420935     .145332
         71  |   .0924849   .0247145     3.74   0.000     .0430314    .1419384
         72  |   .0929336   .0236205     3.93   0.000      .045669    .1401982
         73  |   .0868301   .0225865     3.84   0.000     .0416346    .1320255
         74  |   .0874264   .0215508     4.06   0.000     .0443033    .1305495
         75  |   .0819994   .0206755     3.97   0.000     .0406279    .1233709
         76  |   .0786358   .0201377     3.90   0.000     .0383403    .1189312
         77  |   .0780775   .0197851     3.95   0.000     .0384876    .1176675
         78  |   .0690511   .0189822     3.64   0.001     .0310678    .1070343
         79  |   .0674754   .0194191     3.47   0.001     .0286179     .106333
         80  |   .0579182   .0199298     2.91   0.005     .0180388    .0977977
         81  |   .0532917   .0208465     2.56   0.013     .0115779    .0950055
         82  |   .0425039   .0181586     2.34   0.023     .0061687    .0788392
         83  |   .0324645   .0199921     1.62   0.110    -.0075397    .0724686
         84  |   .0326904   .0187069     1.75   0.086    -.0047419    .0701228
         85  |   .0150434    .016275     0.92   0.359    -.0175228    .0476096
         86  |   .0665073   .0049344    13.48   0.000     .0566335     .076381
       1942  |  -.1144017   .0423608    -2.70   0.009    -.1991654    -.029638
       1943  |  -.1145833   .0432298    -2.65   0.010    -.2010859   -.0280807
       1944  |  -.1025968   .0416553    -2.46   0.017    -.1859488   -.0192448
       1945  |  -.0635853   .0401642    -1.58   0.119    -.1439536     .016783
       1946  |  -.0416249   .0390388    -1.07   0.291    -.1197413    .0364915
       1947  |  -.0469672   .0390865    -1.20   0.234    -.1251792    .0312448
       1948  |  -.0260091   .0381728    -0.68   0.498    -.1023927    .0503746
       1949  |   -.010745   .0368023    -0.29   0.771    -.0843862    .0628962
       1950  |   .0190806   .0416112     0.46   0.648    -.0641832    .1023443
       1951  |   .0087646   .0478574     0.18   0.855    -.0869978     .104527
       1952  |   .0148341   .0422815     0.35   0.727     -.069771    .0994393
       1953  |   .0255334     .03871     0.66   0.512    -.0519251    .1029919
       1954  |   .0292969   .0353305     0.83   0.410    -.0413994    .0999932
       1955  |    .046718   .0322462     1.45   0.153    -.0178065    .1112425
       1956  |   .0494867   .0311115     1.59   0.117    -.0127672    .1117406
       1957  |   .0540255   .0310503     1.74   0.087     -.008106    .1161569
       1958  |   .0648971   .0310228     2.09   0.041     .0028206    .1269736
       1959  |   .0750697   .0311709     2.41   0.019     .0126969    .1374424
       1960  |   .0755309   .0304331     2.48   0.016     .0146344    .1364275
       1961  |   .0910884   .0304291     2.99   0.004     .0301999    .1519769
       1962  |   .0943882   .0303373     3.11   0.003     .0336833     .155093
       1963  |   .1004137   .0293627     3.42   0.001      .041659    .1591684
       1964  |   .1057921   .0304832     3.47   0.001     .0447952    .1667889
       1965  |   .1119432   .0306628     3.65   0.001      .050587    .1732993
       1966  |    .109092   .0312309     3.49   0.001     .0465992    .1715848
       1967  |   .1163674   .0315874     3.68   0.001     .0531611    .1795737
       1968  |   .1133284   .0317349     3.57   0.001      .049827    .1768298
       1969  |   .1109745    .031589     3.51   0.001     .0477651     .174184
       1970  |   .1149642   .0325277     3.53   0.001     .0498764    .1800521
       1971  |   .1145191   .0318035     3.60   0.001     .0508805    .1781577
       1972  |   .1126888   .0310031     3.63   0.001     .0506519    .1747258
       1973  |   .1116185   .0303944     3.67   0.001     .0507995    .1724375
       1974  |   .1064755   .0303066     3.51   0.001     .0458322    .1671187
       1975  |   .1033226   .0296324     3.49   0.001     .0440284    .1626168
       1976  |   .1015285   .0288922     3.51   0.001     .0437154    .1593417
       1977  |    .098743   .0278811     3.54   0.001     .0429531    .1545328
       1978  |   .1002179   .0273265     3.67   0.001     .0455376    .1548981
       1979  |   .0969995   .0261869     3.70   0.000     .0445996    .1493995
       1980  |   .0994094   .0250673     3.97   0.000     .0492499    .1495689
       1981  |   .0979318   .0244569     4.00   0.000     .0489937      .14687
       1982  |   .0971308    .023344     4.16   0.000     .0504196    .1438419
       1983  |   .0972891   .0221037     4.40   0.000     .0530597    .1415185
       1984  |   .0969147   .0217667     4.45   0.000     .0533596    .1404697
       1985  |   .0920046    .020495     4.49   0.000     .0509941     .133015
       1986  |   .0949694   .0200693     4.73   0.000     .0548109     .135128
       1987  |   .0874247   .0193258     4.52   0.000     .0487539    .1260956
       1988  |   .0924223   .0185468     4.98   0.000     .0553101    .1295344
       1989  |    .085322   .0187876     4.54   0.000     .0477282    .1229159
       1990  |   .0865751   .0193656     4.47   0.000     .0478246    .1253256
       1991  |   .0705826   .0208113     3.39   0.001     .0289392    .1122259
       1992  |   .0703995   .0224675     3.13   0.003      .025442    .1153569
       1993  |   .0525275   .0265339     1.98   0.052    -.0005668    .1056218
       1994  |   .0489073   .0289976     1.69   0.097    -.0091168    .1069314
       1995  |   .0285389    .022076     1.29   0.201    -.0156351    .0727129
       1996  |          0  (omitted)
       2007  |  -.0230821   .0055942    -4.13   0.000    -.0342761   -.0118881
       2008  |   .0635962   .0156313     4.07   0.000      .032318    .0948743
       2009  |   .0844032   .0141096     5.98   0.000       .05617    .1126364
       2010  |   .0765832   .0178575     4.29   0.000     .0408503     .112316
       2011  |   .1566213    .014564    10.75   0.000     .1274789    .1857637
       2012  |   .1510132   .0140061    10.78   0.000     .1229871    .1790393
       2013  |   .1408584   .0180514     7.80   0.000     .1047377    .1769791
       2014  |   .1358689   .0185443     7.33   0.000     .0987618     .172976
       2015  |   .1630999   .0179747     9.07   0.000     .1271325    .1990673
       2016  |    .169821   .0193775     8.76   0.000     .1310467    .2085953
       2017  |   .1893583   .0190954     9.92   0.000     .1511486    .2275681
       2018  |   .2071802   .0204037    10.15   0.000     .1663525    .2480079
       2019  |   .2149226   .0215002    10.00   0.000     .1719009    .2579443
       2020  |   .1982539   .0209332     9.47   0.000     .1563667    .2401412
       2021  |   .2128111   .0224522     9.48   0.000     .1678843    .2577379
       2022  |    .230522   .0233666     9.87   0.000     .1837655    .2772785
       2023  |   .2231476   .0230164     9.70   0.000     .1770918    .2692033
       2024  |   .2305364   .0237833     9.69   0.000     .1829462    .2781267
       2025  |   .2401469   .0238593    10.07   0.000     .1924046    .2878892
       2026  |   .2334494   .0245739     9.50   0.000     .1842771    .2826217
       2027  |   .2426856   .0251149     9.66   0.000     .1924307    .2929405
       2028  |   .2429521   .0250601     9.69   0.000     .1928069    .2930972
       2029  |   .2553239   .0255049    10.01   0.000     .2042886    .3063592
       2030  |   .2376085   .0256902     9.25   0.000     .1862025    .2890144
       2031  |   .2331532   .0259165     9.00   0.000     .1812944     .285012
       2032  |    .240255   .0260742     9.21   0.000     .1880806    .2924294
       2033  |   .2295864   .0263843     8.70   0.000     .1767915    .2823814
       2034  |   .2277688   .0265473     8.58   0.000     .1746479    .2808898
       2035  |   .2218639   .0266321     8.33   0.000     .1685732    .2751546
       2036  |   .2149223   .0269241     7.98   0.000     .1610473    .2687973
       2037  |   .2137844   .0270952     7.89   0.000      .159567    .2680017
       2038  |   .1970763   .0271874     7.25   0.000     .1426744    .2514782
       2039  |   .2042616   .0273802     7.46   0.000      .149474    .2590493
       2040  |    .200322   .0275558     7.27   0.000      .145183     .255461
       2041  |   .2026337   .0277226     7.31   0.000     .1471609    .2581065
       2042  |   .2028515   .0278519     7.28   0.000     .1471199    .2585831
       2043  |   .1938181    .027785     6.98   0.000     .1382204    .2494157
       2044  |   .1937064   .0279456     6.93   0.000     .1377873    .2496255
       2045  |   .1919828   .0278696     6.89   0.000     .1362158    .2477497
       2046  |   .1858333   .0280863     6.62   0.000     .1296327    .2420339
       2047  |   .1849892    .028399     6.51   0.000     .1281629    .2418155
       2048  |   .1705512   .0284194     6.00   0.000     .1136841    .2274183
       2049  |   .1616594   .0287824     5.62   0.000      .104066    .2192528
       2050  |   .1428662   .0284321     5.02   0.000     .0859736    .1997587
       2051  |   .1356046   .0297483     4.56   0.000     .0760784    .1951308
       2052  |   .1524649   .0301797     5.05   0.000     .0920755    .2128543
             |
      height |   .0000311   .0000105     2.97   0.004     .0000101     .000052
         bmi |   .0036382     .00037     9.83   0.000     .0028977    .0043786
   educf_1_4 |   .0195855   .0053804     3.64   0.001     .0088194    .0303516
   educf_5_6 |   .0396886    .005656     7.02   0.000     .0283711    .0510062
  educf_7_10 |   .0447277   .0064203     6.97   0.000     .0318808    .0575746
educf_11plus |   .0291114   .0096959     3.00   0.004       .00971    .0485128
       poor1 |  -.0278822   .0031108    -8.96   0.000    -.0341069   -.0216575
       _cons |  -.2348686   .0474005    -4.95   0.000    -.3297168   -.1400204
------------------------------------------------------------------------------

. outreg2 fert using "~/olsattend.tex", tex(pr) append
~/olsattend.tex
dir : seeout

. 
end of do-file

