-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Log/Twins_DHS.txt
  log type:  text
 opened on:  19 Mar 2014, 18:37:04

. ********************************************************************************
. *** (2) Take necessary variables from BR (mother births) and PR (household me-
. *** mber) The IR dataset has the majority of family and maternal characterist-
. *** ics used in the regressions, however there is no child education variables
. *** in this dataset.  The child education information comes from PR.
. ********************************************************************************
. ***Do in parts as merge of full dataset is impossible with 8gb of RAM
. foreach num of numlist 1(1)7 {
  2.         use $DATA/World_BR_p`num', clear
  3. 
.         keep _cou _year caseid v000-v026 v101 v106 v107 v130 v131 v133 v136 v137 /*
>         */ v149 v150 v151 v152 v190 v191 v201 v202 v203 v204 v205 v206 v207 v208 /*
>         */ v209 v211 v212 v213 v228 v229 v230 v437 v438 v445 v457 v463a v481 v501/*
>         */ v504 v602 v605 v715 v701 v730 bord b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11/*
>         */ b12 b13 b14 b15 b16 v613 v614 m19 m19a v367 v312 v364 m4 m5 m8 m9 m10 /*
>         */ m12 m14 m15 m16 m17 m18 m19 m19a
  4.         
.         cap rename v010 year_birth
  5.         cap rename v012 agemay
  6.         cap rename v106 educlevel_f
  7.         cap rename v130 religion
  8.         cap rename v133 educf
  9.         cap rename v137 kids_under5
 10.         cap rename v140 rural
 11.         cap rename v190 wealth
 12.         cap rename v201 fert
 13.         cap rename v212 agefirstbirth
 14.         cap rename v228 terminated_preg
 15.         cap rename v437 weightk
 16.         cap rename v438 height
 17.         cap rename v445 bmi
 18.         cap rename v367 wanted_last_child
 19.         cap rename v312 contracep_method
 20.         cap rename v364 contracep_intent
 21.         cap rename b0 twin
 22.         cap rename b2 child_yob
 23.         cap rename b3 child_dob
 24.         cap rename b4 sex
 25.         cap rename b5 child_alive
 26.         cap rename b8 age 
 27.         cap rename b11 birthspacing
 28.         cap rename v715 educp
 29.         cap rename v701 educp_level
 30.         
.         replace age=floor(v007-child_yob+(v006-b1/12)) if age==.
 31. 
. 
.         **The following lines correct for the fact that we only observe each births'
.         **mothers' relationship to the household head.  In this way, if the mother 
.         **is the wife, the birth must be the child of the household head.
.         gen relationship=3 if v150==1|v150==2|v150==9
 32.         replace relationship=5 if v150==3|v150==4|v150==11
 33.         replace relationship=8 if v150==6|v150==7
 34.         replace relationship=10 if v150==8|v150==10|v150==12|v150==5
 35. 
.         egen id=concat(_cou _year v001 v002)
 36. 
.         save $TEMP/BR`num', replace
 37. }
(139917 real changes made)
(162393 missing values generated)
(74778 real changes made)
(10361 real changes made)
(29814 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR1.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR1.dta saved
(123698 real changes made)
(239965 missing values generated)
(96398 real changes made)
(7596 real changes made)
(47175 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR2.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR2.dta saved
(96080 real changes made)
(174447 missing values generated)
(131355 real changes made)
(12565 real changes made)
(26450 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR3.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR3.dta saved
(176905 real changes made)
(293330 missing values generated)
(103013 real changes made)
(8266 real changes made)
(36792 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR4.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR4.dta saved
(161145 real changes made)
(185507 missing values generated)
(81325 real changes made)
(6349 real changes made)
(36191 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR5.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR5.dta saved
(117864 real changes made)
(227575 missing values generated)
(81341 real changes made)
(3564 real changes made)
(42377 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR6.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR6.dta saved
(58299 real changes made)
(107017 missing values generated)
(36005 real changes made)
(2200 real changes made)
(15511 real changes made)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/BR7.dta not found)
file ~/investigacion/Activa/Twins/Temp/BR7.dta saved

. 
. 
. foreach num of numlist 1(1)7 {
  2.         use $DATA/World_PR_p`num', clear
  3. 
.         keep _cou _year hhid hvidx hv000-hv002 hv101 hv104 hv105 hv106 hv121 hv122/*
>         */ hv123 hv129 hv108
  4. 
.         cap rename hv101 relationship
  5.         cap rename hv104 sex
  6.         cap rename hv105 age
  7.         cap rename hv106 educlevel
  8.         cap rename hv121 attend_year
  9.         cap rename hv129 attend
 10.         cap rename hv108 educ
 11.         rename hv001 v001
 12.         rename hv002 v002
 13.         egen id=concat(_cou _year v001 v002)
 14.         
.         save $TEMP/PR`num', replace
 15. }
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR1.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR1.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR2.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR2.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR3.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR3.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR4.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR4.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR5.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR5.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR6.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR6.dta saved
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/PR7.dta not found)
file ~/investigacion/Activa/Twins/Temp/PR7.dta saved

. 
. ***Merge PR and BR (still in parts)
. foreach num of numlist 1(1)7 {
  2.         use $TEMP/PR`num'
  3.         merge m:m id relationship sex age using $TEMP/BR`num'
  4.         keep if _merge==3|_merge==2 //updated Apr 24, 2013
  5.         save $TEMP/twins`num', replace
  6. }
relationship was byte now float
(label LABG already defined)
(label LABH already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,425,676
        from master                 1,038,805  (_merge==1)
        from using                    386,871  (_merge==2)

    matched                           584,446  (_merge==3)
    -----------------------------------------
(1038805 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins1.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins1.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,767,456
        from master                 1,299,127  (_merge==1)
        from using                    468,329  (_merge==2)

    matched                           650,772  (_merge==3)
    -----------------------------------------
(1299127 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins2.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins2.dta saved
relationship was byte now float
(label LABD already defined)
(label LABE already defined)
(label LABI already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,392,865
        from master                 1,080,109  (_merge==1)
        from using                    312,756  (_merge==2)

    matched                           494,830  (_merge==3)
    -----------------------------------------
(1080109 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins3.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins3.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,303,006
        from master                 1,715,142  (_merge==1)
        from using                    587,864  (_merge==2)

    matched                           936,252  (_merge==3)
    -----------------------------------------
(1715142 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins4.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins4.dta saved
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     2,138,357
        from master                 1,690,776  (_merge==1)
        from using                    447,581  (_merge==2)

    matched                           523,421  (_merge==3)
    -----------------------------------------
(1690776 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins5.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins5.dta saved
v001 was int now long
relationship was byte now float

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,445,130
        from master                 1,034,332  (_merge==1)
        from using                    410,798  (_merge==2)

    matched                           490,957  (_merge==3)
    -----------------------------------------
(1034332 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins6.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins6.dta saved
_cou was str10 now str19
relationship was byte now float
id was str20 now str29

    Result                           # of obs.
    -----------------------------------------
    not matched                       787,409
        from master                   572,819  (_merge==1)
        from using                    214,590  (_merge==2)

    matched                           243,281  (_merge==3)
    -----------------------------------------
(572819 observations deleted)
(note: file /home/damiancclarke/investigacion/Activa/Twins/Temp/twins7.dta not found)
file ~/investigacion/Activa/Twins/Temp/twins7.dta saved

. 
. // Remove partial PR/BR datasets
. foreach t in PR BR {
  2.         foreach file in `t'1 `t'2 `t'3 `t'4 `t'5 `t'6 `t'7 {
  3.                 rm "$TEMP/`file'.dta"
  4.         }
  5. }

. 
. use $TEMP/twins1

. append using $TEMP/twins2 $TEMP/twins3 $TEMP/twins4 $TEMP/twins5 $TEMP/twins6 /*
> */ $TEMP/twins7
_cou was str12 now str25
id was str22 now str35
v003 was byte now int
(label _merge already defined)
(label v190 already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b16 already defined)
(label b13 already defined)
(label b9 already defined)
(label b6 already defined)
(label b0 already defined)
(label v730 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label LABN already defined)
(label v213 already defined)
(label v152 already defined)
(label v150 already defined)
(label v149 already defined)
(label v130 already defined)
(label v106 already defined)
(label LABE already defined)
(label LABD already defined)
(label v023 already defined)
(label v020 already defined)
(label LABC already defined)
(label v015 already defined)
(label LABB already defined)
(label v013 already defined)
(label b14 already defined)
(label m16 already defined)
(label hv108 already defined)
(label hv106 already defined)
(label hv105 already defined)
(label hv104 already defined)
(label hv101 already defined)
(label hv129 already defined)
(label hv121 already defined)
(label _merge already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b16 already defined)
(label b13 already defined)
(label b9 already defined)
(label b6 already defined)
(label b0 already defined)
(label v730 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label LABO already defined)
(label LABN already defined)
(label v213 already defined)
(label LABM already defined)
(label v190 already defined)
(label LABK already defined)
(label v152 already defined)
(label v150 already defined)
(label v149 already defined)
(label v133 already defined)
(label LABH already defined)
(label v106 already defined)
(label LABF already defined)
(label v020 already defined)
(label LABC already defined)
(label v015 already defined)
(label LABB already defined)
(label v013 already defined)
(label m16 already defined)
(label LABI already defined)
(label hv108 already defined)
(label hv106 already defined)
(label hv101 already defined)
(label LABE already defined)
(label LABD already defined)
(label hv129 already defined)
(label hv121 already defined)
(label _merge already defined)
(label v190 already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b16 already defined)
(label b13 already defined)
(label b9 already defined)
(label b6 already defined)
(label b0 already defined)
(label v730 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label v213 already defined)
(label v152 already defined)
(label v150 already defined)
(label v149 already defined)
(label v133 already defined)
(label v131 already defined)
(label v130 already defined)
(label v106 already defined)
(label v101 already defined)
(label v023 already defined)
(label v020 already defined)
(label v015 already defined)
(label v013 already defined)
(label b14 already defined)
(label v481 already defined)
(label m16 already defined)
(label m12 already defined)
(label hv129 already defined)
(label hv122 already defined)
(label hv121 already defined)
(label hv108 already defined)
(label hv106 already defined)
(label hv105 already defined)
(label hv104 already defined)
(label hv101 already defined)
(label hv123 already defined)
(label _merge already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m17 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m9 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b15 already defined)
(label b14 already defined)
(label b13 already defined)
(label b10 already defined)
(label b9 already defined)
(label b6 already defined)
(label b5 already defined)
(label b0 already defined)
(label v730 already defined)
(label v715 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label v230 already defined)
(label v229 already defined)
(label v228 already defined)
(label v213 already defined)
(label v151 already defined)
(label v150 already defined)
(label v149 already defined)
(label v133 already defined)
(label v131 already defined)
(label v130 already defined)
(label v106 already defined)
(label v101 already defined)
(label v025 already defined)
(label v024 already defined)
(label v023 already defined)
(label v020 already defined)
(label v019 already defined)
(label v018 already defined)
(label v015 already defined)
(label v014 already defined)
(label v013 already defined)
(label b16 already defined)
(label v190 already defined)
(label LABH already defined)
(label m16 already defined)
(label m12 already defined)
(label hv108 already defined)
(label hv106 already defined)
(label hv105 already defined)
(label hv104 already defined)
(label hv101 already defined)
(label hv129 already defined)
(label hv123 already defined)
(label hv122 already defined)
(label hv121 already defined)
(label _merge already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m17 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m9 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b16 already defined)
(label b15 already defined)
(label b13 already defined)
(label b10 already defined)
(label b9 already defined)
(label b6 already defined)
(label b5 already defined)
(label b0 already defined)
(label v730 already defined)
(label v715 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label v481 already defined)
(label v463a already defined)
(label v457 already defined)
(label v445 already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label v230 already defined)
(label v229 already defined)
(label v228 already defined)
(label v213 already defined)
(label v190 already defined)
(label v152 already defined)
(label v151 already defined)
(label v150 already defined)
(label v149 already defined)
(label v133 already defined)
(label v130 already defined)
(label v106 already defined)
(label v101 already defined)
(label v026 already defined)
(label v025 already defined)
(label v024 already defined)
(label v023 already defined)
(label v020 already defined)
(label v019 already defined)
(label v018 already defined)
(label v015 already defined)
(label v014 already defined)
(label v013 already defined)
(label m16 already defined)
(label m12 already defined)
(label hv129 already defined)
(label hv121 already defined)
(label LABI already defined)
(label LABH already defined)
(label hv101 already defined)
(label LABF already defined)
(label LABD already defined)
(label LABC already defined)
(label _merge already defined)
(label m19a already defined)
(label m19 already defined)
(label m18 already defined)
(label m15 already defined)
(label m14 already defined)
(label m10 already defined)
(label m8 already defined)
(label m5 already defined)
(label m4 already defined)
(label b16 already defined)
(label b13 already defined)
(label b9 already defined)
(label b6 already defined)
(label b0 already defined)
(label v730 already defined)
(label v701 already defined)
(label v614 already defined)
(label v613 already defined)
(label v605 already defined)
(label v602 already defined)
(label v504 already defined)
(label v501 already defined)
(label LABZ already defined)
(label v367 already defined)
(label v364 already defined)
(label v312 already defined)
(label LABO already defined)
(label LABM already defined)
(label LABL already defined)
(label v213 already defined)
(label v190 already defined)
(label LABJ already defined)
(label v152 already defined)
(label LABI already defined)
(label v150 already defined)
(label v149 already defined)
(label v133 already defined)
(label v130 already defined)
(label v106 already defined)
(label LABF already defined)
(label LABE already defined)
(label LABD already defined)
(label v023 already defined)
(label v020 already defined)
(label LABC already defined)
(label v015 already defined)
(label LABB already defined)
(label v013 already defined)
(label v007 already defined)
(label m16 already defined)
(label m12 already defined)
(label hv129 already defined)
(label hv123 already defined)
(label hv122 already defined)
(label hv121 already defined)
(label hv108 already defined)
(label hv106 already defined)
(label hv105 already defined)
(label hv104 already defined)
(label hv101 already defined)

. 
. foreach num of numlist 1(1)7 {
  2.         rm $TEMP/twins`num'.dta
  3. }

. rmdir $TEMP

. 
. replace _cou="CAR" if hv000=="CF3" &_cou==""
(0 real changes made)

. replace _cou="Zimbabwe" if hv000=="ZW6" &_cou==""
(0 real changes made)

. replace _year="2004" if hv000=="CF3" &_year==""
(0 real changes made)

. replace _year="2010" if hv000=="ZW6" &_year==""
(0 real changes made)

. 
. ***Year of birth for Nepal (convert from Vikram Samvat to Gregorian calendar)
. foreach year of varlist child_yob year_birth {
  2.         replace `year'=`year'+2000 if _cou=="Nepal" & `year'<100
  3.         replace `year'=`year'-57 if _cou=="Nepal"
  4. }
(29215 real changes made)
(111268 real changes made)
(29215 real changes made)
(111268 real changes made)

. ***Year of birth for Ethiopia (convert from Ge'ez to Gregorian calendar)
. foreach year of varlist child_yob year_birth {
  2.         replace `year'=`year'+8 if _cou=="Ethiopia"
  3. }
(129672 real changes made)
(129672 real changes made)

. 
. replace child_yob=child_yob+1900 if child_yob<100&child_yob>2
(2952497 real changes made)

. replace child_yob=child_yob+2000 if child_yob<=2
(2198 real changes made)

. replace year_birth=year_birth+1900 if year_birth<100
(2954695 real changes made)

. 
. save $PATH/Data/DHS_twins, replace
file ~/investigacion/Activa/Twins/Data/DHS_twins.dta saved

. 
. ********************************************************************************
. *** (3) Setup Variables which are used in TwinRegression
. ********************************************************************************
. use $PATH/Data/DHS_twins, clear

. 
. ********************************************************************************
. *** (3A) Generate sibling size subgroups (1+, 2+, 3+,...)  As per Angrist et al.
. ********************************************************************************
. gen mid="a"

. drop id

. egen id=concat(_cou mid _year mid v001 mid v002 mid v150 mid caseid)

. drop mid

. 
. local max 1

. local fert 2

. 
. gen twin_bord=bord-twin+1 if twin>0
(6597251 missing values generated)

. 
. foreach num in two three four five {
  2.         gen `num'_plus=(bord>=1&bord<=`max')&fert>=`fert'
  3.         gen `num'_plus_twins=((bord>=1&bord<=`fert')&fert>=`fert')|twin_bord==`fert'
  4.         replace `num'_plus=0 if twin!=0
  5.         gen twin`num'=(twin==1 & bord==`fert')|(twin==2 & bord==`fert'+1)
  6.         bys id: egen twin_`num'_fam=max(twin`num')
  7.         drop twin`num'
  8.         local ++max
  9.         local ++fert
 10. }
(13542 real changes made)
(34245 real changes made)
(47194 real changes made)
(52317 real changes made)

. 
. 
. ********************************************************************************
. *** (3B) "Quality" variables
. ********************************************************************************
. *** Attendance (attend_year==2 is sometimes)
. gen attendance=0 if attend_year==0
(5626466 missing values generated)

. replace attendance=1 if attend_year==2
(493836 real changes made)

. replace attendance=2 if attend_year==1
(394486 real changes made)

. replace attendance=. if age<6
(763384 real changes made, 763384 to missing)

. 
. *** Z-Score
. replace educ=. if educ>25 // come back here when compiling summary stats.
(13323 real changes made, 13323 to missing)

. bys _cou age: egen sd_educ=sd(educ)
(209305 missing values generated)

. bys _cou age: egen mean_educ=mean(educ)
(198354 missing values generated)

. gen school_zscore=(educ-mean_educ)/sd_educ
(4053285 missing values generated)

. replace school_zscore=. if age<6
(261290 real changes made, 261290 to missing)

. 
. *** Highschool
. gen highschool=1 if (educlevel==2|educlevel==3)&age>=11
(6097264 missing values generated)

. replace highschool=0 if (educlevel==0|educlevel==1)&age>=11
(782911 real changes made)

. 
. *** No Educ
. gen noeduc=1 if educlevel==0&age>6
(6427369 missing values generated)

. replace noeduc=0 if (educlevel==1|educlevel==2|educlevel==3)&age>6
(1908732 real changes made)

. 
. *** Health
. gen childsurvive=child_alive

. gen childageatdeath=b7/12
(5878336 missing values generated)

. gen infantmortality=childageatdeath<=1

. replace infantmortality=. if age<1
(324359 real changes made, 324359 to missing)

. gen childmortality=childageatdeath<=5

. replace childmortality=. if age<5
(1534888 real changes made, 1534888 to missing)

. 
. ********************************************************************************
. *** (3C) Control variables
. ********************************************************************************
. gen gender="F" if sex==2
(3459479 missing values generated)

. replace gender="M" if sex==1
(3459470 real changes made)

. 
. gen educfyrs_sq=educf*educf
(2077 missing values generated)

. gen educf_0=educf==0

. gen educf_1_4=educf>0&educf<5

. gen educf_5_6=educf>4&educf<7

. gen educf_7_10=educf>6&educf<11

. gen educf_11plus=educf>10

. gen twind=1 if twin>=1&twin!=.
(6597251 missing values generated)

. replace twind=0 if twin==0
(6597251 real changes made)

. gen twind100=twin*100

. gen malec=(gender=="M")

. 
. replace educp=. if educp>25
(188513 real changes made, 188513 to missing)

. 
. replace height=height/10
height was int now float
(3711914 real changes made)

. replace weight=weight/10
weightk was int now float
(3711880 real changes made)

. replace bmi=bmi/100
bmi was int now float
(3709360 real changes made)

. 
. gen poor1=wealth==1

. gen agesq=age*age

. gen magesq=agemay*agemay

. a
unrecognized command:  a
r(199);

end of do-file

r(199);

. do Twin_Setup

. * Twin_Setup 2.00                damiancclarke                            yyyy-mm-dd:2013-11-22    
. *---|----1----|----2----|----3----|----4----|----5----|----6----|----7----|----8
. *
. /* This is has been a pretty major refactorisation of the previous twin setup
> file.  To rollback to the previous one, return to the git commit made on Nov 11
> 2013.  Here we are redefining to only look at reduced form and IV with treament
> as described in Black et al, Angrist et al, and also to interact with desired
> family size.  Our principal specification for desired is:
> 
> quality_{ij}=\beta_0+\beta_1*fert_{j}+\beta_2*fert*desired_{j}+X'\beta+u_{ij}
> 
> 
> */
. 
. clear all

. version 11.2

. cap log close
