----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/damiancclarke/investigacion/Activa/Twins/Chile/ELPI/Log/ELPI_Setup.txt
  log type:  text
 opened on:  30 Apr 2014, 17:44:25

. 
. local initialreg 0

. local cleanreg 1

. 
. 
. local base m_age_birth m_age_sq indigenous 

. local tc_educ i.mother_educ

. local twincontrols_1 poor i.mother_educ i.nutritionPre pregAnemia  /*
> */ pregNoAttention pregSmoked i.pregDrugs i.pregAlcohol pregPublicHosp

. local twincontrols_2 poor mother_educ i.nutritionPre pregAnemia  /*
> */ pregNoAttention pregSmoked i.pregDrugs i.pregAlcohol pregPublicHosp

. local region i.region i.age rural

. 
. local w [pw=fexp_enc]

. local c if a16==13

. 
. ********************************************************************************
. *** (1) Create relevant vars from Hogar database
. ********************************************************************************
. use $DATA/Hogar

. bys folio: egen fert=total(a16==6) //a16==6 is sibling of index child

. replace fert=fert+1
(74232 real changes made)

. 
. gen child=1 if a16==6 | a16==13 //a16==13 is child chosen to be followed
(44965 missing values generated)

. gsort folio child -a19 

. bys folio: gen birthorder=_n if child==1
(44965 missing values generated)

. 
. bys folio: gen m_age=a19 if a16==1
(59236 missing values generated)

. bys folio: egen mother_age=mean(m_age)
(906 missing values generated)

. gen m_age_birth=mother_age-a19 if a16==6 | a16==13
(45235 missing values generated)

. drop m_age

. replace m_age_birth=. if m_age_birth<10
(25 real changes made, 25 to missing)

. gen m_age_sq=m_age_birth^2
(45260 missing values generated)

. 
. gen educ=1 if b02n==19|b02n==99
(61979 missing values generated)

. replace educ=2 if b02n<=4
(9549 real changes made)

. replace educ=3 if b02n>4 & b02n<=7
(19012 real changes made)

. replace educ=4 if b02n>7 & b02n<=11 & b02c<4
(9351 real changes made)

. replace educ=5 if b02n>7 & b02n<=11 & b02c>=4
(15792 real changes made)

. replace educ=6 if b02n==12|b02n==14
(1777 real changes made)

. replace educ=7 if b02n==16
(2076 real changes made)

. replace educ=8 if b02n==13|b02n==15
(2028 real changes made)

. replace educ=9 if b02n==17|b02n==18
(2326 real changes made)

. label def educ_lab 1 "None" 2 "Pre-school" 3 "Primary" ///
> 4 "Secondary incomplete"  5 "Secondary complete" 6 "Technical incomplete" ///
> 7"University incomplete" 8"Technical complete" 9 "University Complete"

. label val educ educ_lab

. gen mateduc=educ if a16==1
(59263 missing values generated)

. bys folio: egen mother_educ=mean(mateduc)
(1030 missing values generated)

. gen primary=educ<4&educ!=1

. gen secondary=(educ>=5&educ<=7)

. gen tertiary=(educ>7&educ!=.)

. 
. gen MP=primary if a16==1
(59236 missing values generated)

. gen MS=secondary if a16==1
(59236 missing values generated)

. gen MT=tertiary if a16==1
(59236 missing values generated)

. 
. bys folio: egen Mprimary=max(MP)
(906 missing values generated)

. by folio: egen Msecondary=max(MS)
(906 missing values generated)

. by folio: egen Mtertiary=max(MT)
(906 missing values generated)

. 
. 
. 
. *Gen family income, replacing for ranges
. gen family_income=d11m
(59057 missing values generated)

. replace family_income=50000 if d11t==1
(80 real changes made)

. replace family_income=98000 if d11t==2
(349 real changes made)

. replace family_income=191000 if d11t==3
(683 real changes made)

. replace family_income=300000 if d11t==4
(491 real changes made)

. replace family_income=400000 if d11t==5
(342 real changes made)

. replace family_income=550000 if d11t==6
(262 real changes made)

. replace family_income=750000 if d11t==7
(151 real changes made)

. replace family_income=950000 if d11t==8
(158 real changes made)

. replace family_income=1150000 if d11t==9
(72 real changes made)

. replace family_income=1500000 if d11t==10
(305 real changes made)

. replace family_income=. if family_income==99
(693 real changes made, 693 to missing)

. 
. bys folio: egen family_inc=max(family_income)
(3497 missing values generated)

. drop family_income

. 
. gen ypc=family_inc/tot_per
(3497 missing values generated)

. 
. gen incomepc=ypc/10000
(3497 missing values generated)

. gen incomepc2=incomepc^2
(3497 missing values generated)

. 
. rename a18 sex

. gen indigenous=(a23!=10&a23!=99)

. 
. label var m_age_birth "Age of mother at child's birth"

. label var sex "Gender"

. label var family_inc "Monthly family income"

. label var educ "Education level (not years)"

. label var mother_age "Current age of mother"

. label var child "Selected child or sibling"

. label var fert "Sibship size of selected child"

. label var birthorder "Order of births in child's family"

. label var ypc "Income per person in the household"

. label var mother_educ "Maternal education (of followed child)"

. 
. 
. keep folio a16 a19 orden tot_per d11m fexp_hog fert birthorder mother_age /*
> */ m_age_birth educ family_inc sex indigenous child ypc mother_educ m_age_sq /*
> */ Mprimary Msecondary Mtertiary incomepc*

. 
. ********************************************************************************
. *** (2) Create relevant vars from Entrevistada database
. ********************************************************************************
. merge m:1 folio using $DATA/Entrevistada
(label LABD already defined)
(label LABC already defined)
(label LABB already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            74,232  (_merge==3)
    -----------------------------------------

. 
. gen twin=(a03!=5)

. sort folio a03 child a19

. bys folio: gen agedif=a19[_n+1]-a19[_n] 
(15175 missing values generated)

. replace agedif=agedif*child
(29790 real changes made, 29790 to missing)

. gen agedif2=agedif[_n-1]
(44965 missing values generated)

. replace agedif2=agedif2*child
(15175 real changes made, 15175 to missing)

. 
. 
. 
. gen pregNoAttention = g01
(906 missing values generated)

. gen pregNumControls = g02
(1772 missing values generated)

. gen pregAnemia = (g03_08==8)

. gen pregDiabetes = g03_07==7

. gen pregCondPhysical = g03_13!=13

. gen pregCondPsychological = g04a_9!=9

. gen pregDepression = g04a_1==1

. gen pregNutrition = g06a
(906 missing values generated)

. gen pregLowWeight = g06a==1

. gen pregObese = g06a==4

. gen pregSmoked = g07a==1

. gen pregSmokedQuant = g07b
(66343 missing values generated)

. gen pregDrugs=g11b
(906 missing values generated)

. gen pregAlcohol=g09
(906 missing values generated)

. gen pregHosp=g16==1

. gen pregPrivateHosp=g16==3

. gen lowWeightPre = g05b==1

. gen obesePre = g05b==4

. gen nutritionPre = g05b
(906 missing values generated)

. 
. gen poor =ypc<32000

. gen age = a19

. gen rural = area

. 
. replace nutritionPre = . if nutritionPre>4
(104 real changes made, 104 to missing)

. replace pregNutrition = . if pregNutrition>4
(231 real changes made, 231 to missing)

. replace pregNoAttention = . if pregNoAttention==9
(4 real changes made, 4 to missing)

. replace pregNumControls = . if pregNumControls==9
(111 real changes made, 111 to missing)

. replace pregSmokedQuant = 0 if pregSmokedQuant==.
(66343 real changes made)

. replace pregSmokedQuant = . if pregSmokedQuant==999
(136 real changes made, 136 to missing)

. replace pregDrugs=. if pregDrugs==8
(117 real changes made, 117 to missing)

. replace pregAlcohol=. if pregAlcohol==8
(158 real changes made, 158 to missing)

. 
. 
. label def nutr 1 "Low weight" 2 "Normal" 3 "Overweight" 4 "Obese"  

. label val pregNutrition nutr

. label val nutritionPre nutr

. 
. 
. 
. label var pregNoAttention "Mother received no medical attention during pregnancy"

. label var pregNumControls "Number of pregnancy controls"

. label var pregAnemia "Mother suffered from Anemia during pregnancy"

. label var pregCondPhysical "Suffered from a physical condition during pregnancy"

. label var pregCondPsych "Suffered from a psychological condition during pregnancy"

. label var pregNutrition "Mother's nutritional status during pregnancy"

. label var nutritionPre "Mother's nutritional status before pregnancy"

. label var pregSmoked "Mother smoked during pregnancy (binary)"

. label var pregSmokedQuant "Quantity cigarettes smoked per month during pregnancy"

. label var pregDrugs "Mother consumed recreational drugs during pregnancy"

. label var pregAlcohol "Mother consumed alcohol during pregnancy"

. label var pregHosp "Birth took place in public hospital"

. label var pregPrivateHosp "Birth took place in private system"

. 
. ********************************************************************************
. *** (3a) Run twin predict regressions: crude used in early presentations
. ********************************************************************************
. if `initialreg'==1 {
.         reg twin `base' `region' `c' `w'
.         outreg2 using $PATH/Results/Outreg/ELPI_twinpredict.xls, excel replace
. 
.         reg twin `base' `twincontrols_2' `region' `c' `w'
.         outreg2 using  $PATH/Results/Outreg/ELPI_twinpredict.xls, excel append
. 
.         reg twin `base' `twincontrols_1' `region' if `c' `w'
.         outreg2 using $PATH/Results/Outreg/ELPI_twinpredict.xls, excel append
. 
.         reg twin i.birthorder `base' `region' `c' `w'
.         outreg2 using $PATH/Results/Outreg/ELPI_twinpredict.xls, excel
. 
.         reg twin i.birthorder `base' `twincontrols_2' `region' `c' `w'
.         outreg2 using  $PATH/Results/Outreg/ELPI_twinpredict.xls, excel append
. 
.         reg twin i.birthorder `base' `twincontrols_1' `region' `c' `w'
.         outreg2 using $PATH/Results/Outreg/ELPI_twinpredict.xls, excel append
. 
. 
.         sum birthorder `base' fert poor mother_educ preg_nutrition age rural /*
>         */ preg_nutrition preg_nutrition_dur preg_anemia preg_No_attention   /*
>         */ preg_smoked preg_drugs preg_alcohol preg_publichosp if a16==13
. } 

. 
. ********************************************************************************
. *** (3b) Updated output (pre versus during)
. ********************************************************************************
. fvexpand Msecondary Mtertiary incomepc* lowWeightPre obesePre

. local prePreg `r(varlist)'

. fvexpand pregNoAt pregDiab pregDepr pregLowW pregObese pregSmoked i.pregDru /*
> */ i.pregAlc pregHosp

. local preg `r(varlist)'

. 
. if `cleanreg'==1 {
.         replace twin=twin*100
(2028 real changes made)
.         eststo: reg twin `base' `region' `prePreg' `preg' `c' `w'
(sum of wgt is   8.2110e+05)

Linear regression                                      Number of obs =   14268
                                                       F( 39, 14228) =    3.77
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0037
                                                       Root MSE      =  15.701

---------------------------------------------------------------------------------
                |               Robust
           twin |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    m_age_birth |   .4098142   .1325711     3.09   0.002     .1499576    .6696708
       m_age_sq |  -.0067035   .0023002    -2.91   0.004    -.0112122   -.0021947
     indigenous |   -1.02711   .3947497    -2.60   0.009    -1.800871   -.2533492
                |
         region |
             2  |   .2926842   1.151014     0.25   0.799    -1.963455    2.548823
             3  |   .4944153   1.453046     0.34   0.734    -2.353745    3.342576
             4  |  -.6538139    1.11363    -0.59   0.557    -2.836674    1.529046
             5  |   -.404603   1.039565    -0.39   0.697    -2.442287    1.633081
             6  |  -.0643478   1.119322    -0.06   0.954    -2.258365    2.129669
             7  |   .1034394   1.116275     0.09   0.926    -2.084606    2.291485
             8  |  -.6096151   1.019073    -0.60   0.550    -2.607132    1.387902
             9  |   .0048716   1.115853     0.00   0.997    -2.182345    2.192089
            10  |   .0844034   1.110279     0.08   0.939    -2.091889    2.260696
            11  |  -.7848361    1.57909    -0.50   0.619    -3.880059    2.310386
            12  |   1.475296   1.914194     0.77   0.441    -2.276774    5.227365
            13  |   .2824755    .993214     0.28   0.776    -1.664354    2.229305
            14  |  -.5709159   1.284919    -0.44   0.657    -3.089525    1.947693
            15  |  -.8486683   1.253794    -0.68   0.498    -3.306269    1.608933
                |
            age |
             1  |  -.0948579   .5294628    -0.18   0.858    -1.132674    .9429585
             2  |   .3016904   .5396878     0.56   0.576    -.7561683    1.359549
             3  |   .1771795   .5367538     0.33   0.741    -.8749281    1.229287
             4  |   -.012848   .6331243    -0.02   0.984    -1.253854    1.228158
                |
          rural |  -.0576284    .452544    -0.13   0.899    -.9446739     .829417
     Msecondary |   .1415149    .300245     0.47   0.637    -.4470045    .7300343
      Mtertiary |   1.507037   .5825018     2.59   0.010     .3652578    2.648817
       incomepc |  -.0059246   .0109337    -0.54   0.588    -.0273561     .015507
      incomepc2 |   1.53e-06   .0000156     0.10   0.922    -.0000291    .0000322
   lowWeightPre |  -.5892202   .4714281    -1.25   0.211    -1.513281    .3348405
       obesePre |  -1.997176    .766203    -2.61   0.009    -3.499034   -.4953182
pregNoAttention |  -1.031101    .966134    -1.07   0.286     -2.92485    .8626478
   pregDiabetes |  -.2554113   .5054548    -0.51   0.613    -1.246169    .7353462
 pregDepression |   .0305387   .4163849     0.07   0.942    -.7856301    .8467075
  pregLowWeight |  -.5252125   .5443252    -0.96   0.335    -1.592161     .541736
      pregObese |   .3470769   .6959779     0.50   0.618    -1.017131    1.711285
     pregSmoked |  -.5728845     .41578    -1.38   0.168    -1.387868    .2420987
                |
      pregDrugs |
             2  |  -.1192377   1.646437    -0.07   0.942    -3.346469    3.107994
             3  |  -1.871705   .3437678    -5.44   0.000    -2.545534   -1.197875
                |
    pregAlcohol |
             2  |  -.0024822    .570071    -0.00   0.997    -1.119896    1.114931
             3  |  -1.890846   .2902931    -6.51   0.000    -2.459858   -1.321834
                |
       pregHosp |   .9390577   .3439964     2.73   0.006     .2647797    1.613336
          _cons |  -2.945253   2.503163    -1.18   0.239     -7.85178    1.961273
---------------------------------------------------------------------------------
(est1 stored)
.         estout est1 using "$RESULTS/twinELPI.xls", keep(`prePreg' `preg') replace /*
>         */ cells(b(star fmt(%-9.3f)) se(fmt(%-9.3f) par)) /*
>         */ stats (r2 N, fmt(%9.2f %9.0g)) starlevel ("*" 0.10 "**" 0.05 "***" 0.01)
(output written to ~/investigacion/Activa/Twins/Scientific/Results/twinELPI.xls)
. 
. }

. 
end of do-file

